*** hardening/careful/src/../../../src/quant/simd.rs:47:10: replace && with || in has_avx2_fma

*** mutation diff:
--- hardening/careful/src/../../../src/quant/simd.rs
+++ replace && with || in has_avx2_fma
@@ -39,17 +39,17 @@
         }
     }
 
     SimdBackend::Scalar
 }
 
 #[cfg(any(target_arch = "x86_64", test))]
 fn has_avx2_fma(avx2: bool, fma: bool) -> bool {
-    avx2 && fma
+    avx2 || /* ~ changed by cargo-mutants ~ */ fma
 }
 
 fn forced_backend_from_env() -> Option<SimdBackend> {
     let requested = env::var("ECAZ_SIMD").ok()?;
     match requested.trim().to_ascii_lowercase().as_str() {
         "" | "auto" => None,
         "scalar" => Some(SimdBackend::Scalar),
         #[cfg(target_arch = "x86_64")]

---- quant::simd::tests::x86_backend_gate_requires_avx2_and_fma stdout ----

thread 'quant::simd::tests::x86_backend_gate_requires_avx2_and_fma' (13615746) panicked at hardening/careful/src/../../../src/quant/simd.rs:140:9:
assertion failed: !has_avx2_fma(true, false)

failures:
    quant::simd::tests::x86_backend_gate_requires_avx2_and_fma

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.55s

*** result: Failure(101)
