*** hardening/careful/src/../../../src/quant/simd.rs:51:5: replace forced_backend_from_env -> Option<SimdBackend> with None

*** mutation diff:
--- hardening/careful/src/../../../src/quant/simd.rs
+++ replace forced_backend_from_env -> Option<SimdBackend> with None
@@ -43,26 +43,17 @@
 }
 
 #[cfg(any(target_arch = "x86_64", test))]
 fn has_avx2_fma(avx2: bool, fma: bool) -> bool {
     avx2 && fma
 }
 
 fn forced_backend_from_env() -> Option<SimdBackend> {
-    let requested = env::var("ECAZ_SIMD").ok()?;
-    match requested.trim().to_ascii_lowercase().as_str() {
-        "" | "auto" => None,
-        "scalar" => Some(SimdBackend::Scalar),
-        #[cfg(target_arch = "x86_64")]
-        "avx2" | "avx2_fma" | "avx2+fma" => Some(SimdBackend::Avx2Fma),
-        #[cfg(target_arch = "aarch64")]
-        "neon" => Some(SimdBackend::Neon),
-        other => panic!("unsupported ECAZ_SIMD value: {other}"),
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn backend_name() -> &'static str {
     match backend() {
         SimdBackend::Scalar => "scalar",
         #[cfg(target_arch = "x86_64")]
         SimdBackend::Avx2Fma => "avx2+fma",
         #[cfg(target_arch = "aarch64")]

---- quant::simd::tests::detect_backend_honors_forced_scalar stdout ----

thread 'quant::simd::tests::detect_backend_honors_forced_scalar' (13616210) panicked at hardening/careful/src/../../../src/quant/simd.rs:124:13:
assertion `left == right` failed
  left: Neon
 right: Scalar

---- quant::simd::tests::forced_backend_accepts_auto_empty_and_absent stdout ----

thread 'quant::simd::tests::forced_backend_accepts_auto_empty_and_absent' (13616211) panicked at hardening/careful/src/../../../src/quant/simd.rs:74:38:
ECAZ_SIMD test lock poisoned: PoisonError { .. }

---- quant::simd::tests::forced_backend_accepts_supported_backend_names stdout ----

thread 'quant::simd::tests::forced_backend_accepts_supported_backend_names' (13616212) panicked at hardening/careful/src/../../../src/quant/simd.rs:74:38:
ECAZ_SIMD test lock poisoned: PoisonError { .. }

failures:
    quant::simd::tests::detect_backend_honors_forced_scalar
    quant::simd::tests::forced_backend_accepts_auto_empty_and_absent
    quant::simd::tests::forced_backend_accepts_supported_backend_names
    quant::simd::tests::forced_backend_rejects_unknown_name

test result: FAILED. 92 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.54s

*** result: Failure(101)
