*** hardening/careful/src/../../../src/quant/simd.rs:64:5: replace backend_name -> &'static str with "xyzzy"

*** mutation diff:
--- hardening/careful/src/../../../src/quant/simd.rs
+++ replace backend_name -> &'static str with "xyzzy"
@@ -56,23 +56,17 @@
         "avx2" | "avx2_fma" | "avx2+fma" => Some(SimdBackend::Avx2Fma),
         #[cfg(target_arch = "aarch64")]
         "neon" => Some(SimdBackend::Neon),
         other => panic!("unsupported ECAZ_SIMD value: {other}"),
     }
 }
 
 pub(crate) fn backend_name() -> &'static str {
-    match backend() {
-        SimdBackend::Scalar => "scalar",
-        #[cfg(target_arch = "x86_64")]
-        SimdBackend::Avx2Fma => "avx2+fma",
-        #[cfg(target_arch = "aarch64")]
-        SimdBackend::Neon => "neon",
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::ffi::OsString;
     use std::panic;
     use std::sync::Mutex;

---- quant::simd::tests::backend_name_matches_detected_backend stdout ----

thread 'quant::simd::tests::backend_name_matches_detected_backend' (13617233) panicked at hardening/careful/src/../../../src/quant/simd.rs:146:34:
assertion `left == right` failed
  left: "xyzzy"
 right: "neon"

failures:
    quant::simd::tests::backend_name_matches_detected_backend

test result: FAILED. 95 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.54s

*** result: Failure(101)
