*** hardening/careful/src/../../../src/storage/page.rs:130:40: replace - with / in DataPage::raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace - with / in DataPage::raw_tuple
@@ -122,17 +122,17 @@
                 "tuple block mismatch: got {}, page is {}",
                 tid.block_number, self.block_number
             ));
         }
         if tid.offset_number == 0 {
             return Err("offset number must be 1-based".into());
         }
 
-        let index = (tid.offset_number - 1) as usize;
+        let index = (tid.offset_number / /* ~ changed by cargo-mutants ~ */ 1) as usize;
         self.tuples
             .get(index)
             .map(Vec::as_slice)
             .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))
     }
 
     pub fn update_raw_tuple(&mut self, tid: ItemPointer, payload: Vec<u8>) -> Result<(), String> {
         if tid.block_number != self.block_number {

---- careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip' (13871156) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1787:65:
called `Result::unwrap()` on an `Err` value: "tuple offset 1 out of range"

---- careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip' (13871158) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1743:62:
called `Result::unwrap()` on an `Err` value: "tuple offset 1 out of range"

---- careful_hnsw_page::tests::element_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::element_tuple_page_roundtrip' (13871153) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1619:56:
called `Result::unwrap()` on an `Err` value: "tuple offset 1 out of range"

failures:
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip
    careful_hnsw_page::tests::neighbor_tuple_page_roundtrip
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_hnsw_page::tests::rerank_tuple_page_roundtrip
    careful_hnsw_page::tests::turbo_hot_tuple_page_roundtrip
    careful_storage_page::tests::data_page_raw_round_trip

test result: FAILED. 189 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.70s

*** result: Failure(101)
