*** hardening/careful/src/../../../src/storage/page.rs:138:9: replace DataPage::update_raw_tuple -> Result<(), String> with Ok(())

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::update_raw_tuple -> Result<(), String> with Ok(())
@@ -130,40 +130,17 @@
         let index = (tid.offset_number - 1) as usize;
         self.tuples
             .get(index)
             .map(Vec::as_slice)
             .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))
     }
 
     pub fn update_raw_tuple(&mut self, tid: ItemPointer, payload: Vec<u8>) -> Result<(), String> {
-        if tid.block_number != self.block_number {
-            return Err(format!(
-                "tuple block mismatch: got {}, page is {}",
-                tid.block_number, self.block_number
-            ));
-        }
-        if tid.offset_number == 0 {
-            return Err("offset number must be 1-based".into());
-        }
-
-        let index = (tid.offset_number - 1) as usize;
-        let existing = self
-            .tuples
-            .get_mut(index)
-            .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))?;
-        if payload.len() != existing.len() {
-            return Err(format!(
-                "tuple length mismatch: got {}, expected {}",
-                payload.len(),
-                existing.len()
-            ));
-        }
-        *existing = payload;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone)]
 pub struct DataPageChain {
     pub(crate) page_size: usize,
     pub(crate) pages: Vec<DataPage>,
 }

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13871986) panicked at hardening/careful/src/lib.rs:153:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

---- tests::data_page_rejects_invalid_tid_lookups_and_updates stdout ----

thread 'tests::data_page_rejects_invalid_tid_lookups_and_updates' (13871988) panicked at hardening/careful/src/lib.rs:100:9:
assertion failed: page.update_raw_tuple(tid(FIRST_DATA_BLOCK_NUMBER + 1, 1),
        vec![9; 4]).is_err()

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::data_page_rejects_invalid_tid_lookups_and_updates

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
