*** hardening/careful/src/../../../src/storage/page.rs:144:30: replace == with != in DataPage::update_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace == with != in DataPage::update_raw_tuple
@@ -136,17 +136,17 @@
 
     pub fn update_raw_tuple(&mut self, tid: ItemPointer, payload: Vec<u8>) -> Result<(), String> {
         if tid.block_number != self.block_number {
             return Err(format!(
                 "tuple block mismatch: got {}, page is {}",
                 tid.block_number, self.block_number
             ));
         }
-        if tid.offset_number == 0 {
+        if tid.offset_number != /* ~ changed by cargo-mutants ~ */ 0 {
             return Err("offset number must be 1-based".into());
         }
 
         let index = (tid.offset_number - 1) as usize;
         let existing = self
             .tuples
             .get_mut(index)
             .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))?;

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13873334) panicked at hardening/careful/src/lib.rs:151:49:
called `Result::unwrap()` on an `Err` value: "offset number must be 1-based"

---- tests::data_page_rejects_invalid_tid_lookups_and_updates stdout ----

thread 'tests::data_page_rejects_invalid_tid_lookups_and_updates' (13873336) panicked at hardening/careful/src/../../../src/storage/page.rs:148:21:
attempt to subtract with overflow

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::data_page_rejects_invalid_tid_lookups_and_updates

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
