*** hardening/careful/src/../../../src/storage/page.rs:153:26: replace != with == in DataPage::update_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace != with == in DataPage::update_raw_tuple
@@ -145,17 +145,17 @@
             return Err("offset number must be 1-based".into());
         }
 
         let index = (tid.offset_number - 1) as usize;
         let existing = self
             .tuples
             .get_mut(index)
             .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))?;
-        if payload.len() != existing.len() {
+        if payload.len() == /* ~ changed by cargo-mutants ~ */ existing.len() {
             return Err(format!(
                 "tuple length mismatch: got {}, expected {}",
                 payload.len(),
                 existing.len()
             ));
         }
         *existing = payload;
         Ok(())

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13875365) panicked at hardening/careful/src/lib.rs:151:49:
called `Result::unwrap()` on an `Err` value: "tuple length mismatch: got 16, expected 16"

---- tests::data_page_rejects_invalid_tid_lookups_and_updates stdout ----

thread 'tests::data_page_rejects_invalid_tid_lookups_and_updates' (13875367) panicked at hardening/careful/src/lib.rs:109:9:
assertion failed: page.update_raw_tuple(inserted, vec![9; 3]).is_err()

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::data_page_rejects_invalid_tid_lookups_and_updates

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
