*** hardening/careful/src/../../../src/storage/page.rs:180:9: replace DataPageChain::page_size -> usize with 1

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPageChain::page_size -> usize with 1
@@ -172,17 +172,17 @@
     pub fn new(page_size: usize) -> Self {
         Self {
             page_size,
             pages: vec![DataPage::new(FIRST_DATA_BLOCK_NUMBER, page_size)],
         }
     }
 
     pub fn page_size(&self) -> usize {
-        self.page_size
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn pages(&self) -> &[DataPage] {
         &self.pages
     }
 
     pub fn get_page(&self, block_number: u32) -> Option<&DataPage> {
         let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13876712) panicked at hardening/careful/src/lib.rs:146:9:
assertion `left == right` failed
  left: 1
 right: 128

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.69s

*** result: Failure(101)
