*** hardening/careful/src/../../../src/storage/page.rs:184:9: replace DataPageChain::pages -> &[DataPage] with Vec::leak(Vec::new())

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPageChain::pages -> &[DataPage] with Vec::leak(Vec::new())
@@ -176,17 +176,17 @@
         }
     }
 
     pub fn page_size(&self) -> usize {
         self.page_size
     }
 
     pub fn pages(&self) -> &[DataPage] {
-        &self.pages
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_page(&self, block_number: u32) -> Option<&DataPage> {
         let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
         self.pages.get(index)
     }
 
     pub fn get_page_mut(&mut self, block_number: u32) -> Option<&mut DataPage> {

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples' (13877262) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1919:9:
assertion failed: chain.pages().len() > 1

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples' (13877261) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1877:9:
assertion failed: chain.pages().len() > 1

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples' (13877263) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1900:9:
assertion failed: chain.pages().len() > 1

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity
    tests::data_page_chain_zero_empty_pages_is_noop

test result: FAILED. 195 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
