*** hardening/careful/src/../../../src/storage/page.rs:201:53: replace == with != in DataPageChain::start_new_page_if_current_has_tuples

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace == with != in DataPageChain::start_new_page_if_current_has_tuples
@@ -193,17 +193,17 @@
         let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
         self.pages.get_mut(index)
     }
 
     pub fn start_new_page_if_current_has_tuples(&mut self) {
         if self
             .pages
             .last()
-            .map_or(true, |page| page.tuple_count() == 0)
+            .map_or(true, |page| page.tuple_count() != /* ~ changed by cargo-mutants ~ */ 0)
         {
             return;
         }
         let next_block = self
             .pages
             .last()
             .expect("page chain is non-empty")
             .block_number

---- careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page stdout ----

thread 'careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page' (13880118) panicked at hardening/careful/src/../../../src/storage/page.rs:382:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.68s

*** result: Failure(101)
