*** hardening/careful/src/../../../src/storage/page.rs:215:9: replace DataPageChain::append_empty_pages -> Option<(u32, u32)> with None

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPageChain::append_empty_pages -> Option<(u32, u32)> with None
@@ -207,36 +207,17 @@
             .last()
             .expect("page chain is non-empty")
             .block_number
             + 1;
         self.pages.push(DataPage::new(next_block, self.page_size));
     }
 
     pub fn append_empty_pages(&mut self, count: usize) -> Option<(u32, u32)> {
-        if count == 0 {
-            return None;
-        }
-
-        let first_block = self
-            .pages
-            .last()
-            .expect("page chain is non-empty")
-            .block_number
-            + 1;
-        for offset in 0..count {
-            self.pages
-                .push(DataPage::new(first_block + offset as u32, self.page_size));
-        }
-        let last_block = self
-            .pages
-            .last()
-            .expect("empty pages were appended")
-            .block_number;
-        Some((first_block, last_block))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn insert_raw_tuple(&mut self, payload: Vec<u8>) -> Result<ItemPointer, String> {
         if !element_or_neighbor_tuple_fits(payload.len(), self.page_size) {
             return Err(format!(
                 "tuple payload {} exceeds maximum page capacity {}",
                 payload.len(),
                 usable_page_bytes(self.page_size)

---- careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously stdout ----

thread 'careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously' (13882264) panicked at hardening/careful/src/../../../src/storage/page.rs:371:49:
called `Option::unwrap()` on a `None` value

failures:
    careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.70s

*** result: Failure(101)
