*** hardening/careful/src/../../../src/storage/page.rs:224:13: replace + with - in DataPageChain::append_empty_pages

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace + with - in DataPageChain::append_empty_pages
@@ -216,17 +216,17 @@
             return None;
         }
 
         let first_block = self
             .pages
             .last()
             .expect("page chain is non-empty")
             .block_number
-            + 1;
+            - /* ~ changed by cargo-mutants ~ */ 1;
         for offset in 0..count {
             self.pages
                 .push(DataPage::new(first_block + offset as u32, self.page_size));
         }
         let last_block = self
             .pages
             .last()
             .expect("empty pages were appended")

---- careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously stdout ----

thread 'careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously' (13886381) panicked at hardening/careful/src/../../../src/storage/page.rs:392:9:
assertion `left == right` failed
  left: (0, 1)
 right: (2, 3)

failures:
    careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.73s

*** result: Failure(101)
