*** hardening/careful/src/../../../src/storage/page.rs:238:12: delete ! in DataPageChain::insert_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ delete ! in DataPageChain::insert_raw_tuple
@@ -230,17 +230,17 @@
             .pages
             .last()
             .expect("empty pages were appended")
             .block_number;
         Some((first_block, last_block))
     }
 
     pub fn insert_raw_tuple(&mut self, payload: Vec<u8>) -> Result<ItemPointer, String> {
-        if !element_or_neighbor_tuple_fits(payload.len(), self.page_size) {
+        if  /* ~ changed by cargo-mutants ~ */element_or_neighbor_tuple_fits(payload.len(), self.page_size) {
             return Err(format!(
                 "tuple payload {} exceeds maximum page capacity {}",
                 payload.len(),
                 usable_page_bytes(self.page_size)
             ));
         }
 
         if self

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples' (13889412) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1874:57:
called `Result::unwrap()` on an `Err` value: "tuple payload 840 exceeds maximum page capacity 8168"

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples' (13889411) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1942:18:
called `Result::unwrap()` on an `Err` value: "tuple payload 2057 exceeds maximum page capacity 8168"

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples' (13889414) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1897:55:
called `Result::unwrap()` on an `Err` value: "tuple payload 588 exceeds maximum page capacity 8168"

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 194 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
