*** hardening/careful/src/../../../src/storage/page.rs:23:5: replace align_up -> usize with 1

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace align_up -> usize with 1
@@ -15,22 +15,17 @@
 pub const HEAPTID_INLINE_CAPACITY: usize = 10;
 pub const ITEM_POINTER_BYTES: usize = 6;
 pub const ITEM_POINTER_BLOCK_NUMBER_OFFSET: usize = 0;
 pub const ITEM_POINTER_OFFSET_NUMBER_OFFSET: usize = 4;
 pub const METADATA_BLOCK_NUMBER: u32 = 0;
 pub const FIRST_DATA_BLOCK_NUMBER: u32 = 1;
 
 pub(crate) const fn align_up(value: usize, alignment: usize) -> usize {
-    let remainder = value % alignment;
-    if remainder == 0 {
-        value
-    } else {
-        value + (alignment - remainder)
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Hash)]
 pub struct ItemPointer {
     pub block_number: u32,
     pub offset_number: u16,
 }

---- careful_hnsw_page::tests::metadata_decode_page_accepts_legacy_layout stdout ----

thread 'careful_hnsw_page::tests::metadata_decode_page_accepts_legacy_layout' (13849400) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1467:13:
range end index 8221 out of range for slice of length 8192

---- careful_hnsw_page::tests::metadata_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::metadata_page_roundtrip' (13849402) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:396:13:
range end index 8238 out of range for slice of length 8192

failures:
    careful_hnsw_page::tests::metadata_decode_page_accepts_legacy_layout
    careful_hnsw_page::tests::metadata_page_roundtrip

test result: FAILED. 203 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.60s

*** result: Failure(101)
