*** hardening/careful/src/../../../src/storage/page.rs:260:13: replace + with * in DataPageChain::insert_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace + with * in DataPageChain::insert_raw_tuple
@@ -252,17 +252,17 @@
             return last.insert_raw_tuple(payload);
         }
 
         let next_block = self
             .pages
             .last()
             .expect("page chain is non-empty")
             .block_number
-            + 1;
+            * /* ~ changed by cargo-mutants ~ */ 1;
         self.pages.push(DataPage::new(next_block, self.page_size));
         debug_assert!(
             self.pages
                 .iter()
                 .enumerate()
                 .all(|(i, page)| { page.block_number == FIRST_DATA_BLOCK_NUMBER + i as u32 }),
             "DataPageChain pages are not contiguous"
         );

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples' (13890770) panicked at hardening/careful/src/../../../src/storage/page.rs:262:9:
DataPageChain pages are not contiguous

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples' (13890769) panicked at hardening/careful/src/../../../src/storage/page.rs:262:9:
DataPageChain pages are not contiguous

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples' (13890767) panicked at hardening/careful/src/../../../src/storage/page.rs:262:9:
DataPageChain pages are not contiguous

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 197 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
