*** hardening/careful/src/../../../src/storage/page.rs:277:5: replace usable_page_bytes -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace usable_page_bytes -> usize with 0
@@ -269,17 +269,17 @@
         self.pages
             .last_mut()
             .expect("new page was pushed")
             .insert_raw_tuple(payload)
     }
 }
 
 pub(crate) fn usable_page_bytes(page_size: usize) -> usize {
-    page_size.saturating_sub(PAGE_HEADER_BYTES)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
     aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;

---- careful_hnsw_page::tests::compressed_element_tuple_fits_on_default_page stdout ----

thread 'careful_hnsw_page::tests::compressed_element_tuple_fits_on_default_page' (13890949) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1832:9:
assertion failed: element_tuple_fits_on_page(772, DEFAULT_PAGE_SIZE)

---- careful_hnsw_page::tests::level_cap_produces_fitting_neighbor_tuple stdout ----

thread 'careful_hnsw_page::tests::level_cap_produces_fitting_neighbor_tuple' (13890958) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1820:9:
assertion failed: neighbor_tuple_fits_on_page(cap, m, DEFAULT_PAGE_SIZE)

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples' (13890972) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1850:53:
called `Result::unwrap()` on an `Err` value: "tuple payload 846 exceeds maximum page capacity 0"

failures:
    careful_hnsw_page::tests::compressed_element_tuple_fits_on_default_page
    careful_hnsw_page::tests::level_cap_produces_fitting_neighbor_tuple
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::page_chain_prese

test result: FAILED. 193 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.62s

*** result: Failure(101)
