*** hardening/careful/src/../../../src/storage/page.rs:281:5: replace element_or_neighbor_tuple_fits -> bool with false

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace element_or_neighbor_tuple_fits -> bool with false
@@ -273,17 +273,17 @@
     }
 }
 
 pub(crate) fn usable_page_bytes(page_size: usize) -> usize {
     page_size.saturating_sub(PAGE_HEADER_BYTES)
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
-    aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples' (13893490) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1942:18:
called `Result::unwrap()` on an `Err` value: "tuple payload 2057 exceeds maximum page capacity 8168"

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples' (13893493) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1897:55:
called `Result::unwrap()` on an `Err` value: "tuple payload 588 exceeds maximum page capacity 8168"

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples' (13893492) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1916:52:
called `Result::unwrap()` on an `Err` value: "tuple payload 905 exceeds maximum page capacity 8168"

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 195 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.66s

*** result: Failure(101)
