*** hardening/careful/src/../../../src/storage/page.rs:285:40: replace + with * in aligned_tuple_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace + with * in aligned_tuple_bytes
@@ -277,17 +277,17 @@
     page_size.saturating_sub(PAGE_HEADER_BYTES)
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
     aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
-    let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
+    let tuple_len = TUPLE_HEADER_BYTES * /* ~ changed by cargo-mutants ~ */ payload_len + LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {
         tuple_len + (ALIGNMENT_BYTES - remainder)
     }
 }

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples' (13897773) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1942:18:
called `Result::unwrap()` on an `Err` value: "tuple payload 2057 exceeds maximum page capacity 8168"

---- careful_storage_page::tests::data_page_chain_overflow_creates_new_block stdout ----

thread 'careful_storage_page::tests::data_page_chain_overflow_creates_new_block' (13897805) panicked at hardening/careful/src/../../../src/storage/page.rs:363:65:
called `Result::unwrap()` on an `Err` value: "tuple payload 4000 exceeds maximum page capacity 8168"

---- careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages stdout ----

thread 'careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages' (13897807) panicked at hardening/careful/src/../../../src/storage/page.rs:317:57:
called `Result::unwrap()` on an `Err` value: "tuple payload 32 exceeds maximum page capacity 104"

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.62s

*** result: Failure(101)
