*** hardening/careful/src/../../../src/storage/page.rs:285:54: replace + with - in aligned_tuple_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace + with - in aligned_tuple_bytes
@@ -277,17 +277,17 @@
     page_size.saturating_sub(PAGE_HEADER_BYTES)
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
     aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
-    let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
+    let tuple_len = TUPLE_HEADER_BYTES + payload_len - /* ~ changed by cargo-mutants ~ */ LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {
         tuple_len + (ALIGNMENT_BYTES - remainder)
     }
 }

---- careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages stdout ----

thread 'careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages' (13896230) panicked at hardening/careful/src/../../../src/storage/page.rs:322:9:
assertion `left == right` failed
  left: 1
 right: 2

---- tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity stdout ----

thread 'tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity' (13896320) panicked at hardening/careful/src/lib.rs:175:9:
assertion failed: chain.insert_raw_tuple(vec![0; 40]).is_err()

---- tests::data_page_rejects_tuple_that_does_not_fit stdout ----

thread 'tests::data_page_rejects_tuple_that_does_not_fit' (13896324) panicked at hardening/careful/src/lib.rs:118:9:
assertion failed: page.insert_raw_tuple(vec![0; 24]).is_err()

failures:
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity
    tests::data_page_rejects_tuple_that_does_not_fit
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.66s

*** result: Failure(101)
