*** hardening/careful/src/../../../src/storage/page.rs:286:31: replace % with + in aligned_tuple_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace % with + in aligned_tuple_bytes
@@ -278,17 +278,17 @@
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
     aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
-    let remainder = tuple_len % ALIGNMENT_BYTES;
+    let remainder = tuple_len + /* ~ changed by cargo-mutants ~ */ ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {
         tuple_len + (ALIGNMENT_BYTES - remainder)
     }
 }
 
 pub fn raw_tuple_storage_bytes(payload_len: usize) -> usize {

---- careful_hnsw_page::tests::compressed_element_tuple_fits_on_default_page stdout ----

thread 'careful_hnsw_page::tests::compressed_element_tuple_fits_on_default_page' (13899095) panicked at hardening/careful/src/../../../src/storage/page.rs:290:21:
attempt to subtract with overflow

---- careful_hnsw_page::tests::level_cap_produces_fitting_neighbor_tuple stdout ----

thread 'careful_hnsw_page::tests::level_cap_produces_fitting_neighbor_tuple' (13899104) panicked at hardening/careful/src/../../../src/storage/page.rs:290:21:
attempt to subtract with overflow

---- careful_hnsw_page::tests::element_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::element_tuple_page_roundtrip' (13899096) panicked at hardening/careful/src/../../../src/storage/page.rs:290:21:
attempt to subtract with overflow

failures:
    careful_hnsw_page::tests::compressed_element_tuple_fits_on_default_page
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip
    careful_hnsw_page::tests::level_cap_produces_fitting_neighbor_tuple
    careful_hnsw_page::tests::neighbor_tuple_page_roundtrip
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_hnsw_page::tests::rerank_tuple_page_roundtrip

test result: FAILED. 182 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
