*** hardening/careful/src/../../../src/storage/page.rs:290:19: replace + with * in aligned_tuple_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace + with * in aligned_tuple_bytes
@@ -282,17 +282,17 @@
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {
-        tuple_len + (ALIGNMENT_BYTES - remainder)
+        tuple_len * /* ~ changed by cargo-mutants ~ */ (ALIGNMENT_BYTES - remainder)
     }
 }
 
 pub fn raw_tuple_storage_bytes(payload_len: usize) -> usize {
     aligned_tuple_bytes(payload_len)
 }
 
 #[cfg(test)]

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples' (13901664) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1942:18:
called `Result::unwrap()` on an `Err` value: "tuple payload 2057 exceeds maximum page capacity 8168"

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
