*** hardening/careful/src/../../../src/storage/page.rs:49:24: replace != with == in ItemPointer::decode

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace != with == in ItemPointer::decode
@@ -41,17 +41,17 @@
     };
 
     pub fn encode_into(self, out: &mut Vec<u8>) {
         out.extend_from_slice(&self.block_number.to_le_bytes());
         out.extend_from_slice(&self.offset_number.to_le_bytes());
     }
 
     pub fn decode(input: &[u8]) -> Result<Self, String> {
-        if input.len() != ITEM_POINTER_BYTES {
+        if input.len() == /* ~ changed by cargo-mutants ~ */ ITEM_POINTER_BYTES {
             return Err(format!(
                 "item pointer length mismatch: got {}, expected {ITEM_POINTER_BYTES}",
                 input.len()
             ));
         }
 
         Ok(Self {
             block_number: u32::from_le_bytes(input[..4].try_into().expect("block number bytes")),

---- careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips stdout ----

thread 'careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips' (13855478) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:272:60:
decode: "item pointer length mismatch: got 6, expected 6"

---- careful_diskann_tuple::tests::la_017_deleted_flag_roundtrips stdout ----

thread 'careful_diskann_tuple::tests::la_017_deleted_flag_roundtrips' (13855486) panicked at hardening/careful/src/../../../src/am/ec_diskann/tuple.rs:471:66:
decode: "item pointer length mismatch: got 6, expected 6"

---- careful_diskann_page::tests::la_005_alpha_f32_bit_exact stdout ----

thread 'careful_diskann_page::tests::la_005_alpha_f32_bit_exact' (13855476) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:243:60:
decode: "item pointer length mismatch: got 6, expected 6"

failures:
    careful_diskann_page::tests::la_001_fresh_metadata_roundtrip
    careful_diskann_page::tests::la_005_alpha_f32_bit_exact
    careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips
    careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head
    careful_diskann_tuple::tests::la_010_empty_node_roundtrip
    careful_diskann_tuple::tests::la_016_empty_slots_are_invalid_pointer
    careful_diskann_tuple::tests::la_017_deleted_flag_roundtrips
    careful_diskann_tuple::tests::la_018_overflow_heaptids_flag_independent
    careful_diskann_tuple::tests::miri_la_011_filled_node_roundtrip
    careful_diskann_tuple::tests::miri_la_030_codebook_tuple_roundtrip
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::element_tuple_ref_exposes_borrowed_code_and_live_heaptids

test result: FAILED. 165 passed; 40 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.60s

*** result: Failure(101)
