*** hardening/careful/src/../../../src/storage/page.rs:86:9: replace DataPage::tuple_count -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::tuple_count -> usize with 0
@@ -78,17 +78,17 @@
         }
     }
 
     pub fn block_number(&self) -> u32 {
         self.block_number
     }
 
     pub fn tuple_count(&self) -> usize {
-        self.tuples.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn tuples(&self) -> &[Vec<u8>] {
         &self.tuples
     }
 
     pub fn free_bytes(&self) -> usize {
         self.page_size.saturating_sub(self.used_bytes)

---- careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page stdout ----

thread 'careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page' (13857758) panicked at hardening/careful/src/../../../src/storage/page.rs:382:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.71s

*** result: Failure(101)
