*** hardening/careful/src/../../../src/storage/page.rs:86:9: replace DataPage::tuple_count -> usize with 1

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::tuple_count -> usize with 1
@@ -78,17 +78,17 @@
         }
     }
 
     pub fn block_number(&self) -> u32 {
         self.block_number
     }
 
     pub fn tuple_count(&self) -> usize {
-        self.tuples.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn tuples(&self) -> &[Vec<u8>] {
         &self.tuples
     }
 
     pub fn free_bytes(&self) -> usize {
         self.page_size.saturating_sub(self.used_bytes)

---- careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page stdout ----

thread 'careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page' (13858285) panicked at hardening/careful/src/../../../src/storage/page.rs:382:9:
assertion `left == right` failed
  left: 3
 right: 2

---- careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously stdout ----

thread 'careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously' (13858284) panicked at hardening/careful/src/../../../src/storage/page.rs:397:9:
assertion `left == right` failed
  left: 1
 right: 0

---- tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity stdout ----

thread 'tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity' (13858379) panicked at hardening/careful/src/lib.rs:177:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page
    tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity
    tests::data_page_reports_layout_and_free_space

test result: FAILED. 201 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
