*** hardening/careful/src/../../../src/storage/page.rs:90:9: replace DataPage::tuples -> &[Vec<u8>] with Vec::leak(vec![vec![1]])

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::tuples -> &[Vec<u8>] with Vec::leak(vec![vec![1]])
@@ -82,17 +82,17 @@
         self.block_number
     }
 
     pub fn tuple_count(&self) -> usize {
         self.tuples.len()
     }
 
     pub fn tuples(&self) -> &[Vec<u8>] {
-        &self.tuples
+        Vec::leak(vec![vec![1]]) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn free_bytes(&self) -> usize {
         self.page_size.saturating_sub(self.used_bytes)
     }
 
     pub fn can_fit_raw_tuple(&self, payload_len: usize) -> bool {
         aligned_tuple_bytes(payload_len) <= self.free_bytes()

---- tests::data_page_reports_layout_and_free_space stdout ----

thread 'tests::data_page_reports_layout_and_free_space' (13861090) panicked at hardening/careful/src/lib.rs:87:9:
assertion `left == right` failed
  left: [[1]]
 right: [[170, 170, 170, 170, 170, 170, 170, 170, 170, 170, 170, 170, 170, 170, 170, 170]]

failures:
    tests::data_page_reports_layout_and_free_space

test result: FAILED. 204 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.67s

*** result: Failure(101)
