*** hardening/careful/src/../../../src/storage/page.rs:94:9: replace DataPage::free_bytes -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::free_bytes -> usize with 0
@@ -86,17 +86,17 @@
         self.tuples.len()
     }
 
     pub fn tuples(&self) -> &[Vec<u8>] {
         &self.tuples
     }
 
     pub fn free_bytes(&self) -> usize {
-        self.page_size.saturating_sub(self.used_bytes)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn can_fit_raw_tuple(&self, payload_len: usize) -> bool {
         aligned_tuple_bytes(payload_len) <= self.free_bytes()
     }
 
     pub fn insert_raw_tuple(&mut self, payload: Vec<u8>) -> Result<ItemPointer, String> {
         if !self.can_fit_raw_tuple(payload.len()) {

---- careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip' (13861766) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1786:62:
called `Result::unwrap()` on an `Err` value: "tuple payload 265 does not fit on block 1 with 0 bytes free"

---- careful_hnsw_page::tests::element_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::element_tuple_page_roundtrip' (13861763) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1618:53:
called `Result::unwrap()` on an `Err` value: "tuple payload 114 does not fit on block 1 with 0 bytes free"

---- careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip' (13861768) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1742:57:
called `Result::unwrap()` on an `Err` value: "tuple payload 95 does not fit on block 1 with 0 bytes free"

failures:
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip
    careful_hnsw_page::tests::neighbor_tuple_page_roundtrip
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_hnsw_page::tests::rerank_tuple_page_roundtrip
    careful_hnsw_page::tests::turbo_hot_tuple_page_roundtrip
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page

test result: FAILED. 186 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.72s

*** result: Failure(101)
