*** hardening/careful/src/../../../src/storage/page.rs:102:12: delete ! in DataPage::insert_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ delete ! in DataPage::insert_raw_tuple
@@ -94,17 +94,17 @@
         self.page_size.saturating_sub(self.used_bytes)
     }
 
     pub fn can_fit_raw_tuple(&self, payload_len: usize) -> bool {
         aligned_tuple_bytes(payload_len) <= self.free_bytes()
     }
 
     pub fn insert_raw_tuple(&mut self, payload: Vec<u8>) -> Result<ItemPointer, String> {
-        if !self.can_fit_raw_tuple(payload.len()) {
+        if  /* ~ changed by cargo-mutants ~ */self.can_fit_raw_tuple(payload.len()) {
             return Err(format!(
                 "tuple payload {} does not fit on block {} with {} bytes free",
                 payload.len(),
                 self.block_number,
                 self.free_bytes()
             ));
         }

---- careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip' (13923271) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1742:57:
called `Result::unwrap()` on an `Err` value: "tuple payload 95 does not fit on block 1 with 8168 bytes free"

---- careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip' (13923269) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1786:62:
called `Result::unwrap()` on an `Err` value: "tuple payload 265 does not fit on block 1 with 8168 bytes free"

---- careful_hnsw_page::tests::element_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::element_tuple_page_roundtrip' (13923266) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1618:53:
called `Result::unwrap()` on an `Err` value: "tuple payload 114 does not fit on block 1 with 8168 bytes free"

failures:
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip
    careful_hnsw_page::tests::neighbor_tuple_page_roundtrip
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_hnsw_page::tests::rerank_tuple_page_roundtrip
    careful_hnsw_page::tests::turbo_hot_tuple_page_roundtrip
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page

test result: FAILED. 186 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
