*** hardening/careful/src/../../../src/storage/page.rs:111:25: replace += with -= in DataPage::insert_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace += with -= in DataPage::insert_raw_tuple
@@ -103,17 +103,17 @@
             return Err(format!(
                 "tuple payload {} does not fit on block {} with {} bytes free",
                 payload.len(),
                 self.block_number,
                 self.free_bytes()
             ));
         }
 
-        self.used_bytes += aligned_tuple_bytes(payload.len());
+        self.used_bytes -= /* ~ changed by cargo-mutants ~ */ aligned_tuple_bytes(payload.len());
         self.tuples.push(payload);
         Ok(ItemPointer {
             block_number: self.block_number,
             offset_number: u16::try_from(self.tuples.len()).expect("tuple count should fit in u16"),
         })
     }
 
     pub fn raw_tuple(&self, tid: ItemPointer) -> Result<&[u8], String> {

---- careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip' (13923947) panicked at hardening/careful/src/../../../src/storage/page.rs:111:9:
attempt to subtract with overflow

---- careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip' (13923945) panicked at hardening/careful/src/../../../src/storage/page.rs:111:9:
attempt to subtract with overflow

---- careful_hnsw_page::tests::element_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::element_tuple_page_roundtrip' (13923942) panicked at hardening/careful/src/../../../src/storage/page.rs:111:9:
attempt to subtract with overflow

failures:
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip
    careful_hnsw_page::tests::neighbor_tuple_page_roundtrip
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_hnsw_page::tests::rerank_tuple_page_roundtrip
    careful_hnsw_page::tests::turbo_hot_tuple_page_roundtrip
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block

test result: FAILED. 190 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.73s

*** result: Failure(101)
