*** hardening/careful/src/../../../src/storage/page.rs:111:25: replace += with *= in DataPage::insert_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace += with *= in DataPage::insert_raw_tuple
@@ -103,17 +103,17 @@
             return Err(format!(
                 "tuple payload {} does not fit on block {} with {} bytes free",
                 payload.len(),
                 self.block_number,
                 self.free_bytes()
             ));
         }
 
-        self.used_bytes += aligned_tuple_bytes(payload.len());
+        self.used_bytes *= /* ~ changed by cargo-mutants ~ */ aligned_tuple_bytes(payload.len());
         self.tuples.push(payload);
         Ok(ItemPointer {
             block_number: self.block_number,
             offset_number: u16::try_from(self.tuples.len()).expect("tuple count should fit in u16"),
         })
     }
 
     pub fn raw_tuple(&self, tid: ItemPointer) -> Result<&[u8], String> {

---- careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages stdout ----

thread 'careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages' (13924669) panicked at hardening/careful/src/../../../src/storage/page.rs:322:9:
assertion `left == right` failed
  left: 3
 right: 2

---- careful_storage_page::tests::data_page_chain_overflow_creates_new_block stdout ----

thread 'careful_storage_page::tests::data_page_chain_overflow_creates_new_block' (13924667) panicked at hardening/careful/src/../../../src/storage/page.rs:367:9:
assertion `left == right` failed
  left: 2
 right: 1

---- tests::data_page_reports_layout_and_free_space stdout ----

thread 'tests::data_page_reports_layout_and_free_space' (13924764) panicked at hardening/careful/src/lib.rs:96:9:
assertion `left == right` failed
  left: 0
 right: 48

failures:
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_reports_layout_and_free_space
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 202 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.75s

*** result: Failure(101)
