*** hardening/careful/src/../../../src/storage/page.rs:120:29: replace != with == in DataPage::raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace != with == in DataPage::raw_tuple
@@ -112,17 +112,17 @@
         self.tuples.push(payload);
         Ok(ItemPointer {
             block_number: self.block_number,
             offset_number: u16::try_from(self.tuples.len()).expect("tuple count should fit in u16"),
         })
     }
 
     pub fn raw_tuple(&self, tid: ItemPointer) -> Result<&[u8], String> {
-        if tid.block_number != self.block_number {
+        if tid.block_number == /* ~ changed by cargo-mutants ~ */ self.block_number {
             return Err(format!(
                 "tuple block mismatch: got {}, page is {}",
                 tid.block_number, self.block_number
             ));
         }
         if tid.offset_number == 0 {
             return Err("offset number must be 1-based".into());
         }

---- careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip' (13927469) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1787:65:
called `Result::unwrap()` on an `Err` value: "tuple block mismatch: got 1, page is 1"

---- careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip' (13927471) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1743:62:
called `Result::unwrap()` on an `Err` value: "tuple block mismatch: got 1, page is 1"

---- careful_hnsw_page::tests::element_tuple_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::element_tuple_page_roundtrip' (13927466) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1619:56:
called `Result::unwrap()` on an `Err` value: "tuple block mismatch: got 1, page is 1"

failures:
    careful_hnsw_page::tests::element_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_codebook_tuple_page_roundtrip
    careful_hnsw_page::tests::grouped_hot_tuple_page_roundtrip
    careful_hnsw_page::tests::neighbor_tuple_page_roundtrip
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_hnsw_page::tests::rerank_tuple_page_roundtrip
    careful_hnsw_page::tests::turbo_hot_tuple_page_roundtrip
    careful_storage_page::tests::data_page_raw_round_trip

test result: FAILED. 190 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.72s

*** result: Failure(101)
