*** hardening/careful/src/../../../src/storage/page.rs:138:29: replace != with == in DataPage::update_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace != with == in DataPage::update_raw_tuple
@@ -130,17 +130,17 @@
         let index = (tid.offset_number - 1) as usize;
         self.tuples
             .get(index)
             .map(Vec::as_slice)
             .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))
     }
 
     pub fn update_raw_tuple(&mut self, tid: ItemPointer, payload: Vec<u8>) -> Result<(), String> {
-        if tid.block_number != self.block_number {
+        if tid.block_number == /* ~ changed by cargo-mutants ~ */ self.block_number {
             return Err(format!(
                 "tuple block mismatch: got {}, page is {}",
                 tid.block_number, self.block_number
             ));
         }
         if tid.offset_number == 0 {
             return Err("offset number must be 1-based".into());
         }

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13931354) panicked at hardening/careful/src/lib.rs:159:49:
called `Result::unwrap()` on an `Err` value: "tuple block mismatch: got 1, page is 1"

---- tests::data_page_rejects_invalid_tid_lookups_and_updates stdout ----

thread 'tests::data_page_rejects_invalid_tid_lookups_and_updates' (13931356) panicked at hardening/careful/src/lib.rs:108:9:
assertion failed: page.update_raw_tuple(tid(FIRST_DATA_BLOCK_NUMBER + 1, 1),
        vec![9; 4]).is_err()

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::data_page_rejects_invalid_tid_lookups_and_updates

test result: FAILED. 204 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.78s

*** result: Failure(101)
