*** hardening/careful/src/../../../src/storage/page.rs:148:40: replace - with + in DataPage::update_raw_tuple

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace - with + in DataPage::update_raw_tuple
@@ -140,17 +140,17 @@
                 "tuple block mismatch: got {}, page is {}",
                 tid.block_number, self.block_number
             ));
         }
         if tid.offset_number == 0 {
             return Err("offset number must be 1-based".into());
         }
 
-        let index = (tid.offset_number - 1) as usize;
+        let index = (tid.offset_number + /* ~ changed by cargo-mutants ~ */ 1) as usize;
         let existing = self
             .tuples
             .get_mut(index)
             .ok_or_else(|| format!("tuple offset {} out of range", tid.offset_number))?;
         if payload.len() != existing.len() {
             return Err(format!(
                 "tuple length mismatch: got {}, expected {}",
                 payload.len(),

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13932833) panicked at hardening/careful/src/lib.rs:159:49:
called `Result::unwrap()` on an `Err` value: "tuple offset 1 out of range"

---- tests::data_page_rejects_invalid_tid_lookups_and_updates stdout ----

thread 'tests::data_page_rejects_invalid_tid_lookups_and_updates' (13932835) panicked at hardening/careful/src/lib.rs:119:53:
called `Result::unwrap()` on an `Err` value: "tuple offset 1 out of range"

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::data_page_rejects_invalid_tid_lookups_and_updates

test result: FAILED. 204 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.77s

*** result: Failure(101)
