*** hardening/careful/src/../../../src/storage/page.rs:188:9: replace DataPageChain::get_page -> Option<&DataPage> with None

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPageChain::get_page -> Option<&DataPage> with None
@@ -180,18 +180,17 @@
         self.page_size
     }
 
     pub fn pages(&self) -> &[DataPage] {
         &self.pages
     }
 
     pub fn get_page(&self, block_number: u32) -> Option<&DataPage> {
-        let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
-        self.pages.get(index)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_page_mut(&mut self, block_number: u32) -> Option<&mut DataPage> {
         let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
         self.pages.get_mut(index)
     }
 
     pub fn start_new_page_if_current_has_tuples(&mut self) {

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples' (13936868) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1921:56:
called `Result::unwrap()` on an `Err` value: "block 3 not found"

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples' (13936867) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1879:64:
called `Result::unwrap()` on an `Err` value: "block 3 not found"

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples' (13936869) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1902:58:
called `Result::unwrap()` on an `Err` value: "block 2 not found"

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_chain_reports_size_and_mutates_existing_page
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 198 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.80s

*** result: Failure(101)
