*** hardening/careful/src/../../../src/storage/page.rs:193:9: replace DataPageChain::get_page_mut -> Option<&mut DataPage> with None

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPageChain::get_page_mut -> Option<&mut DataPage> with None
@@ -185,18 +185,17 @@
     }
 
     pub fn get_page(&self, block_number: u32) -> Option<&DataPage> {
         let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
         self.pages.get(index)
     }
 
     pub fn get_page_mut(&mut self, block_number: u32) -> Option<&mut DataPage> {
-        let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
-        self.pages.get_mut(index)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn start_new_page_if_current_has_tuples(&mut self) {
         if self
             .pages
             .last()
             .map_or(true, |page| page.tuple_count() == 0)
         {

---- tests::data_page_chain_reports_size_and_mutates_existing_page stdout ----

thread 'tests::data_page_chain_reports_size_and_mutates_existing_page' (13937677) panicked at hardening/careful/src/lib.rs:158:57:
called `Option::unwrap()` on a `None` value

failures:
    tests::data_page_chain_reports_size_and_mutates_existing_page

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.73s

*** result: Failure(101)
