*** hardening/careful/src/../../../src/storage/page.rs:198:9: replace DataPageChain::start_new_page_if_current_has_tuples with ()

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPageChain::start_new_page_if_current_has_tuples with ()
@@ -190,30 +190,17 @@
     }
 
     pub fn get_page_mut(&mut self, block_number: u32) -> Option<&mut DataPage> {
         let index = block_number.checked_sub(FIRST_DATA_BLOCK_NUMBER)? as usize;
         self.pages.get_mut(index)
     }
 
     pub fn start_new_page_if_current_has_tuples(&mut self) {
-        if self
-            .pages
-            .last()
-            .map_or(true, |page| page.tuple_count() == 0)
-        {
-            return;
-        }
-        let next_block = self
-            .pages
-            .last()
-            .expect("page chain is non-empty")
-            .block_number
-            + 1;
-        self.pages.push(DataPage::new(next_block, self.page_size));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn append_empty_pages(&mut self, count: usize) -> Option<(u32, u32)> {
         if count == 0 {
             return None;
         }
 
         let first_block = self

---- careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page stdout ----

thread 'careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page' (13938445) panicked at hardening/careful/src/../../../src/storage/page.rs:369:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    careful_storage_page::tests::data_page_chain_can_start_next_tuple_on_fresh_page

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.81s

*** result: Failure(101)
