*** hardening/careful/src/../../../src/storage/page.rs:215:18: replace == with != in DataPageChain::append_empty_pages

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace == with != in DataPageChain::append_empty_pages
@@ -207,17 +207,17 @@
             .last()
             .expect("page chain is non-empty")
             .block_number
             + 1;
         self.pages.push(DataPage::new(next_block, self.page_size));
     }
 
     pub fn append_empty_pages(&mut self, count: usize) -> Option<(u32, u32)> {
-        if count == 0 {
+        if count != /* ~ changed by cargo-mutants ~ */ 0 {
             return None;
         }
 
         let first_block = self
             .pages
             .last()
             .expect("page chain is non-empty")
             .block_number

---- careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously stdout ----

thread 'careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously' (13944502) panicked at hardening/careful/src/../../../src/storage/page.rs:390:49:
called `Option::unwrap()` on a `None` value

---- tests::data_page_chain_zero_empty_pages_is_noop stdout ----

thread 'tests::data_page_chain_zero_empty_pages_is_noop' (13944598) panicked at hardening/careful/src/lib.rs:175:9:
assertion `left == right` failed
  left: Some((2, 1))
 right: None

failures:
    careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously
    tests::data_page_chain_zero_empty_pages_is_noop

test result: FAILED. 204 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.69s

*** result: Failure(101)
