*** hardening/careful/src/../../../src/storage/page.rs:227:49: replace + with * in DataPageChain::append_empty_pages

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace + with * in DataPageChain::append_empty_pages
@@ -219,17 +219,17 @@
         let first_block = self
             .pages
             .last()
             .expect("page chain is non-empty")
             .block_number
             + 1;
         for offset in 0..count {
             self.pages
-                .push(DataPage::new(first_block + offset as u32, self.page_size));
+                .push(DataPage::new(first_block * /* ~ changed by cargo-mutants ~ */ offset as u32, self.page_size));
         }
         let last_block = self
             .pages
             .last()
             .expect("empty pages were appended")
             .block_number;
         Some((first_block, last_block))
     }

---- careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously stdout ----

thread 'careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously' (13947415) panicked at hardening/careful/src/../../../src/storage/page.rs:392:9:
assertion `left == right` failed
  left: (2, 2)
 right: (2, 3)

failures:
    careful_storage_page::tests::data_page_chain_appends_empty_pages_contiguously

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
