*** hardening/careful/src/../../../src/storage/page.rs:23:27: replace % with / in align_up

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace % with / in align_up
@@ -15,17 +15,17 @@
 pub const HEAPTID_INLINE_CAPACITY: usize = 10;
 pub const ITEM_POINTER_BYTES: usize = 6;
 pub const ITEM_POINTER_BLOCK_NUMBER_OFFSET: usize = 0;
 pub const ITEM_POINTER_OFFSET_NUMBER_OFFSET: usize = 4;
 pub const METADATA_BLOCK_NUMBER: u32 = 0;
 pub const FIRST_DATA_BLOCK_NUMBER: u32 = 1;
 
 pub(crate) const fn align_up(value: usize, alignment: usize) -> usize {
-    let remainder = value % alignment;
+    let remainder = value / /* ~ changed by cargo-mutants ~ */ alignment;
     if remainder == 0 {
         value
     } else {
         value + (alignment - remainder)
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Hash)]

---- tests::page_alignment_helpers_preserve_exact_and_round_up_cases stdout ----

thread 'tests::page_alignment_helpers_preserve_exact_and_round_up_cases' (13909532) panicked at hardening/careful/src/lib.rs:78:9:
assertion `left == right` failed
  left: 22
 right: 16

failures:
    tests::page_alignment_helpers_preserve_exact_and_round_up_cases

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
