*** hardening/careful/src/../../../src/storage/page.rs:23:5: replace align_up -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace align_up -> usize with 0
@@ -15,22 +15,17 @@
 pub const HEAPTID_INLINE_CAPACITY: usize = 10;
 pub const ITEM_POINTER_BYTES: usize = 6;
 pub const ITEM_POINTER_BLOCK_NUMBER_OFFSET: usize = 0;
 pub const ITEM_POINTER_OFFSET_NUMBER_OFFSET: usize = 4;
 pub const METADATA_BLOCK_NUMBER: u32 = 0;
 pub const FIRST_DATA_BLOCK_NUMBER: u32 = 1;
 
 pub(crate) const fn align_up(value: usize, alignment: usize) -> usize {
-    let remainder = value % alignment;
-    if remainder == 0 {
-        value
-    } else {
-        value + (alignment - remainder)
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Hash)]
 pub struct ItemPointer {
     pub block_number: u32,
     pub offset_number: u16,
 }

---- careful_hnsw_page::tests::metadata_decode_page_accepts_legacy_layout stdout ----

thread 'careful_hnsw_page::tests::metadata_decode_page_accepts_legacy_layout' (13906687) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1467:13:
range end index 8222 out of range for slice of length 8192

---- careful_hnsw_page::tests::metadata_page_roundtrip stdout ----

thread 'careful_hnsw_page::tests::metadata_page_roundtrip' (13906689) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:396:13:
range end index 8239 out of range for slice of length 8192

---- tests::page_alignment_helpers_preserve_exact_and_round_up_cases stdout ----

thread 'tests::page_alignment_helpers_preserve_exact_and_round_up_cases' (13906835) panicked at hardening/careful/src/lib.rs:78:9:
assertion `left == right` failed
  left: 0
 right: 16

failures:
    careful_hnsw_page::tests::metadata_decode_page_accepts_legacy_layout
    careful_hnsw_page::tests::metadata_page_roundtrip
    tests::page_alignment_helpers_preserve_exact_and_round_up_cases

test result: FAILED. 203 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
