*** hardening/careful/src/../../../src/storage/page.rs:281:5: replace element_or_neighbor_tuple_fits -> bool with true

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace element_or_neighbor_tuple_fits -> bool with true
@@ -273,17 +273,17 @@
     }
 }
 
 pub(crate) fn usable_page_bytes(page_size: usize) -> usize {
     page_size.saturating_sub(PAGE_HEADER_BYTES)
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
-    aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {

---- tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity stdout ----

thread 'tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity' (13952477) panicked at hardening/careful/src/lib.rs:184:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
