*** hardening/careful/src/../../../src/storage/page.rs:285:5: replace aligned_tuple_bytes -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace aligned_tuple_bytes -> usize with 0
@@ -277,23 +277,17 @@
     page_size.saturating_sub(PAGE_HEADER_BYTES)
 }
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
     aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
-    let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
-    let remainder = tuple_len % ALIGNMENT_BYTES;
-    if remainder == 0 {
-        tuple_len
-    } else {
-        tuple_len + (ALIGNMENT_BYTES - remainder)
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn raw_tuple_storage_bytes(payload_len: usize) -> usize {
     aligned_tuple_bytes(payload_len)
 }
 
 #[cfg(test)]
 mod tests {

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples' (13954743) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1919:9:
assertion failed: chain.pages().len() > 1

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples' (13954740) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1853:9:
assertion failed: chain.pages().len() > 1

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples' (13954744) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1900:9:
assertion failed: chain.pages().len() > 1

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_chain_rejects_tuple_larger_than_page_payload_capacity
    tests::data_page_rejects_tuple_that_does_not_fit
    tests::page_alignment_helpers_preserve_exact_and_round_up_cases
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 195 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
