*** hardening/careful/src/../../../src/storage/page.rs:287:18: replace == with != in aligned_tuple_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace == with != in aligned_tuple_bytes
@@ -279,17 +279,17 @@
 
 pub(crate) fn element_or_neighbor_tuple_fits(payload_len: usize, page_size: usize) -> bool {
     aligned_tuple_bytes(payload_len) <= usable_page_bytes(page_size)
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
-    if remainder == 0 {
+    if remainder != /* ~ changed by cargo-mutants ~ */ 0 {
         tuple_len
     } else {
         tuple_len + (ALIGNMENT_BYTES - remainder)
     }
 }
 
 pub fn raw_tuple_storage_bytes(payload_len: usize) -> usize {
     aligned_tuple_bytes(payload_len)

---- tests::page_alignment_helpers_preserve_exact_and_round_up_cases stdout ----

thread 'tests::page_alignment_helpers_preserve_exact_and_round_up_cases' (13960427) panicked at hardening/careful/src/lib.rs:80:9:
assertion `left == right` failed
  left: 24
 right: 16

failures:
    tests::page_alignment_helpers_preserve_exact_and_round_up_cases

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.63s

*** result: Failure(101)
