*** hardening/careful/src/../../../src/storage/page.rs:290:38: replace - with / in aligned_tuple_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace - with / in aligned_tuple_bytes
@@ -282,17 +282,17 @@
 }
 
 pub(crate) fn aligned_tuple_bytes(payload_len: usize) -> usize {
     let tuple_len = TUPLE_HEADER_BYTES + payload_len + LINE_POINTER_BYTES;
     let remainder = tuple_len % ALIGNMENT_BYTES;
     if remainder == 0 {
         tuple_len
     } else {
-        tuple_len + (ALIGNMENT_BYTES - remainder)
+        tuple_len + (ALIGNMENT_BYTES / /* ~ changed by cargo-mutants ~ */ remainder)
     }
 }
 
 pub fn raw_tuple_storage_bytes(payload_len: usize) -> usize {
     aligned_tuple_bytes(payload_len)
 }
 
 #[cfg(test)]

---- tests::page_alignment_helpers_preserve_exact_and_round_up_cases stdout ----

thread 'tests::page_alignment_helpers_preserve_exact_and_round_up_cases' (13963206) panicked at hardening/careful/src/lib.rs:81:9:
assertion `left == right` failed
  left: 25
 right: 24

failures:
    tests::page_alignment_helpers_preserve_exact_and_round_up_cases

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.62s

*** result: Failure(101)
