*** hardening/careful/src/../../../src/storage/page.rs:295:5: replace raw_tuple_storage_bytes -> usize with 1

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace raw_tuple_storage_bytes -> usize with 1
@@ -287,17 +287,17 @@
     if remainder == 0 {
         tuple_len
     } else {
         tuple_len + (ALIGNMENT_BYTES - remainder)
     }
 }
 
 pub fn raw_tuple_storage_bytes(payload_len: usize) -> usize {
-    aligned_tuple_bytes(payload_len)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn miri_item_pointer_roundtrip() {

---- tests::data_page_reports_layout_and_free_space stdout ----

thread 'tests::data_page_reports_layout_and_free_space' (13964123) panicked at hardening/careful/src/lib.rs:96:9:
assertion `left == right` failed
  left: 48
 right: 71

failures:
    tests::data_page_reports_layout_and_free_space

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
