*** hardening/careful/src/../../../src/storage/page.rs:44:9: replace ItemPointer::encode_into with ()

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace ItemPointer::encode_into with ()
@@ -36,18 +36,17 @@
 
 impl ItemPointer {
     pub const INVALID: Self = Self {
         block_number: u32::MAX,
         offset_number: u16::MAX,
     };
 
     pub fn encode_into(self, out: &mut Vec<u8>) {
-        out.extend_from_slice(&self.block_number.to_le_bytes());
-        out.extend_from_slice(&self.offset_number.to_le_bytes());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn decode(input: &[u8]) -> Result<Self, String> {
         if input.len() != ITEM_POINTER_BYTES {
             return Err(format!(
                 "item pointer length mismatch: got {}, expected {ITEM_POINTER_BYTES}",
                 input.len()
             ));

---- careful_diskann_page::tests::la_001_fresh_metadata_roundtrip stdout ----

thread 'careful_diskann_page::tests::la_001_fresh_metadata_roundtrip' (13912963) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:120:9:
assertion `left == right` failed
  left: 36
 right: 48

---- careful_diskann_page::tests::la_003_encoded_length_matches_constant stdout ----

thread 'careful_diskann_page::tests::la_003_encoded_length_matches_constant' (13912965) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:120:9:
assertion `left == right` failed
  left: 36
 right: 48

---- careful_diskann_page::tests::la_005_alpha_f32_bit_exact stdout ----

thread 'careful_diskann_page::tests::la_005_alpha_f32_bit_exact' (13912967) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:120:9:
assertion `left == right` failed
  left: 36
 right: 48

failures:
    careful_diskann_page::tests::la_001_fresh_metadata_roundtrip
    careful_diskann_page::tests::la_003_encoded_length_matches_constant
    careful_diskann_page::tests::la_004_foreign_format_tag_rejected
    careful_diskann_page::tests::la_005_alpha_f32_bit_exact
    careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips
    careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head
    careful_diskann_tuple::tests::la_010_empty_node_roundtrip
    careful_diskann_tuple::tests::la_012_encoded_len_matches_computation
    careful_diskann_tuple::tests::la_013_foreign_tag_rejected
    careful_diskann_tuple::tests::la_016_empty_slots_are_invalid_pointer
    careful_diskann_tuple::tests::la_017_deleted_flag_roundtrips
    careful_diskann_tuple::tests::la_018_overflow_heaptids_flag_independent

test result: FAILED. 160 passed; 46 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.74s

*** result: Failure(101)
