*** hardening/careful/src/../../../src/storage/page.rs:82:9: replace DataPage::block_number -> u32 with 0

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::block_number -> u32 with 0
@@ -74,17 +74,17 @@
             block_number,
             page_size,
             used_bytes: PAGE_HEADER_BYTES,
             tuples: Vec::new(),
         }
     }
 
     pub fn block_number(&self) -> u32 {
-        self.block_number
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn tuple_count(&self) -> usize {
         self.tuples.len()
     }
 
     pub fn tuples(&self) -> &[Vec<u8>] {
         &self.tuples

---- tests::data_page_reports_layout_and_free_space stdout ----

thread 'tests::data_page_reports_layout_and_free_space' (13914683) panicked at hardening/careful/src/lib.rs:88:9:
assertion `left == right` failed
  left: 0
 right: 9

failures:
    tests::data_page_reports_layout_and_free_space

test result: FAILED. 205 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.70s

*** result: Failure(101)
