*** hardening/careful/src/../../../src/storage/page.rs:98:9: replace DataPage::can_fit_raw_tuple -> bool with true

*** mutation diff:
--- hardening/careful/src/../../../src/storage/page.rs
+++ replace DataPage::can_fit_raw_tuple -> bool with true
@@ -90,17 +90,17 @@
         &self.tuples
     }
 
     pub fn free_bytes(&self) -> usize {
         self.page_size.saturating_sub(self.used_bytes)
     }
 
     pub fn can_fit_raw_tuple(&self, payload_len: usize) -> bool {
-        aligned_tuple_bytes(payload_len) <= self.free_bytes()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn insert_raw_tuple(&mut self, payload: Vec<u8>) -> Result<ItemPointer, String> {
         if !self.can_fit_raw_tuple(payload.len()) {
             return Err(format!(
                 "tuple payload {} does not fit on block {} with {} bytes free",
                 payload.len(),
                 self.block_number,

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples' (13921425) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1853:9:
assertion failed: chain.pages().len() > 1

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples' (13921427) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1877:9:
assertion failed: chain.pages().len() > 1

---- careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples stdout ----

thread 'careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples' (13921428) panicked at hardening/careful/src/../../../src/am/ec_hnsw/page.rs:1919:9:
assertion failed: chain.pages().len() > 1

failures:
    careful_hnsw_page::tests::page_chain_extends_for_multiple_element_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_codebook_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_grouped_hot_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_rerank_tuples
    careful_hnsw_page::tests::page_chain_extends_for_multiple_turbo_hot_tuples
    careful_storage_page::tests::data_page_chain_overflow_creates_new_block
    careful_storage_page::tests::miri_data_page_chain_preserves_tuple_lookup_across_pages
    tests::data_page_rejects_tuple_that_does_not_fit
    tests::page_chain_preserves_payloads_across_overflow

test result: FAILED. 197 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.69s

*** result: Failure(101)
