*** hardening/careful/src/../../../src/am/common/cost.rs:134:5: replace amgettreeheight_callback_value -> i32 with 1

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace amgettreeheight_callback_value -> i32 with 1
@@ -126,17 +126,17 @@
 
     #[cfg(not(feature = "pg18"))]
     {
         metadata_fallback_tree_height(max_level)
     }
 }
 
 pub(crate) fn amgettreeheight_callback_value(max_level: u8) -> i32 {
-    i32::from(max_level)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn amtranslatestrategy_callback(strategy: i32) -> PlannerCompareType {
     match strategy {
         1 => PlannerCompareType::Lt,
         _ => PlannerCompareType::Invalid,
     }
 }

---- careful_common_cost::tests::tree_height_callback_value_returns_metadata_max_level stdout ----

thread 'careful_common_cost::tests::tree_height_callback_value_returns_metadata_max_level' (13977710) panicked at hardening/careful/src/../../../src/am/common/cost.rs:562:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    careful_common_cost::tests::tree_height_callback_value_returns_metadata_max_level

test result: FAILED. 215 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.82s

*** result: Failure(101)
