*** hardening/careful/src/../../../src/am/common/cost.rs:139:9: delete match arm 1 in amtranslatestrategy_callback

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ delete match arm 1 in amtranslatestrategy_callback
@@ -131,17 +131,17 @@
 }
 
 pub(crate) fn amgettreeheight_callback_value(max_level: u8) -> i32 {
     i32::from(max_level)
 }
 
 pub(crate) fn amtranslatestrategy_callback(strategy: i32) -> PlannerCompareType {
     match strategy {
-        1 => PlannerCompareType::Lt,
+         /* ~ changed by cargo-mutants ~ */
         _ => PlannerCompareType::Invalid,
     }
 }
 
 pub(crate) fn amtranslatecmptype_callback(compare_type: PlannerCompareType) -> i32 {
     match compare_type {
         PlannerCompareType::Lt => 1,
         PlannerCompareType::Invalid

---- careful_common_cost::tests::strategy_translation_snapshot_matches_build_target stdout ----

thread 'careful_common_cost::tests::strategy_translation_snapshot_matches_build_target' (13979667) panicked at hardening/careful/src/../../../src/am/common/cost.rs:550:9:
assertion `left == right` failed
  left: StrategyTranslationSnapshot { ordering_strategy: 1, ordering_compare_type: Invalid, pg18_callback_ready: false }
 right: StrategyTranslationSnapshot { ordering_strategy: 1, ordering_compare_type: Lt, pg18_callback_ready: false }

---- careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt stdout ----

thread 'careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt' (13979665) panicked at hardening/careful/src/../../../src/am/common/cost.rs:569:9:
assertion `left == right` failed
  left: Invalid
 right: Lt

failures:
    careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt
    careful_common_cost::tests::strategy_translation_snapshot_matches_build_target

test result: FAILED. 214 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
