*** hardening/careful/src/../../../src/am/common/cost.rs:222:27: replace <= with > in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace <= with > in estimate_planner_cost
@@ -214,17 +214,17 @@
         })
     }
 }
 
 pub(crate) fn estimate_planner_cost(
     inputs: PlannerCostInputs,
     constants: PlannerCostConstants,
 ) -> PlannerCostEstimate {
-    if inputs.index_pages <= 0.0 {
+    if inputs.index_pages > /* ~ changed by cargo-mutants ~ */ 0.0 {
         return gated_planner_cost_estimate(inputs.index_pages);
     }
 
     let tuple_estimate = if inputs.reltuples > 0.0 {
         inputs.reltuples
     } else {
         inputs.index_pages * 10.0
     };

---- careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables' (13982487) panicked at hardening/careful/src/../../../src/am/common/cost.rs:418:9:
large-table planner scaffolding should model ec_hnsw as cheaper than seqscan once ADR-011 is retired

---- careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover stdout ----

thread 'careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover' (13982485) panicked at hardening/careful/src/../../../src/am/common/cost.rs:516:9:
real 10k / 1536-d / ef=200 startup cost must stay below the observed seqscan+sort crossover: PlannerCostEstimate { startup_cost: 1.7976931348623157e308, total_cost: 1.7976931348623157e308, selectivity: 0.0, correlation: 0.0, index_pages: 1251.0 }

---- careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing stdout ----

thread 'careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing' (13982489) panicked at hardening/careful/src/../../../src/am/common/cost.rs:492:9:
assertion `left == right` failed
  left: 1.7976931348623157e308
 right: 0.0

failures:
    careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover
    careful_common_cost::tests::planner_cost_model_returns_max_for_empty_index
    careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables
    careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing

test result: FAILED. 212 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
