*** hardening/careful/src/../../../src/am/common/cost.rs:226:46: replace > with >= in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace > with >= in estimate_planner_cost
@@ -218,17 +218,17 @@
 pub(crate) fn estimate_planner_cost(
     inputs: PlannerCostInputs,
     constants: PlannerCostConstants,
 ) -> PlannerCostEstimate {
     if inputs.index_pages <= 0.0 {
         return gated_planner_cost_estimate(inputs.index_pages);
     }
 
-    let tuple_estimate = if inputs.reltuples > 0.0 {
+    let tuple_estimate = if inputs.reltuples >= /* ~ changed by cargo-mutants ~ */ 0.0 {
         inputs.reltuples
     } else {
         inputs.index_pages * 10.0
     };
     let scoring_dimensions = f64::from(inputs.dimensions) * LUT_CPU_DIMENSION_SCALE;
     let ef_search = f64::from(inputs.ef_search);
     let tree_height = inputs.tree_height;

---- careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing stdout ----

thread 'careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing' (13984565) panicked at hardening/careful/src/../../../src/am/common/cost.rs:493:9:
assertion `left == right` failed
  left: 12.0
 right: 40.8

failures:
    careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing

test result: FAILED. 215 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
