*** hardening/careful/src/../../../src/am/common/cost.rs:231:59: replace * with + in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace * with + in estimate_planner_cost
@@ -223,17 +223,17 @@
         return gated_planner_cost_estimate(inputs.index_pages);
     }
 
     let tuple_estimate = if inputs.reltuples > 0.0 {
         inputs.reltuples
     } else {
         inputs.index_pages * 10.0
     };
-    let scoring_dimensions = f64::from(inputs.dimensions) * LUT_CPU_DIMENSION_SCALE;
+    let scoring_dimensions = f64::from(inputs.dimensions) + /* ~ changed by cargo-mutants ~ */ LUT_CPU_DIMENSION_SCALE;
     let ef_search = f64::from(inputs.ef_search);
     let tree_height = inputs.tree_height;
 
     let (startup_cost, total_cost) = if tree_height <= 0.0 {
         let linear_cost = inputs.index_pages * constants.seq_page_cost;
         let linear_cpu = tuple_estimate * constants.cpu_operator_cost * scoring_dimensions;
         (0.0, linear_cost + linear_cpu)
     } else {

---- careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing stdout ----

thread 'careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing' (13986643) panicked at hardening/careful/src/../../../src/am/common/cost.rs:493:9:
assertion `left == right` failed
  left: 50.625
 right: 40.8

---- careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover stdout ----

thread 'careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover' (13986639) panicked at hardening/careful/src/../../../src/am/common/cost.rs:516:9:
real 10k / 1536-d / ef=200 startup cost must stay below the observed seqscan+sort crossover: PlannerCostEstimate { startup_cost: 1599.7425, total_cost: 34800.56444244605, selectivity: 1.0, correlation: 0.0, index_pages: 1251.0 }

failures:
    careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover
    careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing

test result: FAILED. 214 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
