*** hardening/careful/src/../../../src/am/common/cost.rs:237:41: replace * with + in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace * with + in estimate_planner_cost
@@ -229,17 +229,17 @@
         inputs.index_pages * 10.0
     };
     let scoring_dimensions = f64::from(inputs.dimensions) * LUT_CPU_DIMENSION_SCALE;
     let ef_search = f64::from(inputs.ef_search);
     let tree_height = inputs.tree_height;
 
     let (startup_cost, total_cost) = if tree_height <= 0.0 {
         let linear_cost = inputs.index_pages * constants.seq_page_cost;
-        let linear_cpu = tuple_estimate * constants.cpu_operator_cost * scoring_dimensions;
+        let linear_cpu = tuple_estimate + /* ~ changed by cargo-mutants ~ */ constants.cpu_operator_cost * scoring_dimensions;
         (0.0, linear_cost + linear_cpu)
     } else {
         // Graph phase visits ~1 page per upper level (greedy descent to the
         // entry neighborhood) plus ef_search candidate pages at the bottom
         // layer. The earlier `tree_height * m + ef_search * 2 * m` formula
         // wildly overcharged by multiplying ef_search by m, which kept
         // ec_hnsw costlier than a seqscan on every realistic table size.
         let graph_pages = tree_height + ef_search;

---- careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing stdout ----

thread 'careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing' (13991466) panicked at hardening/careful/src/../../../src/am/common/cost.rs:493:9:
assertion `left == right` failed
  left: 132.24
 right: 40.8

failures:
    careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing

test result: FAILED. 215 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
