*** hardening/careful/src/../../../src/am/common/cost.rs:245:39: replace + with - in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace + with - in estimate_planner_cost
@@ -237,17 +237,17 @@
         let linear_cpu = tuple_estimate * constants.cpu_operator_cost * scoring_dimensions;
         (0.0, linear_cost + linear_cpu)
     } else {
         // Graph phase visits ~1 page per upper level (greedy descent to the
         // entry neighborhood) plus ef_search candidate pages at the bottom
         // layer. The earlier `tree_height * m + ef_search * 2 * m` formula
         // wildly overcharged by multiplying ef_search by m, which kept
         // ec_hnsw costlier than a seqscan on every realistic table size.
-        let graph_pages = tree_height + ef_search;
+        let graph_pages = tree_height - /* ~ changed by cargo-mutants ~ */ ef_search;
         let graph_cost = graph_pages * constants.random_page_cost;
         let graph_cpu = graph_pages * constants.cpu_operator_cost * scoring_dimensions;
         let linear_pages = (inputs.index_pages - graph_pages).max(0.0);
         let linear_cost = linear_pages * constants.seq_page_cost;
         // Scale per-tuple CPU work by the fraction of pages the graph phase
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole

*** result: Success
