*** hardening/careful/src/../../../src/am/common/cost.rs:256:26: replace / with * in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace / with * in estimate_planner_cost
@@ -248,17 +248,17 @@
         let linear_pages = (inputs.index_pages - graph_pages).max(0.0);
         let linear_cost = linear_pages * constants.seq_page_cost;
         // Scale per-tuple CPU work by the fraction of pages the graph phase
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
         let linear_fraction = if inputs.index_pages > 0.0 {
-            linear_pages / inputs.index_pages
+            linear_pages * /* ~ changed by cargo-mutants ~ */ inputs.index_pages
         } else {
             0.0
         };
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
         let startup_cost = graph_cost + graph_cpu;
         (startup_cost, startup_cost + linear_cost + linear_cpu)
     };

---- careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables' (14005821) panicked at hardening/careful/src/../../../src/am/common/cost.rs:418:9:
large-table planner scaffolding should model ec_hnsw as cheaper than seqscan once ADR-011 is retired

failures:
    careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables

test result: FAILED. 215 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
