*** hardening/careful/src/../../../src/am/common/cost.rs:261:28: replace * with + in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace * with + in estimate_planner_cost
@@ -253,17 +253,17 @@
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
         let linear_fraction = if inputs.index_pages > 0.0 {
             linear_pages / inputs.index_pages
         } else {
             0.0
         };
         let linear_cpu =
-            tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
+            tuple_estimate + /* ~ changed by cargo-mutants ~ */ constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
         let startup_cost = graph_cost + graph_cpu;
         (startup_cost, startup_cost + linear_cost + linear_cpu)
     };
 
     PlannerCostEstimate {
         startup_cost,
         total_cost,
         selectivity: 1.0,

*** result: Success
