*** hardening/careful/src/../../../src/am/common/cost.rs:262:39: replace + with * in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace + with * in estimate_planner_cost
@@ -254,17 +254,17 @@
         // index (linear_pages == 0).
         let linear_fraction = if inputs.index_pages > 0.0 {
             linear_pages / inputs.index_pages
         } else {
             0.0
         };
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
-        let startup_cost = graph_cost + graph_cpu;
+        let startup_cost = graph_cost * /* ~ changed by cargo-mutants ~ */ graph_cpu;
         (startup_cost, startup_cost + linear_cost + linear_cpu)
     };
 
     PlannerCostEstimate {
         startup_cost,
         total_cost,
         selectivity: 1.0,
         correlation: 0.0,

---- careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover stdout ----

thread 'careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover' (14011390) panicked at hardening/careful/src/../../../src/am/common/cost.rs:516:9:
real 10k / 1536-d / ef=200 startup cost must stay below the observed seqscan+sort crossover: PlannerCostEstimate { startup_cost: 479416.32, total_cost: 504566.91712230217, selectivity: 1.0, correlation: 0.0, index_pages: 1251.0 }

---- careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables' (14011392) panicked at hardening/careful/src/../../../src/am/common/cost.rs:418:9:
large-table planner scaffolding should model ec_hnsw as cheaper than seqscan once ADR-011 is retired

failures:
    careful_common_cost::tests::planner_cost_model_keeps_real_10k_ef200_probe_below_seqscan_sort_crossover
    careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables

test result: FAILED. 214 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
