*** hardening/careful/src/../../../src/am/common/cost.rs:263:51: replace + with * in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace + with * in estimate_planner_cost
@@ -255,17 +255,17 @@
         let linear_fraction = if inputs.index_pages > 0.0 {
             linear_pages / inputs.index_pages
         } else {
             0.0
         };
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
         let startup_cost = graph_cost + graph_cpu;
-        (startup_cost, startup_cost + linear_cost + linear_cpu)
+        (startup_cost, startup_cost + linear_cost * /* ~ changed by cargo-mutants ~ */ linear_cpu)
     };
 
     PlannerCostEstimate {
         startup_cost,
         total_cost,
         selectivity: 1.0,
         correlation: 0.0,
         index_pages: inputs.index_pages,

---- careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables' (14012778) panicked at hardening/careful/src/../../../src/am/common/cost.rs:418:9:
large-table planner scaffolding should model ec_hnsw as cheaper than seqscan once ADR-011 is retired

failures:
    careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables

test result: FAILED. 215 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.63s

*** result: Failure(101)
