*** hardening/careful/src/../../../src/am/common/cost.rs:145:5: replace amtranslatecmptype_callback -> i32 with -1

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace amtranslatecmptype_callback -> i32 with -1
@@ -137,27 +137,17 @@
 pub(crate) fn amtranslatestrategy_callback(strategy: i32) -> PlannerCompareType {
     match strategy {
         1 => PlannerCompareType::Lt,
         _ => PlannerCompareType::Invalid,
     }
 }
 
 pub(crate) fn amtranslatecmptype_callback(compare_type: PlannerCompareType) -> i32 {
-    match compare_type {
-        PlannerCompareType::Lt => 1,
-        PlannerCompareType::Invalid
-        | PlannerCompareType::Le
-        | PlannerCompareType::Eq
-        | PlannerCompareType::Ge
-        | PlannerCompareType::Gt
-        | PlannerCompareType::Ne
-        | PlannerCompareType::Overlap
-        | PlannerCompareType::ContainedBy => 0,
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn strategy_translation_snapshot() -> StrategyTranslationSnapshot {
     StrategyTranslationSnapshot {
         ordering_strategy: 1,
         ordering_compare_type: amtranslatestrategy_callback(1),
         pg18_callback_ready: cfg!(feature = "pg18"),
     }

---- careful_common_cost::tests::strategy_translation_rejects_invalid_inputs stdout ----

thread 'careful_common_cost::tests::strategy_translation_rejects_invalid_inputs' (14023601) panicked at hardening/careful/src/../../../src/am/common/cost.rs:643:9:
assertion `left == right` failed
  left: -1
 right: 0

---- careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt stdout ----

thread 'careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt' (14023600) panicked at hardening/careful/src/../../../src/am/common/cost.rs:632:9:
assertion `left == right` failed
  left: -1
 right: 1

failures:
    careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt
    careful_common_cost::tests::strategy_translation_rejects_invalid_inputs

test result: FAILED. 217 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
