*** hardening/careful/src/../../../src/am/common/cost.rs:229:28: replace * with + in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace * with + in estimate_planner_cost
@@ -221,17 +221,17 @@
 ) -> PlannerCostEstimate {
     if inputs.index_pages <= 0.0 {
         return gated_planner_cost_estimate(inputs.index_pages);
     }
 
     let tuple_estimate = if inputs.reltuples > 0.0 {
         inputs.reltuples
     } else {
-        inputs.index_pages * 10.0
+        inputs.index_pages + /* ~ changed by cargo-mutants ~ */ 10.0
     };
     let scoring_dimensions = f64::from(inputs.dimensions) * LUT_CPU_DIMENSION_SCALE;
     let ef_search = f64::from(inputs.ef_search);
     let tree_height = inputs.tree_height;
 
     let (startup_cost, total_cost) = if tree_height <= 0.0 {
         let linear_cost = inputs.index_pages * constants.seq_page_cost;
         let linear_cpu = tuple_estimate * constants.cpu_operator_cost * scoring_dimensions;

---- careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing stdout ----

thread 'careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing' (14027102) panicked at hardening/careful/src/../../../src/am/common/cost.rs:496:9:
assertion `left == right` failed
  left: 17.28
 right: 40.8

failures:
    careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing

test result: FAILED. 218 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.65s

*** result: Failure(101)
