*** hardening/careful/src/../../../src/am/common/cost.rs:235:53: replace <= with > in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace <= with > in estimate_planner_cost
@@ -227,17 +227,17 @@
         inputs.reltuples
     } else {
         inputs.index_pages * 10.0
     };
     let scoring_dimensions = f64::from(inputs.dimensions) * LUT_CPU_DIMENSION_SCALE;
     let ef_search = f64::from(inputs.ef_search);
     let tree_height = inputs.tree_height;
 
-    let (startup_cost, total_cost) = if tree_height <= 0.0 {
+    let (startup_cost, total_cost) = if tree_height > /* ~ changed by cargo-mutants ~ */ 0.0 {
         let linear_cost = inputs.index_pages * constants.seq_page_cost;
         let linear_cpu = tuple_estimate * constants.cpu_operator_cost * scoring_dimensions;
         (0.0, linear_cost + linear_cpu)
     } else {
         // Graph phase visits ~1 page per upper level (greedy descent to the
         // entry neighborhood) plus ef_search candidate pages at the bottom
         // layer. The earlier `tree_height * m + ef_search * 2 * m` formula
         // wildly overcharged by multiplying ef_search by m, which kept

---- careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing stdout ----

thread 'careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing' (14029887) panicked at hardening/careful/src/../../../src/am/common/cost.rs:495:9:
assertion `left == right` failed
  left: 169.6
 right: 0.0

---- careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index stdout ----

thread 'careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index' (14029882) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 70, got 0

---- careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables' (14029886) panicked at hardening/careful/src/../../../src/am/common/cost.rs:443:9:
small-table planner scaffolding should still model seqscan as cheaper

failures:
    careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components
    careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index
    careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables
    careful_common_cost::tests::planner_cost_model_uses_reltuples_heuristic_when_stats_are_missing
    careful_common_cost::tests::planner_cost_model_uses_reltuples_when_stats_are_available

test result: FAILED. 214 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.66s

*** result: Failure(101)
