*** hardening/careful/src/../../../src/am/common/cost.rs:247:67: replace * with / in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace * with / in estimate_planner_cost
@@ -239,17 +239,17 @@
     } else {
         // Graph phase visits ~1 page per upper level (greedy descent to the
         // entry neighborhood) plus ef_search candidate pages at the bottom
         // layer. The earlier `tree_height * m + ef_search * 2 * m` formula
         // wildly overcharged by multiplying ef_search by m, which kept
         // ec_hnsw costlier than a seqscan on every realistic table size.
         let graph_pages = tree_height + ef_search;
         let graph_cost = graph_pages * constants.random_page_cost;
-        let graph_cpu = graph_pages * constants.cpu_operator_cost * scoring_dimensions;
+        let graph_cpu = graph_pages * constants.cpu_operator_cost / /* ~ changed by cargo-mutants ~ */ scoring_dimensions;
         let linear_pages = (inputs.index_pages - graph_pages).max(0.0);
         let linear_cost = linear_pages * constants.seq_page_cost;
         // Scale per-tuple CPU work by the fraction of pages the graph phase
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
         let linear_fraction = linear_pages / inputs.index_pages;

---- careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index stdout ----

thread 'careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index' (14039826) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 70, got 40.833333333333336

---- careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables' (14039830) panicked at hardening/careful/src/../../../src/am/common/cost.rs:443:9:
small-table planner scaffolding should still model seqscan as cheaper

---- careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components stdout ----

thread 'careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components' (14039825) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 70, got 40.833333333333336

failures:
    careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components
    careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index
    careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables

test result: FAILED. 216 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.67s

*** result: Failure(101)
