*** hardening/careful/src/../../../src/am/common/cost.rs:249:40: replace * with / in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace * with / in estimate_planner_cost
@@ -241,17 +241,17 @@
         // entry neighborhood) plus ef_search candidate pages at the bottom
         // layer. The earlier `tree_height * m + ef_search * 2 * m` formula
         // wildly overcharged by multiplying ef_search by m, which kept
         // ec_hnsw costlier than a seqscan on every realistic table size.
         let graph_pages = tree_height + ef_search;
         let graph_cost = graph_pages * constants.random_page_cost;
         let graph_cpu = graph_pages * constants.cpu_operator_cost * scoring_dimensions;
         let linear_pages = (inputs.index_pages - graph_pages).max(0.0);
-        let linear_cost = linear_pages * constants.seq_page_cost;
+        let linear_cost = linear_pages / /* ~ changed by cargo-mutants ~ */ constants.seq_page_cost;
         // Scale per-tuple CPU work by the fraction of pages the graph phase
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
         let linear_fraction = linear_pages / inputs.index_pages;
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;

---- careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components stdout ----

thread 'careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components' (14044006) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 790, got 655

failures:
    careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components

test result: FAILED. 218 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.69s

*** result: Failure(101)
