*** hardening/careful/src/../../../src/am/common/cost.rs:255:44: replace / with * in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace / with * in estimate_planner_cost
@@ -247,17 +247,17 @@
         let graph_cpu = graph_pages * constants.cpu_operator_cost * scoring_dimensions;
         let linear_pages = (inputs.index_pages - graph_pages).max(0.0);
         let linear_cost = linear_pages * constants.seq_page_cost;
         // Scale per-tuple CPU work by the fraction of pages the graph phase
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
-        let linear_fraction = linear_pages / inputs.index_pages;
+        let linear_fraction = linear_pages * /* ~ changed by cargo-mutants ~ */ inputs.index_pages;
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
         let startup_cost = graph_cost + graph_cpu;
         (startup_cost, startup_cost + linear_cost + linear_cpu)
     };
 
     PlannerCostEstimate {
         startup_cost,

---- careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables' (14045394) panicked at hardening/careful/src/../../../src/am/common/cost.rs:421:9:
large-table planner scaffolding should model ec_hnsw as cheaper than seqscan once ADR-011 is retired

---- careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components stdout ----

thread 'careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components' (14045390) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 790, got 5400250

failures:
    careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components
    careful_common_cost::tests::planner_cost_model_stays_cheaper_than_seqscan_for_large_tables

test result: FAILED. 217 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.71s

*** result: Failure(101)
