*** hardening/careful/src/../../../src/am/common/cost.rs:258:39: replace + with - in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace + with - in estimate_planner_cost
@@ -250,17 +250,17 @@
         // Scale per-tuple CPU work by the fraction of pages the graph phase
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
         let linear_fraction = linear_pages / inputs.index_pages;
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
-        let startup_cost = graph_cost + graph_cpu;
+        let startup_cost = graph_cost - /* ~ changed by cargo-mutants ~ */ graph_cpu;
         (startup_cost, startup_cost + linear_cost + linear_cpu)
     };
 
     PlannerCostEstimate {
         startup_cost,
         total_cost,
         selectivity: 1.0,
         correlation: 0.0,

---- careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components stdout ----

thread 'careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components' (14050252) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 70, got 10

---- careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index stdout ----

thread 'careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index' (14050253) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 70, got 10

---- careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables stdout ----

thread 'careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables' (14050257) panicked at hardening/careful/src/../../../src/am/common/cost.rs:443:9:
small-table planner scaffolding should still model seqscan as cheaper

failures:
    careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components
    careful_common_cost::tests::planner_cost_model_does_not_charge_linear_tail_when_graph_covers_index
    careful_common_cost::tests::planner_cost_model_stays_more_expensive_than_seqscan_for_small_tables

test result: FAILED. 216 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.67s

*** result: Failure(101)
