*** hardening/careful/src/../../../src/am/common/cost.rs:259:37: replace + with - in estimate_planner_cost

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace + with - in estimate_planner_cost
@@ -251,17 +251,17 @@
         // did NOT cover. Charging the full tuple_estimate sweep here would
         // double-count the graph traversal and make ec_hnsw always look
         // costlier than a seqscan, even when the graph covers the whole
         // index (linear_pages == 0).
         let linear_fraction = linear_pages / inputs.index_pages;
         let linear_cpu =
             tuple_estimate * constants.cpu_operator_cost * scoring_dimensions * linear_fraction;
         let startup_cost = graph_cost + graph_cpu;
-        (startup_cost, startup_cost + linear_cost + linear_cpu)
+        (startup_cost, startup_cost - /* ~ changed by cargo-mutants ~ */ linear_cost + linear_cpu)
     };
 
     PlannerCostEstimate {
         startup_cost,
         total_cost,
         selectivity: 1.0,
         correlation: 0.0,
         index_pages: inputs.index_pages,

---- careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components stdout ----

thread 'careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components' (14053030) panicked at hardening/careful/src/../../../src/am/common/cost.rs:399:9:
expected 790, got 430

failures:
    careful_common_cost::tests::planner_cost_model_accounts_for_graph_and_linear_components

test result: FAILED. 218 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.68s

*** result: Failure(101)
