*** hardening/careful/src/../../../src/am/common/cost.rs:68:9: replace PlannerCompareType::as_str -> &'static str with ""

*** mutation diff:
--- hardening/careful/src/../../../src/am/common/cost.rs
+++ replace PlannerCompareType::as_str -> &'static str with ""
@@ -60,27 +60,17 @@
     Gt,
     Ne,
     Overlap,
     ContainedBy,
 }
 
 impl PlannerCompareType {
     pub(crate) fn as_str(self) -> &'static str {
-        match self {
-            Self::Invalid => "COMPARE_INVALID",
-            Self::Lt => "COMPARE_LT",
-            Self::Le => "COMPARE_LE",
-            Self::Eq => "COMPARE_EQ",
-            Self::Ge => "COMPARE_GE",
-            Self::Gt => "COMPARE_GT",
-            Self::Ne => "COMPARE_NE",
-            Self::Overlap => "COMPARE_OVERLAP",
-            Self::ContainedBy => "COMPARE_CONTAINED_BY",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub(crate) struct StrategyTranslationSnapshot {
     pub ordering_strategy: i32,
     pub ordering_compare_type: PlannerCompareType,
     pub pg18_callback_ready: bool,

---- careful_common_cost::tests::strategy_translation_rejects_invalid_inputs stdout ----

thread 'careful_common_cost::tests::strategy_translation_rejects_invalid_inputs' (14017200) panicked at hardening/careful/src/../../../src/am/common/cost.rs:654:9:
assertion `left == right` failed
  left: ""
 right: "COMPARE_INVALID"

---- careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt stdout ----

thread 'careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt' (14017199) panicked at hardening/careful/src/../../../src/am/common/cost.rs:633:9:
assertion `left == right` failed
  left: ""
 right: "COMPARE_LT"

failures:
    careful_common_cost::tests::strategy_translation_maps_ordering_strategy_to_compare_lt
    careful_common_cost::tests::strategy_translation_rejects_invalid_inputs

test result: FAILED. 217 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.61s

*** result: Failure(101)
