*** hardening/careful/src/../../../src/am/ec_diskann/page.rs:104:9: replace VamanaMetadataPage::encode -> Vec<u8> with vec![]

*** mutation diff:
--- hardening/careful/src/../../../src/am/ec_diskann/page.rs
+++ replace VamanaMetadataPage::encode -> Vec<u8> with vec![]
@@ -96,34 +96,17 @@
             payload_flags: PAYLOAD_FLAG_GROUPED_SEARCH_CODE,
             search_subvector_count: 0,
             search_subvector_dim: 0,
             grouped_codebook_head: ItemPointer::INVALID,
         }
     }
 
     pub fn encode(&self) -> Vec<u8> {
-        let mut out = Vec::with_capacity(VAMANA_METADATA_BYTES);
-        out.extend_from_slice(&self.format_version.to_le_bytes());
-        self.entry_point.encode_into(&mut out);
-        out.extend_from_slice(&self.graph_degree_r.to_le_bytes());
-        out.extend_from_slice(&self.build_list_size_l.to_le_bytes());
-        out.extend_from_slice(&self.alpha.to_le_bytes());
-        out.extend_from_slice(&self.dimensions.to_le_bytes());
-        out.extend_from_slice(&self.seed.to_le_bytes());
-        out.extend_from_slice(&self.inserted_since_rebuild.to_le_bytes());
-        out.push(self.needs_medoid_refresh as u8);
-        out.push(self.transform_kind);
-        out.push(self.search_codec_kind);
-        out.push(self.payload_flags);
-        out.extend_from_slice(&self.search_subvector_count.to_le_bytes());
-        out.extend_from_slice(&self.search_subvector_dim.to_le_bytes());
-        self.grouped_codebook_head.encode_into(&mut out);
-        debug_assert_eq!(out.len(), VAMANA_METADATA_BYTES);
-        out
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn decode(input: &[u8]) -> Result<Self, String> {
         if input.len() != VAMANA_METADATA_BYTES {
             return Err(format!(
                 "vamana metadata length mismatch: got {}, expected {VAMANA_METADATA_BYTES}",
                 input.len()
             ));

---- careful_diskann_page::tests::la_003_encoded_length_matches_constant stdout ----

thread 'careful_diskann_page::tests::la_003_encoded_length_matches_constant' (14097164) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:205:9:
assertion `left == right` failed
  left: 0
 right: 48

---- careful_diskann_page::tests::la_004_foreign_format_tag_rejected stdout ----

thread 'careful_diskann_page::tests::la_004_foreign_format_tag_rejected' (14097165) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:215:9:
unexpected error: vamana metadata length mismatch: got 0, expected 48

---- careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips stdout ----

thread 'careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips' (14097168) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:255:60:
decode: "vamana metadata length mismatch: got 0, expected 48"

failures:
    careful_diskann_page::tests::la_001_fresh_metadata_roundtrip
    careful_diskann_page::tests::la_003_encoded_length_matches_constant
    careful_diskann_page::tests::la_004_foreign_format_tag_rejected
    careful_diskann_page::tests::la_005_alpha_f32_bit_exact
    careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips
    careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head

test result: FAILED. 213 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
