*** hardening/careful/src/../../../src/am/ec_diskann/page.rs:134:27: replace != with == in VamanaMetadataPage::decode

*** mutation diff:
--- hardening/careful/src/../../../src/am/ec_diskann/page.rs
+++ replace != with == in VamanaMetadataPage::decode
@@ -126,17 +126,17 @@
             return Err(format!(
                 "vamana metadata length mismatch: got {}, expected {VAMANA_METADATA_BYTES}",
                 input.len()
             ));
         }
 
         let format_version =
             u16::from_le_bytes(input[0..2].try_into().expect("format version bytes"));
-        if format_version != INDEX_FORMAT_V3_DISKANN {
+        if format_version == /* ~ changed by cargo-mutants ~ */ INDEX_FORMAT_V3_DISKANN {
             return Err(format!(
                 "invalid vamana metadata format version: got {format_version}, expected {INDEX_FORMAT_V3_DISKANN}"
             ));
         }
 
         Ok(Self {
             format_version,
             entry_point: ItemPointer::decode(&input[2..8])?,

---- careful_diskann_page::tests::la_005_alpha_f32_bit_exact stdout ----

thread 'careful_diskann_page::tests::la_005_alpha_f32_bit_exact' (14100273) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:243:60:
decode: "invalid vamana metadata format version: got 3, expected 3"

---- careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head stdout ----

thread 'careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head' (14100276) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:204:60:
decode: "invalid vamana metadata format version: got 3, expected 3"

---- careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips stdout ----

thread 'careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips' (14100275) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:272:60:
decode: "invalid vamana metadata format version: got 3, expected 3"

failures:
    careful_diskann_page::tests::la_001_fresh_metadata_roundtrip
    careful_diskann_page::tests::la_004_foreign_format_tag_rejected
    careful_diskann_page::tests::la_005_alpha_f32_bit_exact
    careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips
    careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head

test result: FAILED. 214 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.60s

*** result: Failure(101)
