*** hardening/careful/src/../../../src/am/ec_diskann/page.rs:157:45: replace != with == in VamanaMetadataPage::decode

*** mutation diff:
--- hardening/careful/src/../../../src/am/ec_diskann/page.rs
+++ replace != with == in VamanaMetadataPage::decode
@@ -149,17 +149,17 @@
             alpha: f32::from_le_bytes(input[12..16].try_into().expect("alpha bytes")),
             dimensions: u16::from_le_bytes(input[16..18].try_into().expect("dimensions bytes")),
             seed: u64::from_le_bytes(input[18..26].try_into().expect("seed bytes")),
             inserted_since_rebuild: u64::from_le_bytes(
                 input[26..34]
                     .try_into()
                     .expect("inserted-since-rebuild bytes"),
             ),
-            needs_medoid_refresh: input[34] != 0,
+            needs_medoid_refresh: input[34] == /* ~ changed by cargo-mutants ~ */ 0,
             transform_kind: input[35],
             search_codec_kind: input[36],
             payload_flags: input[37],
             search_subvector_count: u16::from_le_bytes(
                 input[38..40]
                     .try_into()
                     .expect("search_subvector_count bytes"),
             ),

---- careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips stdout ----

thread 'careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips' (14100966) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:273:9:
assertion failed: decoded.needs_medoid_refresh

---- careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head stdout ----

thread 'careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head' (14100967) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:206:9:
assertion `left == right` failed

---- careful_diskann_page::tests::la_001_fresh_metadata_roundtrip stdout ----

thread 'careful_diskann_page::tests::la_001_fresh_metadata_roundtrip' (14100960) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:186:9:
assertion `left == right` failed

failures:
    careful_diskann_page::tests::la_001_fresh_metadata_roundtrip
    careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips
    careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head

test result: FAILED. 216 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.60s

*** result: Failure(101)
