*** hardening/careful/src/../../../src/am/ec_diskann/page.rs:125:24: replace != with == in VamanaMetadataPage::decode

*** mutation diff:
--- hardening/careful/src/../../../src/am/ec_diskann/page.rs
+++ replace != with == in VamanaMetadataPage::decode
@@ -117,17 +117,17 @@
         out.extend_from_slice(&self.search_subvector_count.to_le_bytes());
         out.extend_from_slice(&self.search_subvector_dim.to_le_bytes());
         self.grouped_codebook_head.encode_into(&mut out);
         debug_assert_eq!(out.len(), VAMANA_METADATA_BYTES);
         out
     }
 
     pub fn decode(input: &[u8]) -> Result<Self, String> {
-        if input.len() != VAMANA_METADATA_BYTES {
+        if input.len() == /* ~ changed by cargo-mutants ~ */ VAMANA_METADATA_BYTES {
             return Err(format!(
                 "vamana metadata length mismatch: got {}, expected {VAMANA_METADATA_BYTES}",
                 input.len()
             ));
         }
 
         let format_version =
             u16::from_le_bytes(input[0..2].try_into().expect("format version bytes"));

---- careful_diskann_page::tests::la_001_fresh_metadata_roundtrip stdout ----

thread 'careful_diskann_page::tests::la_001_fresh_metadata_roundtrip' (14109115) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:185:60:
decode: "vamana metadata length mismatch: got 48, expected 48"

---- careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips stdout ----

thread 'careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips' (14109121) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:275:60:
decode: "vamana metadata length mismatch: got 48, expected 48"

---- careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head stdout ----

thread 'careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head' (14109122) panicked at hardening/careful/src/../../../src/am/ec_diskann/page.rs:204:60:
decode: "vamana metadata length mismatch: got 48, expected 48"

failures:
    careful_diskann_page::tests::la_001_fresh_metadata_roundtrip
    careful_diskann_page::tests::la_004_foreign_format_tag_rejected
    careful_diskann_page::tests::la_005_alpha_f32_bit_exact
    careful_diskann_page::tests::la_006_needs_medoid_refresh_flag_roundtrips
    careful_diskann_page::tests::miri_vamana_metadata_roundtrip_with_codebook_head

test result: FAILED. 214 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.62s

*** result: Failure(101)
