*** hardening/careful/src/../../../src/quant/rabitq.rs:1000:17: delete - in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete - in quantize_level
@@ -992,17 +992,17 @@
 /// bin uniformly into `2^bits` cells. The level stored is the
 /// unsigned bin index `0..2^bits - 1`; the dequantized value is
 /// the bin center mapped back to the unit-vector scale.
 fn quantize_level(o_hat_i: f32, bits: usize, sqrt_d: f32) -> (u32, f32) {
     if bits == 1 {
         if o_hat_i >= 0.0 {
             (1, 1.0)
         } else {
-            (0, -1.0)
+            (0,  /* ~ changed by cargo-mutants ~ */1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let scaled = o_hat_i * sqrt_d;
         let t = ((scaled + c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
         let level = ((t * levels as f32) as u32).min(levels - 1);
         // Bin center, mapped back to unit-vector scale.

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17578536) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=97.5238 truth=32 err=65.5238

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17578541) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1433:9:
assertion `left == right` failed
  left: (0, 1.0)
 right: (0, -1.0)

failures:
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.01s

*** result: Failure(101)
