*** hardening/careful/src/../../../src/quant/rabitq.rs:1005:30: replace * with / in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in quantize_level
@@ -997,17 +997,17 @@
         if o_hat_i >= 0.0 {
             (1, 1.0)
         } else {
             (0, -1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
-        let scaled = o_hat_i * sqrt_d;
+        let scaled = o_hat_i / /* ~ changed by cargo-mutants ~ */ sqrt_d;
         let t = ((scaled + c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
         let level = ((t * levels as f32) as u32).min(levels - 1);
         // Bin center, mapped back to unit-vector scale.
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
         let dequant = center_scaled / sqrt_d;
         (level, dequant)
     }
 }

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17581847) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1273:9:
assertion `left == right` failed
  left: [169, 1]
 right: [233, 0]

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17581859) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1583:9:
q=4 should reduce error vs q=1, got err_bin=52.911736 err_q4=52.911736

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17581860) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1424:17:
assertion `left == right` failed: bits=2 level=0
  left: 1
 right: 0

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.21s

*** result: Failure(101)
