*** hardening/careful/src/../../../src/quant/rabitq.rs:1006:26: replace + with - in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with - in quantize_level
@@ -998,17 +998,17 @@
             (1, 1.0)
         } else {
             (0, -1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let scaled = o_hat_i * sqrt_d;
-        let t = ((scaled + c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
+        let t = ((scaled - /* ~ changed by cargo-mutants ~ */ c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
         let level = ((t * levels as f32) as u32).min(levels - 1);
         // Bin center, mapped back to unit-vector scale.
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
         let dequant = center_scaled / sqrt_d;
         (level, dequant)
     }
 }

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17583590) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1273:9:
assertion `left == right` failed
  left: [0, 0]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17583591) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1303:9:
assertion `left == right` failed
  left: [0, 0]
 right: [170, 2]

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17583593) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints
    quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.78s

*** result: Failure(101)
