*** hardening/careful/src/../../../src/quant/rabitq.rs:1007:61: replace - with / in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with / in quantize_level
@@ -999,17 +999,17 @@
         } else {
             (0, -1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let scaled = o_hat_i * sqrt_d;
         let t = ((scaled + c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
-        let level = ((t * levels as f32) as u32).min(levels - 1);
+        let level = ((t * levels as f32) as u32).min(levels / /* ~ changed by cargo-mutants ~ */ 1);
         // Bin center, mapped back to unit-vector scale.
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
         let dequant = center_scaled / sqrt_d;
         (level, dequant)
     }
 }
 
 /// Inverse of [`quantize_level`]: given a stored level index and

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17589849) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1583:9:
q=4 should reduce error vs q=1, got err_bin=52.911736 err_q4=67.41881

failures:
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.06s

*** result: Failure(101)
