*** hardening/careful/src/../../../src/quant/rabitq.rs:1010:37: replace / with % in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with % in quantize_level
@@ -1002,17 +1002,17 @@
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let scaled = o_hat_i * sqrt_d;
         let t = ((scaled + c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
         let level = ((t * levels as f32) as u32).min(levels - 1);
         // Bin center, mapped back to unit-vector scale.
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
-        let dequant = center_scaled / sqrt_d;
+        let dequant = center_scaled % /* ~ changed by cargo-mutants ~ */ sqrt_d;
         (level, dequant)
     }
 }
 
 /// Inverse of [`quantize_level`]: given a stored level index and
 /// `bits`, return the dequantized coordinate value.
 fn dequant_level(level: u32, bits: usize, sqrt_d: f32) -> f32 {
     if bits == 1 {

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17598371) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1293:9:
assertion failed: (x_dec_norm - expected_x_dec_norm).abs() < 1e-6

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17598382) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1425:17:
bits=2 level=0 dequant=-0.375 roundtrip=-1.5

---- quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term stdout ----

thread 'quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term' (17598383) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1447:9:
assertion failed: (dequant - (-0.5 / sqrt_d)).abs() < 1e-6

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints
    quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.99s

*** result: Failure(101)
