*** hardening/careful/src/../../../src/quant/rabitq.rs:1018:5: replace dequant_level -> f32 with -1.0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace dequant_level -> f32 with -1.0
@@ -1010,28 +1010,17 @@
         let dequant = center_scaled / sqrt_d;
         (level, dequant)
     }
 }
 
 /// Inverse of [`quantize_level`]: given a stored level index and
 /// `bits`, return the dequantized coordinate value.
 fn dequant_level(level: u32, bits: usize, sqrt_d: f32) -> f32 {
-    if bits == 1 {
-        if level == 1 {
-            1.0
-        } else {
-            -1.0
-        }
-    } else {
-        let levels = 1_u32 << bits;
-        let c = RABITQ_QUANT_CLIP;
-        let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
-        center_scaled / sqrt_d
-    }
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
     match bits {

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17602677) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1519:9:
sign-aligned self-IP exact, got estimate=-10.499999 truth=32 err=42.5

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17602681) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1572:9:
q=4 should reduce error vs q=1, got err_bin=78.76018 err_q4=697.3625

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17602682) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1414:17:
bits=2 level=0 dequant=-1 roundtrip=-0.375

failures:
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
