*** hardening/careful/src/../../../src/quant/rabitq.rs:1019:18: replace == with != in dequant_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace == with != in dequant_level
@@ -1011,17 +1011,17 @@
         (level, dequant)
     }
 }
 
 /// Inverse of [`quantize_level`]: given a stored level index and
 /// `bits`, return the dequantized coordinate value.
 fn dequant_level(level: u32, bits: usize, sqrt_d: f32) -> f32 {
     if bits == 1 {
-        if level == 1 {
+        if level != /* ~ changed by cargo-mutants ~ */ 1 {
             1.0
         } else {
             -1.0
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17603582) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=-31.999998 truth=32 err=64

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17603581) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2031:13:
bound violated for seed=128: err=33.045147 bound=32.723145 (estimate=19.988897, truth=-13.056251)

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17603587) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1434:9:
assertion `left == right` failed
  left: -1.0
 right: 1.0

failures:
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
