*** hardening/careful/src/../../../src/quant/rabitq.rs:1022:13: delete - in dequant_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete - in dequant_level
@@ -1014,17 +1014,17 @@
 
 /// Inverse of [`quantize_level`]: given a stored level index and
 /// `bits`, return the dequantized coordinate value.
 fn dequant_level(level: u32, bits: usize, sqrt_d: f32) -> f32 {
     if bits == 1 {
         if level == 1 {
             1.0
         } else {
-            -1.0
+             /* ~ changed by cargo-mutants ~ */1.0
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
         center_scaled / sqrt_d
     }
 }

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17605003) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=10.499999 truth=32 err=21.5

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17605008) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1435:9:
assertion `left == right` failed
  left: 1.0
 right: -1.0

failures:
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.11s

*** result: Failure(101)
