*** hardening/careful/src/../../../src/quant/rabitq.rs:1027:87: replace - with / in dequant_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with / in dequant_level
@@ -1019,17 +1019,17 @@
         if level == 1 {
             1.0
         } else {
             -1.0
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
-        let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
+        let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE / /* ~ changed by cargo-mutants ~ */ c;
         center_scaled / sqrt_d
     }
 }
 
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17607562) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1424:17:
assertion `left == right` failed: bits=2 level=0
  left: 2
 right: 0

failures:
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.86s

*** result: Failure(101)
