*** hardening/careful/src/../../../src/quant/rabitq.rs:1028:23: replace / with % in dequant_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with % in dequant_level
@@ -1020,17 +1020,17 @@
             1.0
         } else {
             -1.0
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
-        center_scaled / sqrt_d
+        center_scaled % /* ~ changed by cargo-mutants ~ */ sqrt_d
     }
 }
 
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17615034) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1583:9:
q=4 should reduce error vs q=1, got err_bin=52.911736 err_q4=809.1899

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17615035) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1425:17:
bits=2 level=0 dequant=-1.5 roundtrip=-0.375

failures:
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.93s

*** result: Failure(101)
