*** hardening/careful/src/../../../src/quant/rabitq.rs:1037:5: replace write_level with ()

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace write_level with ()
@@ -1029,37 +1029,17 @@
     }
 }
 
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
-    match bits {
-        1 => {
-            if level == 1 {
-                out[i / 8] |= 1_u8 << (i % 8);
-            }
-        }
-        2 => {
-            let byte = i / 4;
-            let shift = (i % 4) * 2;
-            out[byte] |= ((level as u8) & 0x03) << shift;
-        }
-        4 => {
-            let byte = i / 2;
-            let shift = (i % 2) * 4;
-            out[byte] |= ((level as u8) & 0x0F) << shift;
-        }
-        8 => {
-            out[i] = level as u8;
-        }
-        _ => unreachable!("unsupported bits_per_dim: {}", bits),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
         1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
         2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
         4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17616877) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1383:17:
assertion `left == right` failed: bits=1 i=0
  left: 0
 right: 1

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17616880) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1731:9:
assertion `left == right` failed
  left: 0
 right: 5

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17616882) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1655:9:
self-centered unit IP should be 1.0, got -0.96875

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 441 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.06s

*** result: Failure(101)
