*** hardening/careful/src/../../../src/quant/rabitq.rs:1038:9: delete match arm 1 in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete match arm 1 in write_level
@@ -1030,21 +1030,17 @@
 }
 
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
     match bits {
-        1 => {
-            if level == 1 {
-                out[i / 8] |= 1_u8 << (i % 8);
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         2 => {
             let byte = i / 4;
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17618493) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 1

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17618495) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 1

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17618496) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 1

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_rec

test result: FAILED. 438 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.95s

*** result: Failure(101)
