*** hardening/careful/src/../../../src/quant/rabitq.rs:1039:22: replace == with != in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace == with != in write_level
@@ -1031,17 +1031,17 @@
 
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
     match bits {
         1 => {
-            if level == 1 {
+            if level != /* ~ changed by cargo-mutants ~ */ 1 {
                 out[i / 8] |= 1_u8 << (i % 8);
             }
         }
         2 => {
             let byte = i / 4;
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17622479) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1403:17:
assertion `left == right` failed: bits=1 i=0
  left: 0
 right: 1

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17622482) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1751:9:
assertion `left == right` failed
  left: 10
 right: 5

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17622483) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=9001: err=0.15228292 bound=0.11872939

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector

test result: FAILED. 442 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.02s

*** result: Failure(101)
