*** hardening/careful/src/../../../src/quant/rabitq.rs:1040:23: replace / with % in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with % in write_level
@@ -1032,17 +1032,17 @@
 /// Write a `bits`-wide level index at coordinate position `i` into
 /// the LSB-first packed buffer `out`. Restricted to `bits ∈ {1, 2,
 /// 4, 8}` so the bit offset is always byte-aligned within each
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
     match bits {
         1 => {
             if level == 1 {
-                out[i / 8] |= 1_u8 << (i % 8);
+                out[i % /* ~ changed by cargo-mutants ~ */ 8] |= 1_u8 << (i % 8);
             }
         }
         2 => {
             let byte = i / 4;
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
         4 => {

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17623436) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1040:17:
index out of bounds: the len is 3 but the index is 4

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17623439) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1751:9:
assertion `left == right` failed
  left: 1
 right: 5

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17623441) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got -1.09375

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.85s

*** result: Failure(101)
