*** hardening/careful/src/../../../src/quant/rabitq.rs:1043:9: delete match arm 2 in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete match arm 2 in write_level
@@ -1035,21 +1035,17 @@
 /// coord.
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
     match bits {
         1 => {
             if level == 1 {
                 out[i / 8] |= 1_u8 << (i % 8);
             }
         }
-        2 => {
-            let byte = i / 4;
-            let shift = (i % 4) * 2;
-            out[byte] |= ((level as u8) & 0x03) << shift;
-        }
+         /* ~ changed by cargo-mutants ~ */
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;
             out[byte] |= ((level as u8) & 0x0F) << shift;
         }
         8 => {
             out[i] = level as u8;
         }

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17618991) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 2

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17619002) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 2

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17619003) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 2

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.91s

*** result: Failure(101)
