*** hardening/careful/src/../../../src/quant/rabitq.rs:1044:26: replace / with * in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in write_level
@@ -1036,17 +1036,17 @@
 fn write_level(out: &mut [u8], i: usize, bits: usize, level: u32) {
     match bits {
         1 => {
             if level == 1 {
                 out[i / 8] |= 1_u8 << (i % 8);
             }
         }
         2 => {
-            let byte = i / 4;
+            let byte = i * /* ~ changed by cargo-mutants ~ */ 4;
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;
             out[byte] |= ((level as u8) & 0x0F) << shift;
         }

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17630453) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1046:13:
index out of bounds: the len is 5 but the index is 8

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17630464) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1046:13:
index out of bounds: the len is 14 but the index is 16

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17630465) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1046:13:
index out of bounds: the len is 14 but the index is 16

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.88s

*** result: Failure(101)
