*** hardening/careful/src/../../../src/quant/rabitq.rs:1045:28: replace % with + in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace % with + in write_level
@@ -1037,17 +1037,17 @@
     match bits {
         1 => {
             if level == 1 {
                 out[i / 8] |= 1_u8 << (i % 8);
             }
         }
         2 => {
             let byte = i / 4;
-            let shift = (i % 4) * 2;
+            let shift = (i + /* ~ changed by cargo-mutants ~ */ 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;
             out[byte] |= ((level as u8) & 0x0F) << shift;
         }
         8 => {

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17634392) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1046:26:
attempt to shift left with overflow

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17634403) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1046:26:
attempt to shift left with overflow

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17634404) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1046:26:
attempt to shift left with overflow

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.05s

*** result: Failure(101)
