*** hardening/careful/src/../../../src/quant/rabitq.rs:1046:41: replace & with ^ in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace & with ^ in write_level
@@ -1038,17 +1038,17 @@
         1 => {
             if level == 1 {
                 out[i / 8] |= 1_u8 << (i % 8);
             }
         }
         2 => {
             let byte = i / 4;
             let shift = (i % 4) * 2;
-            out[byte] |= ((level as u8) & 0x03) << shift;
+            out[byte] |= ((level as u8) ^ /* ~ changed by cargo-mutants ~ */ 0x03) << shift;
         }
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;
             out[byte] |= ((level as u8) & 0x0F) << shift;
         }
         8 => {
             out[i] = level as u8;

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17638394) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1403:17:
assertion `left == right` failed: bits=2 i=0
  left: 1
 right: 2

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17638405) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1273:9:
assertion `left == right` failed
  left: [22, 3]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17638406) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1303:9:
assertion `left == right` failed
  left: [85, 1]
 right: [170, 2]

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.02s

*** result: Failure(101)
