*** hardening/careful/src/../../../src/quant/rabitq.rs:1048:9: delete match arm 4 in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete match arm 4 in write_level
@@ -1040,21 +1040,17 @@
                 out[i / 8] |= 1_u8 << (i % 8);
             }
         }
         2 => {
             let byte = i / 4;
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
-        4 => {
-            let byte = i / 2;
-            let shift = (i % 2) * 4;
-            out[byte] |= ((level as u8) & 0x0F) << shift;
-        }
+         /* ~ changed by cargo-mutants ~ */
         8 => {
             out[i] = level as u8;
         }
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17619463) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 4

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17619486) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1052:14:
internal error: entered unreachable code: unsupported bits_per_dim: 4

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.87s

*** result: Failure(101)
