*** hardening/careful/src/../../../src/quant/rabitq.rs:1051:41: replace & with | in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace & with | in write_level
@@ -1043,17 +1043,17 @@
         2 => {
             let byte = i / 4;
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;
-            out[byte] |= ((level as u8) & 0x0F) << shift;
+            out[byte] |= ((level as u8) | /* ~ changed by cargo-mutants ~ */ 0x0F) << shift;
         }
         8 => {
             out[i] = level as u8;
         }
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17646854) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1403:17:
assertion `left == right` failed: bits=4 i=0
  left: 15
 right: 4

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17646875) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1583:9:
q=4 should reduce error vs q=1, got err_bin=52.911736 err_q4=92.79138

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.93s

*** result: Failure(101)
