*** hardening/careful/src/../../../src/quant/rabitq.rs:1053:9: delete match arm 8 in write_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete match arm 8 in write_level
@@ -1045,19 +1045,17 @@
             let shift = (i % 4) * 2;
             out[byte] |= ((level as u8) & 0x03) << shift;
         }
         4 => {
             let byte = i / 2;
             let shift = (i % 2) * 4;
             out[byte] |= ((level as u8) & 0x0F) << shift;
         }
-        8 => {
-            out[i] = level as u8;
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
         1 => ((code[i / 8] >> (i % 8)) & 1) as u32,

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17620669) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1054:14:
internal error: entered unreachable code: unsupported bits_per_dim: 8

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.23s

*** result: Failure(101)
