*** hardening/careful/src/../../../src/quant/rabitq.rs:1062:5: replace read_level -> u32 with 1

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace read_level -> u32 with 1
@@ -1054,23 +1054,17 @@
             out[i] = level as u8;
         }
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
-    match bits {
-        1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
-        2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
-        4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,
-        8 => code[i] as u32,
-        _ => unreachable!("unsupported bits_per_dim: {}", bits),
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Paper-faithful RaBitQ inner-product estimator with an
 /// ε-concentration error bound.
 ///
 /// The candidate code holds a `bits_per_dim`-bit level per
 /// coordinate plus three scalars: `||o||`, `o_dot = ⟨o_unit,
 /// x_dec/||x_dec||⟩`, and `||x_dec||`. Given query `q` (rotated,

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17650366) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1397:17:
assertion `left == right` failed: bits=1 i=1
  left: 1
 right: 0

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17650384) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1524:9:
sign-aligned self-IP exact, got estimate=10.499999 truth=32 err=21.5

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17650390) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1577:9:
q=4 should reduce error vs q=1, got err_bin=66.88969 err_q4=87.07721

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
