*** hardening/careful/src/../../../src/quant/rabitq.rs:1063:23: replace / with % in read_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with % in read_level
@@ -1055,17 +1055,17 @@
         }
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
-        1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
+        1 => ((code[i % /* ~ changed by cargo-mutants ~ */ 8] >> (i % 8)) & 1) as u32,
         2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
         4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,
         8 => code[i] as u32,
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Paper-faithful RaBitQ inner-product estimator with an

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17658296) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1403:17:
assertion `left == right` failed: bits=1 i=2
  left: 0
 right: 1

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17658312) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2031:13:
bound violated for seed=42: err=52.440132 bound=32.762054 (estimate=29.325325, truth=-23.114807)

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17658313) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=-10.499999 truth=32 err=42.5

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
