*** hardening/careful/src/../../../src/quant/rabitq.rs:1063:23: replace / with * in read_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in read_level
@@ -1055,17 +1055,17 @@
         }
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
-        1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
+        1 => ((code[i * /* ~ changed by cargo-mutants ~ */ 8] >> (i % 8)) & 1) as u32,
         2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
         4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,
         8 => code[i] as u32,
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Paper-faithful RaBitQ inner-product estimator with an

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17658808) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1063:16:
index out of bounds: the len is 3 but the index is 8

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17658824) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1063:16:
index out of bounds: the len is 44 but the index is 48

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17658825) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1063:16:
index out of bounds: the len is 28 but the index is 32

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.97s

*** result: Failure(101)
