*** hardening/careful/src/../../../src/quant/rabitq.rs:1063:9: delete match arm 1 in read_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete match arm 1 in read_level
@@ -1055,17 +1055,17 @@
         }
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
-        1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
+         /* ~ changed by cargo-mutants ~ */
         2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
         4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,
         8 => code[i] as u32,
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Paper-faithful RaBitQ inner-product estimator with an

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17650889) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1067:14:
internal error: entered unreachable code: unsupported bits_per_dim: 1

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17650890) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1067:14:
internal error: entered unreachable code: unsupported bits_per_dim: 1

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17650894) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1067:14:
internal error: entered unreachable code: unsupported bits_per_dim: 1

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.95s

*** result: Failure(101)
