*** hardening/careful/src/../../../src/quant/rabitq.rs:1064:23: replace / with * in read_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in read_level
@@ -1056,17 +1056,17 @@
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
         1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
-        2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
+        2 => ((code[i * /* ~ changed by cargo-mutants ~ */ 4] >> ((i % 4) * 2)) & 0x03) as u32,
         4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,
         8 => code[i] as u32,
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Paper-faithful RaBitQ inner-product estimator with an
 /// ε-concentration error bound.

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17666259) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1403:17:
assertion `left == right` failed: bits=2 i=1
  left: 0
 right: 1

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17666300) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1064:16:
index out of bounds: the len is 14 but the index is 16

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17666302) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1064:16:
index out of bounds: the len is 14 but the index is 16

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.08s

*** result: Failure(101)
