*** hardening/careful/src/../../../src/quant/rabitq.rs:1065:9: delete match arm 4 in read_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete match arm 4 in read_level
@@ -1057,17 +1057,17 @@
     }
 }
 
 /// Inverse of [`write_level`].
 fn read_level(code: &[u8], i: usize, bits: usize) -> u32 {
     match bits {
         1 => ((code[i / 8] >> (i % 8)) & 1) as u32,
         2 => ((code[i / 4] >> ((i % 4) * 2)) & 0x03) as u32,
-        4 => ((code[i / 2] >> ((i % 2) * 4)) & 0x0F) as u32,
+         /* ~ changed by cargo-mutants ~ */
         8 => code[i] as u32,
         _ => unreachable!("unsupported bits_per_dim: {}", bits),
     }
 }
 
 /// Paper-faithful RaBitQ inner-product estimator with an
 /// ε-concentration error bound.
 ///

---- quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths stdout ----

thread 'quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths' (17652341) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1067:14:
internal error: entered unreachable code: unsupported bits_per_dim: 4

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17652365) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1067:14:
internal error: entered unreachable code: unsupported bits_per_dim: 4

failures:
    quant::rabitq::tests::bit_level_packers_round_trip_all_supported_widths
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
