*** hardening/careful/src/../../../src/quant/rabitq.rs:1104:36: replace * with + in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with + in estimate_ip_impl
@@ -1096,17 +1096,17 @@
     query_rotated: &[f32],
     query_norm: f32,
     dimensions: usize,
     bits_per_dim: u8,
     code: &[u8],
 ) -> DistanceEstimate {
     debug_assert_eq!(query_rotated.len(), dimensions);
     let bits = bits_per_dim as usize;
-    let packed_bytes = (dimensions * bits).div_ceil(8);
+    let packed_bytes = (dimensions + /* ~ changed by cargo-mutants ~ */ bits).div_ceil(8);
     assert!(
         code.len() >= packed_bytes + RABITQ_SCALAR_LEN,
         "RaBitQ code too short: got {}, expected at least {}",
         code.len(),
         packed_bytes + RABITQ_SCALAR_LEN,
     );
     let s = packed_bytes;
     let candidate_norm = f32::from_le_bytes(

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17680158) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17680159) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1383:9:
assertion failed: at.bound.is_finite()

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17680160) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1105:5:
RaBitQ code too short: got 44, expected at least 45

failures:
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 444 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.84s

*** result: Failure(101)
