*** hardening/careful/src/../../../src/quant/rabitq.rs:1118:37: replace + with - in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with - in estimate_ip_impl
@@ -1110,17 +1110,17 @@
     );
     let s = packed_bytes;
     let candidate_norm = f32::from_le_bytes(
         code[s..s + RABITQ_NORM_LEN]
             .try_into()
             .expect("norm slice is always 4 bytes"),
     );
     let candidate_o_dot = f32::from_le_bytes(
-        code[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
+        code[s + RABITQ_NORM_LEN..s - /* ~ changed by cargo-mutants ~ */ RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
             .try_into()
             .expect("o_dot slice is always 4 bytes"),
     );
     let candidate_x_norm = f32::from_le_bytes(
         code[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
             .try_into()
             .expect("x_norm slice is always 4 bytes"),
     );

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17687588) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1118:35:
attempt to subtract with overflow

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17687589) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1118:35:
attempt to subtract with overflow

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17687590) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1118:13:
slice index starts at 36 but ends at 32

failures:
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 444 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.93s

*** result: Failure(101)
