*** hardening/careful/src/../../../src/quant/rabitq.rs:1123:34: replace + with - in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with - in estimate_ip_impl
@@ -1115,17 +1115,17 @@
             .expect("norm slice is always 4 bytes"),
     );
     let candidate_o_dot = f32::from_le_bytes(
         code[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
             .try_into()
             .expect("o_dot slice is always 4 bytes"),
     );
     let candidate_x_norm = f32::from_le_bytes(
-        code[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
+        code[s + RABITQ_NORM_LEN - /* ~ changed by cargo-mutants ~ */ RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
             .try_into()
             .expect("x_norm slice is always 4 bytes"),
     );
 
     let sqrt_d = (dimensions as f32).sqrt();
 
     // Σ_i q_i · dequant(level_i) in the rotated basis.
     let mut sum_q_dequant = 0.0_f32;

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17689597) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1125:14:
x_norm slice is always 4 bytes: TryFromSliceError(())

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17689595) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1125:14:
x_norm slice is always 4 bytes: TryFromSliceError(())

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17689599) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1125:14:
x_norm slice is always 4 bytes: TryFromSliceError(())

failures:
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 444 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.98s

*** result: Failure(101)
