*** hardening/careful/src/../../../src/quant/rabitq.rs:1135:34: replace * with + in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with + in estimate_ip_impl
@@ -1127,17 +1127,17 @@
 
     let sqrt_d = (dimensions as f32).sqrt();
 
     // Σ_i q_i · dequant(level_i) in the rotated basis.
     let mut sum_q_dequant = 0.0_f32;
     for (i, &query_i) in query_rotated.iter().enumerate().take(dimensions) {
         let level = read_level(code, i, bits);
         let dequant = dequant_level(level, bits, sqrt_d);
-        sum_q_dequant += query_i * dequant;
+        sum_q_dequant += query_i + /* ~ changed by cargo-mutants ~ */ dequant;
     }
 
     // Guard degenerate cases.
     const O_DOT_FLOOR: f32 = 1e-6;
     if candidate_o_dot.abs() < O_DOT_FLOOR
         || !candidate_o_dot.is_finite()
         || candidate_x_norm <= 0.0
         || !candidate_x_norm.is_finite()

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17697678) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17697682) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=31.499996 truth=32 err=0.5000038

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17697688) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1583:9:
q=4 should reduce error vs q=1, got err_bin=46.496723 err_q4=733.17554

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.99s

*** result: Failure(101)
