*** hardening/careful/src/../../../src/quant/rabitq.rs:1141:9: replace || with && in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace || with && in estimate_ip_impl
@@ -1133,17 +1133,17 @@
         let level = read_level(code, i, bits);
         let dequant = dequant_level(level, bits, sqrt_d);
         sum_q_dequant += query_i * dequant;
     }
 
     // Guard degenerate cases.
     const O_DOT_FLOOR: f32 = 1e-6;
     if candidate_o_dot.abs() < O_DOT_FLOOR
-        || !candidate_o_dot.is_finite()
+        && /* ~ changed by cargo-mutants ~ */ !candidate_o_dot.is_finite()
         || candidate_x_norm <= 0.0
         || !candidate_x_norm.is_finite()
     {
         return DistanceEstimate {
             estimate: 0.0,
             bound: f32::INFINITY,
         };
     }

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17701522) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1343:9:
assertion failed: q.estimate_ip(&prepared, &code).bound.is_infinite()

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17701523) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1375:9:
assertion `left == right` failed
  left: -1983938.6
 right: 0.0

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.98s

*** result: Failure(101)
