*** hardening/careful/src/../../../src/quant/rabitq.rs:1143:9: replace || with && in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace || with && in estimate_ip_impl
@@ -1135,17 +1135,17 @@
         sum_q_dequant += query_i * dequant;
     }
 
     // Guard degenerate cases.
     const O_DOT_FLOOR: f32 = 1e-6;
     if candidate_o_dot.abs() < O_DOT_FLOOR
         || !candidate_o_dot.is_finite()
         || candidate_x_norm <= 0.0
-        || !candidate_x_norm.is_finite()
+        && /* ~ changed by cargo-mutants ~ */ !candidate_x_norm.is_finite()
     {
         return DistanceEstimate {
             estimate: 0.0,
             bound: f32::INFINITY,
         };
     }
 
     // Paper's asymmetric estimator. Derivation:

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17699475) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1352:9:
assertion failed: q.estimate_ip(&prepared, &code).bound.is_infinite()

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.88s

*** result: Failure(101)
