*** hardening/careful/src/../../../src/quant/rabitq.rs:1160:51: replace / with * in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in estimate_ip_impl
@@ -1152,17 +1152,17 @@
     //   ⟨q_unit, o_unit⟩ ≈ ⟨q_unit, x̄⟩ / o_dot
     //     where x̄ = x_dec / ||x_dec||
     //   ⟨q, o⟩ = ||q|| · ||o|| · ⟨q_unit, o_unit⟩
     //         ≈ ||o|| · ⟨q, x̄⟩ / o_dot
     //         = ||o|| · ⟨q, x_dec⟩ / (o_dot · ||x_dec||)
     // The α form (estimate = α · ⟨q, x_dec⟩ with α = ||o||·o_dot/||x_dec||)
     // is the least-squares fit of o ≈ α·x_dec; it preserves ranking but
     // under-scales by 1/o_dot² and breaks absolute error.
-    let estimate = candidate_norm * sum_q_dequant / (candidate_o_dot * candidate_x_norm);
+    let estimate = candidate_norm * sum_q_dequant * /* ~ changed by cargo-mutants ~ */ (candidate_o_dot * candidate_x_norm);
 
     let o_dot_sq = candidate_o_dot * candidate_o_dot;
     let epsilon_sq = ((1.0 - o_dot_sq).max(0.0)) / (dimensions as f32 * o_dot_sq);
     let bound = RABITQ_BOUND_CONFIDENCE * query_norm * candidate_norm * epsilon_sq.sqrt();
 
     DistanceEstimate { estimate, bound }
 }

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17709584) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17709586) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2031:13:
bound violated for seed=1: err=1122.3904 bound=31.73119 (estimate=-1123.4349, truth=-1.0444978)

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17709587) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=4096 truth=32 err=4064

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.11s

*** result: Failure(101)
