*** hardening/careful/src/../../../src/quant/rabitq.rs:1163:28: replace - with / in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with / in estimate_ip_impl
@@ -1155,17 +1155,17 @@
     //         ≈ ||o|| · ⟨q, x̄⟩ / o_dot
     //         = ||o|| · ⟨q, x_dec⟩ / (o_dot · ||x_dec||)
     // The α form (estimate = α · ⟨q, x_dec⟩ with α = ||o||·o_dot/||x_dec||)
     // is the least-squares fit of o ≈ α·x_dec; it preserves ranking but
     // under-scales by 1/o_dot² and breaks absolute error.
     let estimate = candidate_norm * sum_q_dequant / (candidate_o_dot * candidate_x_norm);
 
     let o_dot_sq = candidate_o_dot * candidate_o_dot;
-    let epsilon_sq = ((1.0 - o_dot_sq).max(0.0)) / (dimensions as f32 * o_dot_sq);
+    let epsilon_sq = ((1.0 / /* ~ changed by cargo-mutants ~ */ o_dot_sq).max(0.0)) / (dimensions as f32 * o_dot_sq);
     let bound = RABITQ_BOUND_CONFIDENCE * query_norm * candidate_norm * epsilon_sq.sqrt();
 
     DistanceEstimate { estimate, bound }
 }
 
 fn sign_words_from_byte_slice(bytes: &[u8], dim: usize) -> Vec<u64> {
     let mut words = vec![0_u64; dim.div_ceil(64)];
     for index in 0..dim {

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17719383) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1337:9:
assertion failed: (estimate.bound - expected_bound).abs() < 1e-6

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17719386) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1537:9:
bound should collapse to zero for sign-aligned vector, got 7.071066

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
