*** hardening/careful/src/../../../src/quant/rabitq.rs:1170:5: replace sign_words_from_byte_slice -> Vec<u64> with vec![]

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace sign_words_from_byte_slice -> Vec<u64> with vec![]
@@ -1162,24 +1162,17 @@
     let o_dot_sq = candidate_o_dot * candidate_o_dot;
     let epsilon_sq = ((1.0 - o_dot_sq).max(0.0)) / (dimensions as f32 * o_dot_sq);
     let bound = RABITQ_BOUND_CONFIDENCE * query_norm * candidate_norm * epsilon_sq.sqrt();
 
     DistanceEstimate { estimate, bound }
 }
 
 fn sign_words_from_byte_slice(bytes: &[u8], dim: usize) -> Vec<u64> {
-    let mut words = vec![0_u64; dim.div_ceil(64)];
-    for index in 0..dim {
-        let byte = bytes[index / 8];
-        if (byte >> (index % 8)) & 1 == 1 {
-            words[index / 64] |= 1_u64 << (index % 64);
-        }
-    }
-    words
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     struct Identity {
         dim: usize,

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17727787) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1468:9:
assertion `left == right` failed
  left: []
 right: [933]

failures:
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.87s

*** result: Failure(101)
