*** hardening/careful/src/../../../src/quant/rabitq.rs:1172:32: replace / with % in sign_words_from_byte_slice

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with % in sign_words_from_byte_slice
@@ -1164,17 +1164,17 @@
     let bound = RABITQ_BOUND_CONFIDENCE * query_norm * candidate_norm * epsilon_sq.sqrt();
 
     DistanceEstimate { estimate, bound }
 }
 
 fn sign_words_from_byte_slice(bytes: &[u8], dim: usize) -> Vec<u64> {
     let mut words = vec![0_u64; dim.div_ceil(64)];
     for index in 0..dim {
-        let byte = bytes[index / 8];
+        let byte = bytes[index % /* ~ changed by cargo-mutants ~ */ 8];
         if (byte >> (index % 8)) & 1 == 1 {
             words[index / 64] |= 1_u64 << (index % 64);
         }
     }
     words
 }
 
 #[cfg(test)]

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17731305) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1172:20:
index out of bounds: the len is 2 but the index is 2

failures:
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
