*** hardening/careful/src/../../../src/quant/rabitq.rs:1174:25: replace / with * in sign_words_from_byte_slice

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in sign_words_from_byte_slice
@@ -1166,17 +1166,17 @@
     DistanceEstimate { estimate, bound }
 }
 
 fn sign_words_from_byte_slice(bytes: &[u8], dim: usize) -> Vec<u64> {
     let mut words = vec![0_u64; dim.div_ceil(64)];
     for index in 0..dim {
         let byte = bytes[index / 8];
         if (byte >> (index % 8)) & 1 == 1 {
-            words[index / 64] |= 1_u64 << (index % 64);
+            words[index * /* ~ changed by cargo-mutants ~ */ 64] |= 1_u64 << (index % 64);
         }
     }
     words
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17741940) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1174:18:
index out of bounds: the len is 1 but the index is 128

failures:
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.07s

*** result: Failure(101)
