*** hardening/careful/src/../../../src/quant/rabitq.rs:134:5: replace code_len_for -> Result<usize, String> with Ok(0)

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace code_len_for -> Result<usize, String> with Ok(0)
@@ -126,23 +126,17 @@
             SEEDED_SRHT_CONSTRUCTION_COUNT.with(|count_cell| {
                 count_cell.set(count_cell.get() + 1);
             });
         }
     });
 }
 
 pub fn code_len_for(dimensions: usize, bits_per_dim: u8) -> Result<usize, String> {
-    if !RABITQ_SUPPORTED_BITS.contains(&bits_per_dim) {
-        return Err(format!(
-            "RaBitQ bits_per_dim must be one of {:?}, got {}",
-            RABITQ_SUPPORTED_BITS, bits_per_dim,
-        ));
-    }
-    Ok((dimensions * bits_per_dim as usize).div_ceil(8) + RABITQ_SCALAR_LEN)
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Confidence coefficient on the ε-concentration bound returned in
 /// `DistanceEstimate.bound`. `2.5` ≈ 99% one-sided confidence under
 /// the paper's Gaussian-tail concentration argument. Stage 3 can
 /// tune this via a follow-up constructor; picking one value here
 /// keeps the trait surface scalar.
 pub const RABITQ_BOUND_CONFIDENCE: f32 = 2.5;

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17323727) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:375:9:
attempt to subtract with overflow

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17323728) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:375:9:
attempt to subtract with overflow

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17323729) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:375:9:
attempt to subtract with overflow

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative

test result: FAILED. 431 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.70s

*** result: Failure(101)
