*** hardening/careful/src/../../../src/quant/rabitq.rs:140:20: replace * with + in code_len_for

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with + in code_len_for
@@ -132,17 +132,17 @@
 
 pub fn code_len_for(dimensions: usize, bits_per_dim: u8) -> Result<usize, String> {
     if !RABITQ_SUPPORTED_BITS.contains(&bits_per_dim) {
         return Err(format!(
             "RaBitQ bits_per_dim must be one of {:?}, got {}",
             RABITQ_SUPPORTED_BITS, bits_per_dim,
         ));
     }
-    Ok((dimensions * bits_per_dim as usize).div_ceil(8) + RABITQ_SCALAR_LEN)
+    Ok((dimensions + /* ~ changed by cargo-mutants ~ */ bits_per_dim as usize).div_ceil(8) + RABITQ_SCALAR_LEN)
 }
 
 /// Confidence coefficient on the ε-concentration bound returned in
 /// `DistanceEstimate.bound`. `2.5` ≈ 99% one-sided confidence under
 /// the paper's Gaussian-tail concentration argument. Stage 3 can
 /// tune this via a follow-up constructor; picking one value here
 /// keeps the trait surface scalar.
 pub const RABITQ_BOUND_CONFIDENCE: f32 = 2.5;

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17327681) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1718:9:
assertion `left == right` failed
  left: -0.43749675
 right: 0.0

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17327684) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17327686) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_code_len_scales_with_bits

test result: FAILED. 436 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.78s

*** result: Failure(101)
