*** hardening/careful/src/../../../src/quant/rabitq.rs:140:20: replace * with / in code_len_for

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in code_len_for
@@ -132,17 +132,17 @@
 
 pub fn code_len_for(dimensions: usize, bits_per_dim: u8) -> Result<usize, String> {
     if !RABITQ_SUPPORTED_BITS.contains(&bits_per_dim) {
         return Err(format!(
             "RaBitQ bits_per_dim must be one of {:?}, got {}",
             RABITQ_SUPPORTED_BITS, bits_per_dim,
         ));
     }
-    Ok((dimensions * bits_per_dim as usize).div_ceil(8) + RABITQ_SCALAR_LEN)
+    Ok((dimensions / /* ~ changed by cargo-mutants ~ */ bits_per_dim as usize).div_ceil(8) + RABITQ_SCALAR_LEN)
 }
 
 /// Confidence coefficient on the ε-concentration bound returned in
 /// `DistanceEstimate.bound`. `2.5` ≈ 99% one-sided confidence under
 /// the paper's Gaussian-tail concentration argument. Stage 3 can
 /// tune this via a follow-up constructor; picking one value here
 /// keeps the trait surface scalar.
 pub const RABITQ_BOUND_CONFIDENCE: f32 = 2.5;

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17328213) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1273:9:
assertion `left == right` failed
  left: [233, 194]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17328214) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1303:9:
assertion `left == right` failed
  left: [170]
 right: [170, 2]

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17328216) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1105:5:
RaBitQ code too short: got 13, expected at least 14

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::qbit_code_len_scales_with_bits
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 443 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.91s

*** result: Failure(101)
