*** hardening/careful/src/../../../src/quant/rabitq.rs:251:9: replace SrhtRotation::prod -> Option<&Arc<ProdQuantizer>> with None

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace SrhtRotation::prod -> Option<&Arc<ProdQuantizer>> with None
@@ -243,17 +243,17 @@
         }
     }
 
     /// Access the underlying `ProdQuantizer`, when this rotation
     /// was built via [`Self::new`]. Returns `None` for
     /// seed-constructed rotations — those do not carry PQ codebook
     /// state and so cannot feed the ADR-031 sidecar encoder.
     pub fn prod(&self) -> Option<&Arc<ProdQuantizer>> {
-        self.prod.as_ref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Seed used to construct this rotation, when it was built via
     /// [`Self::with_seed`]. Returns `None` for quantizer-backed
     /// rotations — those inherit their signs from the
     /// `ProdQuantizer`'s own seed-derived state.
     pub fn seed(&self) -> Option<u64> {
         self.seed

---- quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod stdout ----

thread 'quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod' (17329816) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1639:9:
assertion failed: r4.prod().is_some()

failures:
    quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.97s

*** result: Failure(101)
