*** hardening/careful/src/../../../src/quant/rabitq.rs:259:9: replace SrhtRotation::seed -> Option<u64> with None

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace SrhtRotation::seed -> Option<u64> with None
@@ -251,17 +251,17 @@
         self.prod.as_ref()
     }
 
     /// Seed used to construct this rotation, when it was built via
     /// [`Self::with_seed`]. Returns `None` for quantizer-backed
     /// rotations — those inherit their signs from the
     /// `ProdQuantizer`'s own seed-derived state.
     pub fn seed(&self) -> Option<u64> {
-        self.seed
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Rotation for SrhtRotation {
     fn dimensions(&self) -> usize {
         self.dimensions
     }

---- quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod stdout ----

thread 'quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod' (17331269) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1629:9:
assertion `left == right` failed
  left: None
 right: Some(7)

failures:
    quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.75s

*** result: Failure(101)
