*** hardening/careful/src/../../../src/quant/rabitq.rs:265:9: replace <impl Rotation for SrhtRotation>::dimensions -> usize with 1

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace <impl Rotation for SrhtRotation>::dimensions -> usize with 1
@@ -257,17 +257,17 @@
     /// `ProdQuantizer`'s own seed-derived state.
     pub fn seed(&self) -> Option<u64> {
         self.seed
     }
 }
 
 impl Rotation for SrhtRotation {
     fn dimensions(&self) -> usize {
-        self.dimensions
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn apply(&self, v: &[f32]) -> Vec<f32> {
         assert_eq!(
             v.len(),
             self.dimensions,
             "SRHT input length mismatch: got {}, expected {}",
             v.len(),

---- quant::rabitq::tests::code_len_matches_dimension stdout ----

thread 'quant::rabitq::tests::code_len_matches_dimension' (17335003) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1220:9:
assertion `left == right` failed
  left: 1
 right: 192

---- quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative stdout ----

thread 'quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative' (17335009) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:395:9:
assertion `left == right` failed
  left: 64
 right: 1

failures:
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.11s

*** result: Failure(101)
