*** hardening/careful/src/../../../src/quant/rabitq.rs:269:9: replace <impl Rotation for SrhtRotation>::apply -> Vec<f32> with vec![-1.0]

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace <impl Rotation for SrhtRotation>::apply -> Vec<f32> with vec![-1.0]
@@ -261,25 +261,17 @@
 }
 
 impl Rotation for SrhtRotation {
     fn dimensions(&self) -> usize {
         self.dimensions
     }
 
     fn apply(&self, v: &[f32]) -> Vec<f32> {
-        assert_eq!(
-            v.len(),
-            self.dimensions,
-            "SRHT input length mismatch: got {}, expected {}",
-            v.len(),
-            self.dimensions,
-        );
-        let padded = rotation::srht_padded(v, &self.signs);
-        padded[..self.dimensions].to_vec()
+        vec![-1.0] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One RaBitQ quantizer instance. Owns the rotation via the
 /// [`Rotation`] trait object seam and the per-vector encoding
 /// parameters (dimensions, bits-per-dim). Build and scan paths
 /// share one `Arc<RaBitQQuantizer>`.
 pub struct RaBitQQuantizer {

---- quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod stdout ----

thread 'quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod' (17338601) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1625:9:
assertion `left != right` failed
  left: [-1.0]
 right: [-1.0]

---- quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative stdout ----

thread 'quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative' (17338581) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:387:9:
assertion `left == right` failed
  left: 1
 right: 64

failures:
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::srht_seeded_rotation_is_deterministic_and_independent_of_prod

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.88s

*** result: Failure(101)
