*** hardening/careful/src/../../../src/quant/rabitq.rs:327:12: delete ! in RaBitQQuantizer::with_bits

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete ! in RaBitQQuantizer::with_bits
@@ -319,17 +319,17 @@
 
     /// Construct at a specific `bits_per_dim`. Valid values live
     /// in [`RABITQ_SUPPORTED_BITS`]; returns `Err` otherwise. At
     /// `bits = 1` the encoding is bit-identical to the paper's
     /// binary RaBitQ; at `bits ≥ 2` each coordinate gets a signed
     /// q-bit scalar-quantized level with clipping at
     /// ±[`RABITQ_QUANT_CLIP`]·σ (σ = 1/√D on the unit sphere).
     pub fn with_bits(rotation: Arc<dyn Rotation>, bits: u8) -> Result<Self, String> {
-        if !RABITQ_SUPPORTED_BITS.contains(&bits) {
+        if  /* ~ changed by cargo-mutants ~ */RABITQ_SUPPORTED_BITS.contains(&bits) {
             return Err(format!(
                 "RaBitQ bits_per_dim must be one of {:?}, got {}",
                 RABITQ_SUPPORTED_BITS, bits,
             ));
         }
         let dimensions = rotation.dimensions();
         assert!(dimensions > 0, "RaBitQ dimensions must be positive");
         Ok(Self {

---- quant::rabitq::tests::centered_api_rejects_qbit_bits stdout ----

thread 'quant::rabitq::tests::centered_api_rejects_qbit_bits' (17339289) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1970:57:
called `Result::unwrap()` on an `Err` value: "RaBitQ bits_per_dim must be one of [1, 2, 4, 8], got 4"

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17339290) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1200:52:
called `Result::unwrap()` on an `Err` value: "RaBitQ bits_per_dim must be one of [1, 2, 4, 8], got 1"

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17339291) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1200:52:
called `Result::unwrap()` on an `Err` value: "RaBitQ bits_per_dim must be one of [1, 2, 4, 8], got 1"

failures:
    quant::rabitq::tests::centered_api_rejects_qbit_bits
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels

test result: FAILED. 429 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.94s

*** result: Failure(101)
