*** hardening/careful/src/../../../src/quant/rabitq.rs:381:9: replace RaBitQQuantizer::packed_bytes -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace RaBitQQuantizer::packed_bytes -> usize with 0
@@ -373,19 +373,17 @@
 
     pub fn bits_per_dim(&self) -> u8 {
         self.bits_per_dim
     }
 
     /// Number of bytes in the packed-levels portion of a code.
     /// At `bits = 1` this is `⌈D/8⌉`; generalizes as `⌈D·bits/8⌉`.
     pub fn packed_bytes(&self) -> usize {
-        code_len_for(self.dimensions, self.bits_per_dim)
-            .expect("validated RaBitQ bits should have a code length")
-            - RABITQ_SCALAR_LEN
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retained for slice-1 / slice-2 call-site compatibility —
     /// returns [`Self::packed_bytes`] since the canonical
     /// `bits = 1` shape has one sign bit per dim.
     pub fn sign_bytes(&self) -> usize {
         self.packed_bytes()
     }

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17345373) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:704:9:
centered code too short: got 12, expected at least 13

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17345374) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1749:9:
assertion `left == right` failed
  left: 1
 right: 5

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17345375) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1038:17:
index out of bounds: the len is 12 but the index is 12

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative

test result: FAILED. 431 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.21s

*** result: Failure(101)
