*** hardening/careful/src/../../../src/quant/rabitq.rs:381:9: replace RaBitQQuantizer::packed_bytes -> usize with 1

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace RaBitQQuantizer::packed_bytes -> usize with 1
@@ -373,19 +373,17 @@
 
     pub fn bits_per_dim(&self) -> u8 {
         self.bits_per_dim
     }
 
     /// Number of bytes in the packed-levels portion of a code.
     /// At `bits = 1` this is `⌈D/8⌉`; generalizes as `⌈D·bits/8⌉`.
     pub fn packed_bytes(&self) -> usize {
-        code_len_for(self.dimensions, self.bits_per_dim)
-            .expect("validated RaBitQ bits should have a code length")
-            - RABITQ_SCALAR_LEN
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retained for slice-1 / slice-2 call-site compatibility —
     /// returns [`Self::packed_bytes`] since the canonical
     /// `bits = 1` shape has one sign bit per dim.
     pub fn sign_bytes(&self) -> usize {
         self.packed_bytes()
     }

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17346180) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1038:17:
index out of bounds: the len is 13 but the index is 13

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17346181) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:704:9:
centered code too short: got 13, expected at least 20

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17346187) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1271:9:
assertion `left == right` failed
  left: [233, 194]
 right: [233, 0]

failures:
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_code_len_scales_with_bits
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 437 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.08s

*** result: Failure(101)
