*** hardening/careful/src/../../../src/quant/rabitq.rs:383:13: replace - with + in RaBitQQuantizer::packed_bytes

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with + in RaBitQQuantizer::packed_bytes
@@ -375,17 +375,17 @@
         self.bits_per_dim
     }
 
     /// Number of bytes in the packed-levels portion of a code.
     /// At `bits = 1` this is `⌈D/8⌉`; generalizes as `⌈D·bits/8⌉`.
     pub fn packed_bytes(&self) -> usize {
         code_len_for(self.dimensions, self.bits_per_dim)
             .expect("validated RaBitQ bits should have a code length")
-            - RABITQ_SCALAR_LEN
+            + /* ~ changed by cargo-mutants ~ */ RABITQ_SCALAR_LEN
     }
 
     /// Retained for slice-1 / slice-2 call-site compatibility —
     /// returns [`Self::packed_bytes`] since the canonical
     /// `bits = 1` shape has one sign bit per dim.
     pub fn sign_bytes(&self) -> usize {
         self.packed_bytes()
     }

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17347254) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17347255) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1794:9:
assertion failed: at_o_dot.bound.is_finite()

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17347256) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_code_len_scales_with_bits
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 438 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
