*** hardening/careful/src/../../../src/quant/rabitq.rs:390:9: replace RaBitQQuantizer::sign_bytes -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace RaBitQQuantizer::sign_bytes -> usize with 0
@@ -382,17 +382,17 @@
             .expect("validated RaBitQ bits should have a code length")
             - RABITQ_SCALAR_LEN
     }
 
     /// Retained for slice-1 / slice-2 call-site compatibility —
     /// returns [`Self::packed_bytes`] since the canonical
     /// `bits = 1` shape has one sign bit per dim.
     pub fn sign_bytes(&self) -> usize {
-        self.packed_bytes()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     fn rotated(&self, v: &[f32]) -> Vec<f32> {
         let out = self.rotation.apply(v);
         debug_assert_eq!(out.len(), self.dimensions);
         out
     }
 }

---- quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable stdout ----

thread 'quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable' (17351336) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1233:9:
assertion `left == right` failed
  left: 0
 right: 9

---- quant::rabitq::tests::code_len_matches_dimension stdout ----

thread 'quant::rabitq::tests::code_len_matches_dimension' (17351320) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1220:9:
assertion `left == right` failed
  left: 0
 right: 192

failures:
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.98s

*** result: Failure(101)
