*** hardening/careful/src/../../../src/quant/rabitq.rs:394:9: replace RaBitQQuantizer::rotated -> Vec<f32> with vec![0.0]

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace RaBitQQuantizer::rotated -> Vec<f32> with vec![0.0]
@@ -386,19 +386,17 @@
     /// Retained for slice-1 / slice-2 call-site compatibility —
     /// returns [`Self::packed_bytes`] since the canonical
     /// `bits = 1` shape has one sign bit per dim.
     pub fn sign_bytes(&self) -> usize {
         self.packed_bytes()
     }
 
     fn rotated(&self, v: &[f32]) -> Vec<f32> {
-        let out = self.rotation.apply(v);
-        debug_assert_eq!(out.len(), self.dimensions);
-        out
+        vec![0.0] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl crate::quant::Quantizer for RaBitQQuantizer {
     /// RaBitQ encode. Rotate the input, quantize each rotated
     /// coordinate to a signed `bits_per_dim`-bit level, pack the
     /// levels LSB-first, then append three f32 scalars: `||o||`,
     /// `o_dot = ⟨o_unit, x_dec/||x_dec||⟩`, and `||x_dec||`.

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17352672) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:562:9:
assertion `left == right` failed: center context dimensions mismatch
  left: 1
 right: 8

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17352673) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:562:9:
assertion `left == right` failed: center context dimensions mismatch
  left: 1
 right: 4

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17352674) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:562:9:
assertion `left == right` failed: center context dimensions mismatch
  left: 1
 right: 256

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bou

test result: FAILED. 433 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.72s

*** result: Failure(101)
