*** hardening/careful/src/../../../src/quant/rabitq.rs:417:32: replace > with >= in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace > with >= in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -409,17 +409,17 @@
     /// information; the estimator formula is unified across bits
     /// via the stored `||x_dec||`.
     fn encode_code(&self, v: &[f32]) -> Box<[u8]> {
         let rotated = self.rotated(v);
         let packed_bytes = self.packed_bytes();
         let mut out = vec![0_u8; packed_bytes + RABITQ_SCALAR_LEN];
 
         let norm = l2_norm(&rotated);
-        let inv_norm = if norm > 0.0 { 1.0 / norm } else { 0.0 };
+        let inv_norm = if norm >= /* ~ changed by cargo-mutants ~ */ 0.0 { 1.0 / norm } else { 0.0 };
         let sqrt_d = (self.dimensions as f32).sqrt();
 
         // Compute dequantized levels in-line with the packing loop
         // so we can also accumulate ⟨o, x_dec⟩ and ||x_dec||² as we
         // go — one pass, no intermediate Vec.
         let mut inner_o_xdec = 0.0_f32;
         let mut x_dec_norm_sq = 0.0_f32;

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17358550) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1303:9:
assertion `left == right` failed
  left: [0, 0]
 right: [170, 2]

failures:
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.19s

*** result: Failure(101)
