*** hardening/careful/src/../../../src/quant/rabitq.rs:429:61: replace * with + in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with + in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -421,17 +421,17 @@
         // so we can also accumulate ⟨o, x_dec⟩ and ||x_dec||² as we
         // go — one pass, no intermediate Vec.
         let mut inner_o_xdec = 0.0_f32;
         let mut x_dec_norm_sq = 0.0_f32;
 
         let bits = self.bits_per_dim as usize;
 
         for (i, &o_i) in rotated.iter().enumerate() {
-            let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
+            let (level_idx, dequant_i) = quantize_level(o_i + /* ~ changed by cargo-mutants ~ */ inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
             inner_o_xdec += o_i * dequant_i;
             x_dec_norm_sq += dequant_i * dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
         let denom = norm * x_dec_norm;
         let o_dot = if denom > 0.0 {

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17360759) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1273:9:
assertion `left == right` failed
  left: [255, 3]
 right: [233, 0]

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17360762) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.84s

*** result: Failure(101)
