*** hardening/careful/src/../../../src/quant/rabitq.rs:431:26: replace += with *= in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with *= in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -423,17 +423,17 @@
         let mut inner_o_xdec = 0.0_f32;
         let mut x_dec_norm_sq = 0.0_f32;
 
         let bits = self.bits_per_dim as usize;
 
         for (i, &o_i) in rotated.iter().enumerate() {
             let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
-            inner_o_xdec += o_i * dequant_i;
+            inner_o_xdec *= /* ~ changed by cargo-mutants ~ */ o_i * dequant_i;
             x_dec_norm_sq += dequant_i * dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
         let denom = norm * x_dec_norm;
         let o_dot = if denom > 0.0 {
             inner_o_xdec / denom
         } else {

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17364264) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1294:9:
assertion failed: (o_dot - expected_o_dot).abs() < 1e-6

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17364268) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17364271) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=0 truth=32 err=32

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.86s

*** result: Failure(101)
