*** hardening/careful/src/../../../src/quant/rabitq.rs:431:33: replace * with / in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -423,17 +423,17 @@
         let mut inner_o_xdec = 0.0_f32;
         let mut x_dec_norm_sq = 0.0_f32;
 
         let bits = self.bits_per_dim as usize;
 
         for (i, &o_i) in rotated.iter().enumerate() {
             let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
-            inner_o_xdec += o_i * dequant_i;
+            inner_o_xdec += o_i / /* ~ changed by cargo-mutants ~ */ dequant_i;
             x_dec_norm_sq += dequant_i * dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
         let denom = norm * x_dec_norm;
         let o_dot = if denom > 0.0 {
             inner_o_xdec / denom
         } else {

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17366652) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1294:9:
assertion failed: (o_dot - expected_o_dot).abs() < 1e-6

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17366662) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1583:9:
q=4 should reduce error vs q=1, got err_bin=52.911736 err_q4=54.286213

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.25s

*** result: Failure(101)
