*** hardening/careful/src/../../../src/quant/rabitq.rs:432:40: replace * with / in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -424,17 +424,17 @@
         let mut x_dec_norm_sq = 0.0_f32;
 
         let bits = self.bits_per_dim as usize;
 
         for (i, &o_i) in rotated.iter().enumerate() {
             let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
             inner_o_xdec += o_i * dequant_i;
-            x_dec_norm_sq += dequant_i * dequant_i;
+            x_dec_norm_sq += dequant_i / /* ~ changed by cargo-mutants ~ */ dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
         let denom = norm * x_dec_norm;
         let o_dot = if denom > 0.0 {
             inner_o_xdec / denom
         } else {
             0.0

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17370960) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1293:9:
assertion failed: (x_dec_norm - expected_x_dec_norm).abs() < 1e-6

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.06s

*** result: Failure(101)
