*** hardening/careful/src/../../../src/quant/rabitq.rs:436:26: replace * with / in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -428,17 +428,17 @@
         for (i, &o_i) in rotated.iter().enumerate() {
             let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
             inner_o_xdec += o_i * dequant_i;
             x_dec_norm_sq += dequant_i * dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
-        let denom = norm * x_dec_norm;
+        let denom = norm / /* ~ changed by cargo-mutants ~ */ x_dec_norm;
         let o_dot = if denom > 0.0 {
             inner_o_xdec / denom
         } else {
             0.0
         };
 
         let s = packed_bytes;
         out[s..s + RABITQ_NORM_LEN].copy_from_slice(&norm.to_le_bytes());

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17372238) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1294:9:
assertion failed: (o_dot - expected_o_dot).abs() < 1e-6

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17372243) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2031:13:
bound violated for seed=1: err=1.0154885 bound=0 (estimate=-0.029009288, truth=-1.0444978)

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17372244) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=0.25 truth=32 err=31.75

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.87s

*** result: Failure(101)
