*** hardening/careful/src/../../../src/quant/rabitq.rs:437:30: replace > with >= in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace > with >= in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -429,17 +429,17 @@
             let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
             inner_o_xdec += o_i * dequant_i;
             x_dec_norm_sq += dequant_i * dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
         let denom = norm * x_dec_norm;
-        let o_dot = if denom > 0.0 {
+        let o_dot = if denom >= /* ~ changed by cargo-mutants ~ */ 0.0 {
             inner_o_xdec / denom
         } else {
             0.0
         };
 
         let s = packed_bytes;
         out[s..s + RABITQ_NORM_LEN].copy_from_slice(&norm.to_le_bytes());
         out[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17375419) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1305:9:
assertion `left == right` failed
  left: NaN
 right: 0.0

failures:
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.99s

*** result: Failure(101)
