*** hardening/careful/src/../../../src/quant/rabitq.rs:445:15: replace + with - in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with - in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -437,17 +437,17 @@
         let o_dot = if denom > 0.0 {
             inner_o_xdec / denom
         } else {
             0.0
         };
 
         let s = packed_bytes;
         out[s..s + RABITQ_NORM_LEN].copy_from_slice(&norm.to_le_bytes());
-        out[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
+        out[s - /* ~ changed by cargo-mutants ~ */ RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
             .copy_from_slice(&o_dot.to_le_bytes());
         out[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
             .copy_from_slice(&x_dec_norm.to_le_bytes());
 
         out.into_boxed_slice()
     }
 
     fn prepare_scorer(

---- quant::rabitq::tests::custom_rotation_plugs_into_seam stdout ----

thread 'quant::rabitq::tests::custom_rotation_plugs_into_seam' (17380390) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:445:13:
attempt to subtract with overflow

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17380391) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:445:13:
attempt to subtract with overflow

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17380392) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:445:13:
attempt to subtract with overflow

failures:
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 441 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
