*** hardening/careful/src/../../../src/quant/rabitq.rs:468:29: replace + with * in <impl crate::quant::Quantizer for RaBitQQuantizer>::code_len

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with * in <impl crate::quant::Quantizer for RaBitQQuantizer>::code_len
@@ -460,17 +460,17 @@
             query_rotated: rotated,
             query_norm: norm,
             dimensions: self.dimensions,
             bits_per_dim: self.bits_per_dim,
         })
     }
 
     fn code_len(&self) -> usize {
-        self.packed_bytes() + RABITQ_SCALAR_LEN
+        self.packed_bytes() * /* ~ changed by cargo-mutants ~ */ RABITQ_SCALAR_LEN
     }
 
     fn wire_format_version(&self) -> u32 {
         0
     }
 }
 
 impl RaBitQQuantizer {

---- quant::rabitq::tests::qbit_code_len_scales_with_bits stdout ----

thread 'quant::rabitq::tests::qbit_code_len_scales_with_bits' (17395071) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1609:13:
assertion `left == right` failed: bits=1
  left: 2304
 right: 204

---- quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable stdout ----

thread 'quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable' (17395076) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1234:9:
assertion `left == right` failed
  left: 108
 right: 21

---- quant::rabitq::tests::code_len_matches_dimension stdout ----

thread 'quant::rabitq::tests::code_len_matches_dimension' (17395060) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1221:9:
assertion `left == right` failed
  left: 2304
 right: 204

failures:
    quant::rabitq::tests::code_len_matches_dimension
    quant::rabitq::tests::qbit_code_len_scales_with_bits
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.96s

*** result: Failure(101)
