*** hardening/careful/src/../../../src/quant/rabitq.rs:472:9: replace <impl crate::quant::Quantizer for RaBitQQuantizer>::wire_format_version -> u32 with 1

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace <impl crate::quant::Quantizer for RaBitQQuantizer>::wire_format_version -> u32 with 1
@@ -464,17 +464,17 @@
         })
     }
 
     fn code_len(&self) -> usize {
         self.packed_bytes() + RABITQ_SCALAR_LEN
     }
 
     fn wire_format_version(&self) -> u32 {
-        0
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl RaBitQQuantizer {
     /// Prepare the estimator state for `query`. The returned
     /// `PreparedEstimator` holds the rotated query coordinates in
     /// full f32 precision (the asymmetric half of the estimator) and
     /// the query's L2 norm.

---- quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable stdout ----

thread 'quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable' (17395907) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1238:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.82s

*** result: Failure(101)
