*** hardening/careful/src/../../../src/quant/rabitq.rs:576:42: replace - with + in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with + in RaBitQQuantizer::encode_code_centered
@@ -568,17 +568,17 @@
         );
 
         // Compute the rotated residual in one rotation (rotation is
         // linear, so r_tilde = rotate(v) − c_rotated).
         let v_rotated = self.rotated(v);
         let residual_rotated: Vec<_> = v_rotated
             .iter()
             .zip(center.rotated.iter())
-            .map(|(&v_i, &center_i)| v_i - center_i)
+            .map(|(&v_i, &center_i)| v_i + /* ~ changed by cargo-mutants ~ */ center_i)
             .collect();
 
         let residual_mag = l2_norm(&residual_rotated);
         let sqrt_d = (self.dimensions as f32).sqrt();
 
         let packed_bytes = self.packed_bytes();
         let mut out = vec![0_u8; packed_bytes + RABITQ_SCALAR_LEN];

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17398478) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1752:9:
assertion failed: (read_tail_f32(&code, packed_bytes, 0) - 2.304886).abs() < 1e-5

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17398479) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=1.0446935 bound=0.12215213

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17398480) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0.38575837

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.08s

*** result: Failure(101)
