*** hardening/careful/src/../../../src/quant/rabitq.rs:590:21: replace += with *= in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with *= in RaBitQQuantizer::encode_code_centered
@@ -582,17 +582,17 @@
         let packed_bytes = self.packed_bytes();
         let mut out = vec![0_u8; packed_bytes + RABITQ_SCALAR_LEN];
 
         let mut sum_abs = 0.0_f32;
         let mut sum_center_sign = 0.0_f32;
         for (i, &r_i) in residual_rotated.iter().enumerate() {
             let level = if r_i >= 0.0 { 1_u32 } else { 0_u32 };
             write_level(&mut out, i, 1, level);
-            sum_abs += r_i.abs();
+            sum_abs *= /* ~ changed by cargo-mutants ~ */ r_i.abs();
             if level == 1 {
                 sum_center_sign += center.rotated[i];
             } else {
                 sum_center_sign -= center.rotated[i];
             }
         }
 
         let inv_denom = if residual_mag > 0.0 {

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17401846) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1753:9:
assertion failed: (read_tail_f32(&code, packed_bytes, RABITQ_NORM_LEN) - 0.8134892).abs() < 1e-6

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17401848) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17401851) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.27s

*** result: Failure(101)
