*** hardening/careful/src/../../../src/quant/rabitq.rs:598:41: replace > with < in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace > with < in RaBitQQuantizer::encode_code_centered
@@ -590,17 +590,17 @@
             sum_abs += r_i.abs();
             if level == 1 {
                 sum_center_sign += center.rotated[i];
             } else {
                 sum_center_sign -= center.rotated[i];
             }
         }
 
-        let inv_denom = if residual_mag > 0.0 {
+        let inv_denom = if residual_mag < /* ~ changed by cargo-mutants ~ */ 0.0 {
             1.0 / (residual_mag * sqrt_d)
         } else {
             0.0
         };
         let o_dot = sum_abs * inv_denom;
         // ⟨x̄, c_tilde⟩ = (1/√D) · Σ c_tilde_i · sign(r_i), since
         // x̄ has elements ±1/√D and we accumulated with ±1 weights.
         let center_dot = sum_center_sign / sqrt_d;

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17407886) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1753:9:
assertion failed: (read_tail_f32(&code, packed_bytes, RABITQ_NORM_LEN) - 0.8134892).abs() < 1e-6

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17407888) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17407890) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.84s

*** result: Failure(101)
