*** hardening/careful/src/../../../src/quant/rabitq.rs:603:29: replace * with + in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with + in RaBitQQuantizer::encode_code_centered
@@ -595,17 +595,17 @@
             }
         }
 
         let inv_denom = if residual_mag > 0.0 {
             1.0 / (residual_mag * sqrt_d)
         } else {
             0.0
         };
-        let o_dot = sum_abs * inv_denom;
+        let o_dot = sum_abs + /* ~ changed by cargo-mutants ~ */ inv_denom;
         // ⟨x̄, c_tilde⟩ = (1/√D) · Σ c_tilde_i · sign(r_i), since
         // x̄ has elements ±1/√D and we accumulated with ±1 weights.
         let center_dot = sum_center_sign / sqrt_d;
 
         let s = packed_bytes;
         out[s..s + RABITQ_NORM_LEN].copy_from_slice(&residual_mag.to_le_bytes());
         out[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
             .copy_from_slice(&o_dot.to_le_bytes());

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17414694) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1753:9:
assertion failed: (read_tail_f32(&code, packed_bytes, RABITQ_NORM_LEN) - 0.8134892).abs() < 1e-6

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17414695) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.5473432 bound=0

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17414696) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0.015621186

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.08s

*** result: Failure(101)
