*** hardening/careful/src/../../../src/quant/rabitq.rs:606:42: replace / with % in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with % in RaBitQQuantizer::encode_code_centered
@@ -598,17 +598,17 @@
         let inv_denom = if residual_mag > 0.0 {
             1.0 / (residual_mag * sqrt_d)
         } else {
             0.0
         };
         let o_dot = sum_abs * inv_denom;
         // ⟨x̄, c_tilde⟩ = (1/√D) · Σ c_tilde_i · sign(r_i), since
         // x̄ has elements ±1/√D and we accumulated with ±1 weights.
-        let center_dot = sum_center_sign / sqrt_d;
+        let center_dot = sum_center_sign % /* ~ changed by cargo-mutants ~ */ sqrt_d;
 
         let s = packed_bytes;
         out[s..s + RABITQ_NORM_LEN].copy_from_slice(&residual_mag.to_le_bytes());
         out[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
             .copy_from_slice(&o_dot.to_le_bytes());
         out[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
             .copy_from_slice(&center_dot.to_le_bytes());
         out.into_boxed_slice()

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17415826) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1754:9:
assertion failed: (read_tail_f32(&code, packed_bytes, RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN) -
                3.375).abs() < 1e-6

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17415827) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.16725242 bound=0.12674442

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17415828) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0.90625

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
