*** hardening/careful/src/../../../src/quant/rabitq.rs:609:18: replace + with * in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with * in RaBitQQuantizer::encode_code_centered
@@ -601,17 +601,17 @@
             0.0
         };
         let o_dot = sum_abs * inv_denom;
         // ⟨x̄, c_tilde⟩ = (1/√D) · Σ c_tilde_i · sign(r_i), since
         // x̄ has elements ±1/√D and we accumulated with ±1 weights.
         let center_dot = sum_center_sign / sqrt_d;
 
         let s = packed_bytes;
-        out[s..s + RABITQ_NORM_LEN].copy_from_slice(&residual_mag.to_le_bytes());
+        out[s..s * /* ~ changed by cargo-mutants ~ */ RABITQ_NORM_LEN].copy_from_slice(&residual_mag.to_le_bytes());
         out[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
             .copy_from_slice(&o_dot.to_le_bytes());
         out[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
             .copy_from_slice(&center_dot.to_le_bytes());
         out.into_boxed_slice()
     }
 
     /// Prepare a query-side scorer for the centered path. The

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17419357) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:609:72:
copy_from_slice: source slice length (4) does not match destination slice length (3)

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17419358) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:609:72:
copy_from_slice: source slice length (4) does not match destination slice length (3)

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17419359) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:609:12:
range end index 128 out of range for slice of length 44

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 444 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.88s

*** result: Failure(101)
