*** hardening/careful/src/../../../src/quant/rabitq.rs:63:76: replace + with -

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with -
@@ -55,17 +55,17 @@
 /// `⟨o_unit, sign(o)/√D⟩` at `bits_per_dim = 1`.
 pub const RABITQ_UNIT_DOT_LEN: usize = 4;
 /// Bytes per vector holding `||x_dec||` — the L2 norm of the
 /// dequantized level vector. At `bits_per_dim = 1` this is always
 /// `√D`; storing it uniformly keeps the layout bits-agnostic and
 /// lets the estimator reuse one formula across `q`.
 pub const RABITQ_XNORM_LEN: usize = 4;
 /// Total scalar tail on each code: `||o||` + `o_dot` + `||x_dec||`.
-pub const RABITQ_SCALAR_LEN: usize = RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN + RABITQ_XNORM_LEN;
+pub const RABITQ_SCALAR_LEN: usize = RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN - /* ~ changed by cargo-mutants ~ */ RABITQ_XNORM_LEN;
 
 /// Valid settings for `bits_per_dim`. Restricted to byte-aligned
 /// values so bit packing stays a small-integer lookup; q=3/5/6/7
 /// are a follow-up slice (arbitrary bit-level packing, same
 /// scalar tail).
 pub const RABITQ_SUPPORTED_BITS: [u8; 4] = [1, 2, 4, 8];
 
 /// Clip radius used when scalar-quantizing at `bits_per_dim > 1`.

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17316596) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:610:12:
range end index 9 out of range for slice of length 5

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17316597) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:610:12:
range end index 9 out of range for slice of length 5

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17316598) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:610:12:
range end index 40 out of range for slice of length 36

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::encode_then_score_same_vector_is_nonnegative
    quant::rabitq::tests::estimate_ip_guards_and_bou

test result: FAILED. 434 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.66s

*** result: Failure(101)
