*** hardening/careful/src/../../../src/quant/rabitq.rs:648:9: replace RaBitQQuantizer::centered_residual_magnitude -> f32 with -1.0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace RaBitQQuantizer::centered_residual_magnitude -> f32 with -1.0
@@ -640,22 +640,17 @@
     }
 
     /// Read `||v − center||` from a centered code produced by
     /// [`Self::encode_code_centered`]. Exposed so the AM can
     /// combine the stored residual magnitude with the per-visit
     /// query-residual magnitude via paper eq. (2) without re-
     /// parsing the code.
     pub fn centered_residual_magnitude(&self, code: &[u8]) -> f32 {
-        let s = self.packed_bytes();
-        f32::from_le_bytes(
-            code[s..s + RABITQ_NORM_LEN]
-                .try_into()
-                .expect("residual_mag slice is always 4 bytes"),
-        )
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Per-vertex precomputed state for Symphony's centered RaBitQ
 /// path. Built once per vertex at index-build time via
 /// [`RaBitQQuantizer::prepare_center`]; consumed by
 /// [`RaBitQQuantizer::encode_code_centered`] (to encode each of
 /// that vertex's neighbors) and by

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17434519) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1684:9:
assertion failed: (stored_mag - expected_mag).abs() < 1e-3

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.97s

*** result: Failure(101)
