*** hardening/careful/src/../../../src/quant/rabitq.rs:650:23: replace + with * in RaBitQQuantizer::centered_residual_magnitude

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with * in RaBitQQuantizer::centered_residual_magnitude
@@ -642,17 +642,17 @@
     /// Read `||v − center||` from a centered code produced by
     /// [`Self::encode_code_centered`]. Exposed so the AM can
     /// combine the stored residual magnitude with the per-visit
     /// query-residual magnitude via paper eq. (2) without re-
     /// parsing the code.
     pub fn centered_residual_magnitude(&self, code: &[u8]) -> f32 {
         let s = self.packed_bytes();
         f32::from_le_bytes(
-            code[s..s + RABITQ_NORM_LEN]
+            code[s..s * /* ~ changed by cargo-mutants ~ */ RABITQ_NORM_LEN]
                 .try_into()
                 .expect("residual_mag slice is always 4 bytes"),
         )
     }
 }
 
 /// Per-vertex precomputed state for Symphony's centered RaBitQ
 /// path. Built once per vertex at index-build time via

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17435765) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:650:17:
range end index 32 out of range for slice of length 20

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.03s

*** result: Failure(101)
