*** hardening/careful/src/../../../src/quant/rabitq.rs:676:9: replace CenterContext::raw -> &[f32] with Vec::leak(vec![-1.0])

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace CenterContext::raw -> &[f32] with Vec::leak(vec![-1.0])
@@ -668,17 +668,17 @@
 pub struct CenterContext {
     rotated: Vec<f32>,
     raw: Vec<f32>,
 }
 
 impl CenterContext {
     /// The raw center vector.
     pub fn raw(&self) -> &[f32] {
-        &self.raw
+        Vec::leak(vec![-1.0]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Prepared query state for the centered path. Holds the rotated
 /// and raw query; `score_at` combines these with a per-vertex
 /// [`CenterContext`] via paper equation (6) to estimate the
 /// unit-residual inner product.
 pub struct CenteredScorer {

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17439749) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1703:9:
assertion `left == right` failed
  left: [-1.0]
 right: [-0.5, -0.25, 0.0, 0.25, 0.5, 0.75, 1.0, 1.25]

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.81s

*** result: Failure(101)
