*** hardening/careful/src/../../../src/quant/rabitq.rs:719:20: replace + with - in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with - in CenteredScorer::score_at
@@ -711,17 +711,17 @@
         );
         let s = packed_bytes;
         let residual_mag = f32::from_le_bytes(
             code[s..s + RABITQ_NORM_LEN]
                 .try_into()
                 .expect("residual_mag slice is always 4 bytes"),
         );
         let o_dot = f32::from_le_bytes(
-            code[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
+            code[s - /* ~ changed by cargo-mutants ~ */ RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
                 .try_into()
                 .expect("o_dot slice is always 4 bytes"),
         );
         let center_dot = f32::from_le_bytes(
             code[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
                 .try_into()
                 .expect("center_dot slice is always 4 bytes"),
         );

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17443261) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:719:18:
attempt to subtract with overflow

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17443263) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:721:18:
o_dot slice is always 4 bytes: TryFromSliceError(())

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17443264) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:721:18:
o_dot slice is always 4 bytes: TryFromSliceError(())

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.98s

*** result: Failure(101)
