*** hardening/careful/src/../../../src/quant/rabitq.rs:724:20: replace + with * in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace + with * in CenteredScorer::score_at
@@ -716,17 +716,17 @@
                 .expect("residual_mag slice is always 4 bytes"),
         );
         let o_dot = f32::from_le_bytes(
             code[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]
                 .try_into()
                 .expect("o_dot slice is always 4 bytes"),
         );
         let center_dot = f32::from_le_bytes(
-            code[s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
+            code[s * /* ~ changed by cargo-mutants ~ */ RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN..s + RABITQ_SCALAR_LEN]
                 .try_into()
                 .expect("center_dot slice is always 4 bytes"),
         );
 
         // ⟨x̄, q_tilde⟩ = (1/√D) · Σ q_tilde_i · sign(r_i). The
         // per-neighbor hot loop in Stage 3 will replace this with
         // FastScan / signed POPCNT kernels; scalar form here is
         // the correctness reference.

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17451702) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:726:18:
center_dot slice is always 4 bytes: TryFromSliceError(())

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17451704) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:724:17:
range start index 132 out of range for slice of length 44

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17451705) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:724:17:
range start index 36 out of range for slice of length 20

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.79s

*** result: Failure(101)
