*** hardening/careful/src/../../../src/quant/rabitq.rs:736:35: replace % with + in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace % with + in CenteredScorer::score_at
@@ -728,17 +728,17 @@
 
         // ⟨x̄, q_tilde⟩ = (1/√D) · Σ q_tilde_i · sign(r_i). The
         // per-neighbor hot loop in Stage 3 will replace this with
         // FastScan / signed POPCNT kernels; scalar form here is
         // the correctness reference.
         let mut sum_q_sign = 0.0_f32;
         for i in 0..self.dimensions {
             let byte = code[i / 8];
-            let bit = (byte >> (i % 8)) & 1;
+            let bit = (byte >> (i + /* ~ changed by cargo-mutants ~ */ 8)) & 1;
             if bit == 1 {
                 sum_q_sign += self.query_rotated[i];
             } else {
                 sum_q_sign -= self.query_rotated[i];
             }
         }
         let sqrt_d = (self.dimensions as f32).sqrt();
         let query_dot_code = sum_q_sign / sqrt_d;

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17461519) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:736:23:
attempt to shift right with overflow

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17461521) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:736:23:
attempt to shift right with overflow

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17461522) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:736:23:
attempt to shift right with overflow

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.88s

*** result: Failure(101)
