*** hardening/careful/src/../../../src/quant/rabitq.rs:738:28: replace += with -= in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with -= in CenteredScorer::score_at
@@ -730,17 +730,17 @@
         // per-neighbor hot loop in Stage 3 will replace this with
         // FastScan / signed POPCNT kernels; scalar form here is
         // the correctness reference.
         let mut sum_q_sign = 0.0_f32;
         for i in 0..self.dimensions {
             let byte = code[i / 8];
             let bit = (byte >> (i % 8)) & 1;
             if bit == 1 {
-                sum_q_sign += self.query_rotated[i];
+                sum_q_sign -= /* ~ changed by cargo-mutants ~ */ self.query_rotated[i];
             } else {
                 sum_q_sign -= self.query_rotated[i];
             }
         }
         let sqrt_d = (self.dimensions as f32).sqrt();
         let query_dot_code = sum_q_sign / sqrt_d;
 
         // ||q_r − c||. Rotation preserves L2 so we can use either

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17463179) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got -0.96875

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17463181) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

---- quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula stdout ----

thread 'quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula' (17463182) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1898:9:
assertion failed: (est.estimate - expected_estimate).abs() < 1e-6

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.82s

*** result: Failure(101)
