*** hardening/careful/src/../../../src/quant/rabitq.rs:744:41: replace / with * in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in CenteredScorer::score_at
@@ -736,17 +736,17 @@
             let bit = (byte >> (i % 8)) & 1;
             if bit == 1 {
                 sum_q_sign += self.query_rotated[i];
             } else {
                 sum_q_sign -= self.query_rotated[i];
             }
         }
         let sqrt_d = (self.dimensions as f32).sqrt();
-        let query_dot_code = sum_q_sign / sqrt_d;
+        let query_dot_code = sum_q_sign * /* ~ changed by cargo-mutants ~ */ sqrt_d;
 
         // ||q_r − c||. Rotation preserves L2 so we can use either
         // raw or rotated vectors; rotated keeps everything in one
         // frame, raw saves a rotation. Use raw.
         let mut query_residual_sq = 0.0_f32;
         for i in 0..self.dimensions {
             let d = self.query_raw[i] - center.raw[i];
             query_residual_sq += d * d;

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17467592) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=1.1223028 bound=0.12674442

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17467593) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 73.84375

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17467595) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
