*** hardening/careful/src/../../../src/quant/rabitq.rs:752:31: replace += with *= in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with *= in CenteredScorer::score_at
@@ -744,17 +744,17 @@
         let query_dot_code = sum_q_sign / sqrt_d;
 
         // ||q_r − c||. Rotation preserves L2 so we can use either
         // raw or rotated vectors; rotated keeps everything in one
         // frame, raw saves a rotation. Use raw.
         let mut query_residual_sq = 0.0_f32;
         for i in 0..self.dimensions {
             let d = self.query_raw[i] - center.raw[i];
-            query_residual_sq += d * d;
+            query_residual_sq *= /* ~ changed by cargo-mutants ~ */ d * d;
         }
         let query_residual_mag = query_residual_sq.sqrt();
 
         // Paper eq (6):
         //   ⟨x̄, q_tilde_unit⟩ = (query_dot_code − center_dot) / ||q_r − c||
         //
         // RaBitQ estimator (residual unit vectors):
         //   ⟨q_unit_res, o_unit_res⟩ ≈ ⟨x̄, q_tilde_unit⟩ / o_dot

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17471565) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17471566) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1794:9:
assertion failed: at_o_dot.bound.is_finite()

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17471567) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1850:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.81s

*** result: Failure(101)
