*** hardening/careful/src/../../../src/quant/rabitq.rs:752:36: replace * with / in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in CenteredScorer::score_at
@@ -744,17 +744,17 @@
         let query_dot_code = sum_q_sign / sqrt_d;
 
         // ||q_r − c||. Rotation preserves L2 so we can use either
         // raw or rotated vectors; rotated keeps everything in one
         // frame, raw saves a rotation. Use raw.
         let mut query_residual_sq = 0.0_f32;
         for i in 0..self.dimensions {
             let d = self.query_raw[i] - center.raw[i];
-            query_residual_sq += d * d;
+            query_residual_sq += d / /* ~ changed by cargo-mutants ~ */ d;
         }
         let query_residual_mag = query_residual_sq.sqrt();
 
         // Paper eq (6):
         //   ⟨x̄, q_tilde_unit⟩ = (query_dot_code − center_dot) / ||q_r − c||
         //
         // RaBitQ estimator (residual unit vectors):
         //   ⟨q_unit_res, o_unit_res⟩ ≈ ⟨x̄, q_tilde_unit⟩ / o_dot

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17474587) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1734:9:
assertion failed: est.estimate.is_finite()

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17474589) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.15397567 bound=0.12674442

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17474591) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1793:9:
assertion failed: at_o_dot.estimate.is_finite()

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
