*** hardening/careful/src/../../../src/quant/rabitq.rs:763:24: replace < with == in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace < with == in CenteredScorer::score_at
@@ -755,17 +755,17 @@
 
         // Paper eq (6):
         //   ⟨x̄, q_tilde_unit⟩ = (query_dot_code − center_dot) / ||q_r − c||
         //
         // RaBitQ estimator (residual unit vectors):
         //   ⟨q_unit_res, o_unit_res⟩ ≈ ⟨x̄, q_tilde_unit⟩ / o_dot
         const O_DOT_FLOOR: f32 = 1e-6;
         const QR_FLOOR: f32 = 1e-6;
-        if o_dot.abs() < O_DOT_FLOOR
+        if o_dot.abs() == /* ~ changed by cargo-mutants ~ */ O_DOT_FLOOR
             || !o_dot.is_finite()
             || query_residual_mag < QR_FLOOR
             || residual_mag <= 0.0
         {
             return DistanceEstimate {
                 estimate: 0.0,
                 bound: f32::INFINITY,
             };

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17478594) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1712:9:
assertion `left == right` failed
  left: inf
 right: 0.0

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17478598) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1786:9:
assertion `left == right` failed
  left: 1000000.0
 right: 0.0

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.87s

*** result: Failure(101)
