*** hardening/careful/src/../../../src/quant/rabitq.rs:764:16: delete ! in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ delete ! in CenteredScorer::score_at
@@ -756,17 +756,17 @@
         // Paper eq (6):
         //   ⟨x̄, q_tilde_unit⟩ = (query_dot_code − center_dot) / ||q_r − c||
         //
         // RaBitQ estimator (residual unit vectors):
         //   ⟨q_unit_res, o_unit_res⟩ ≈ ⟨x̄, q_tilde_unit⟩ / o_dot
         const O_DOT_FLOOR: f32 = 1e-6;
         const QR_FLOOR: f32 = 1e-6;
         if o_dot.abs() < O_DOT_FLOOR
-            || !o_dot.is_finite()
+            ||  /* ~ changed by cargo-mutants ~ */o_dot.is_finite()
             || query_residual_mag < QR_FLOOR
             || residual_mag <= 0.0
         {
             return DistanceEstimate {
                 estimate: 0.0,
                 bound: f32::INFINITY,
             };
         }

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17480920) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1718:9:
assertion `left == right` failed
  left: NaN
 right: 0.0

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17480923) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17480924) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1794:9:
assertion failed: at_o_dot.bound.is_finite()

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.07s

*** result: Failure(101)
