*** hardening/careful/src/../../../src/quant/rabitq.rs:766:13: replace || with && in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace || with && in CenteredScorer::score_at
@@ -758,17 +758,17 @@
         //
         // RaBitQ estimator (residual unit vectors):
         //   ⟨q_unit_res, o_unit_res⟩ ≈ ⟨x̄, q_tilde_unit⟩ / o_dot
         const O_DOT_FLOOR: f32 = 1e-6;
         const QR_FLOOR: f32 = 1e-6;
         if o_dot.abs() < O_DOT_FLOOR
             || !o_dot.is_finite()
             || query_residual_mag < QR_FLOOR
-            || residual_mag <= 0.0
+            && /* ~ changed by cargo-mutants ~ */ residual_mag <= 0.0
         {
             return DistanceEstimate {
                 estimate: 0.0,
                 bound: f32::INFINITY,
             };
         }
         let x_dot_q_unit = (query_dot_code - center_dot) / query_residual_mag;
         let estimate = x_dot_q_unit / o_dot;

---- quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths stdout ----

thread 'quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths' (17475085) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1723:9:
assertion `left == right` failed
  left: 0.9999999
 right: 0.0

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17475089) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1803:9:
assertion `left == right` failed
  left: 250000.0
 right: 0.0

failures:
    quant::rabitq::tests::centered_context_and_scorer_cover_raw_and_degenerate_paths
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.82s

*** result: Failure(101)
