*** hardening/careful/src/../../../src/quant/rabitq.rs:773:44: replace - with / in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with / in CenteredScorer::score_at
@@ -765,17 +765,17 @@
             || query_residual_mag < QR_FLOOR
             || residual_mag <= 0.0
         {
             return DistanceEstimate {
                 estimate: 0.0,
                 bound: f32::INFINITY,
             };
         }
-        let x_dot_q_unit = (query_dot_code - center_dot) / query_residual_mag;
+        let x_dot_q_unit = (query_dot_code / /* ~ changed by cargo-mutants ~ */ center_dot) / query_residual_mag;
         let estimate = x_dot_q_unit / o_dot;
 
         // ε-concentration bound in the unit-residual frame; both
         // residuals are unit vectors so the ||·|| factors from the
         // absolute path collapse to 1.
         let o_dot_sq = o_dot * o_dot;
         let epsilon_sq = ((1.0 - o_dot_sq).max(0.0)) / (self.dimensions as f32 * o_dot_sq);
         let bound = RABITQ_BOUND_CONFIDENCE * epsilon_sq.sqrt();

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17488680) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0.925

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17488679) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.54816467 bound=0.12674442

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17488681) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1793:9:
assertion failed: at_o_dot.estimate.is_finite()

failures:
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.98s

*** result: Failure(101)
