*** hardening/careful/src/../../../src/quant/rabitq.rs:774:37: replace / with * in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in CenteredScorer::score_at
@@ -766,17 +766,17 @@
             || residual_mag <= 0.0
         {
             return DistanceEstimate {
                 estimate: 0.0,
                 bound: f32::INFINITY,
             };
         }
         let x_dot_q_unit = (query_dot_code - center_dot) / query_residual_mag;
-        let estimate = x_dot_q_unit / o_dot;
+        let estimate = x_dot_q_unit * /* ~ changed by cargo-mutants ~ */ o_dot;
 
         // ε-concentration bound in the unit-residual frame; both
         // residuals are unit vectors so the ||·|| factors from the
         // absolute path collapse to 1.
         let o_dot_sq = o_dot * o_dot;
         let epsilon_sq = ((1.0 - o_dot_sq).max(0.0)) / (self.dimensions as f32 * o_dot_sq);
         let bound = RABITQ_BOUND_CONFIDENCE * epsilon_sq.sqrt();

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17490949) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.25429678 bound=0.12674442

---- quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula stdout ----

thread 'quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula' (17490953) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1898:9:
assertion failed: (est.estimate - expected_estimate).abs() < 1e-6

failures:
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.85s

*** result: Failure(101)
