*** hardening/careful/src/../../../src/quant/rabitq.rs:780:32: replace - with / in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with / in CenteredScorer::score_at
@@ -772,17 +772,17 @@
         }
         let x_dot_q_unit = (query_dot_code - center_dot) / query_residual_mag;
         let estimate = x_dot_q_unit / o_dot;
 
         // ε-concentration bound in the unit-residual frame; both
         // residuals are unit vectors so the ||·|| factors from the
         // absolute path collapse to 1.
         let o_dot_sq = o_dot * o_dot;
-        let epsilon_sq = ((1.0 - o_dot_sq).max(0.0)) / (self.dimensions as f32 * o_dot_sq);
+        let epsilon_sq = ((1.0 / /* ~ changed by cargo-mutants ~ */ o_dot_sq).max(0.0)) / (self.dimensions as f32 * o_dot_sq);
         let bound = RABITQ_BOUND_CONFIDENCE * epsilon_sq.sqrt();
 
         // Silence unused warnings on state kept for AM tooling.
         let _ = residual_mag;
 
         DistanceEstimate { estimate, bound }
     }
 }

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17496589) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1680:9:
bound collapses on sign-aligned residual, got 0.3125

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17496591) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1853:9:
assertion failed: est.bound < 1e-4

---- quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula stdout ----

thread 'quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula' (17496592) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1899:9:
assertion failed: (est.bound - expected_bound).abs() < 1e-6

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.09s

*** result: Failure(101)
