*** hardening/careful/src/../../../src/quant/rabitq.rs:804:9: replace PreparedEstimator::dimensions -> usize with 0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace PreparedEstimator::dimensions -> usize with 0
@@ -796,17 +796,17 @@
     query_rotated: Vec<f32>,
     query_norm: f32,
     dimensions: usize,
     bits_per_dim: u8,
 }
 
 impl PreparedEstimator {
     pub fn dimensions(&self) -> usize {
-        self.dimensions
+        0 /* ~ changed by cargo-mutants ~ */
     }
     pub fn query_norm(&self) -> f32 {
         self.query_norm
     }
     pub fn bits_per_dim(&self) -> u8 {
         self.bits_per_dim
     }
     pub fn estimate_ip(&self, code: &[u8]) -> DistanceEstimate {

---- quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable stdout ----

thread 'quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable' (17502083) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1245:9:
assertion `left == right` failed
  left: 0
 right: 17

failures:
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.97s

*** result: Failure(101)
