*** hardening/careful/src/../../../src/quant/rabitq.rs:807:9: replace PreparedEstimator::query_norm -> f32 with -1.0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace PreparedEstimator::query_norm -> f32 with -1.0
@@ -799,17 +799,17 @@
     bits_per_dim: u8,
 }
 
 impl PreparedEstimator {
     pub fn dimensions(&self) -> usize {
         self.dimensions
     }
     pub fn query_norm(&self) -> f32 {
-        self.query_norm
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
     pub fn bits_per_dim(&self) -> u8 {
         self.bits_per_dim
     }
     pub fn estimate_ip(&self, code: &[u8]) -> DistanceEstimate {
         estimate_ip_impl(
             &self.query_rotated,
             self.query_norm,

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17506035) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1337:9:
assertion failed: (estimate.bound - expected_bound).abs() < 1e-6

---- quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable stdout ----

thread 'quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable' (17506046) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1248:9:
assertion failed: (prepared.query_norm() - expected_norm).abs() < 1e-6

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.95s

*** result: Failure(101)
