*** hardening/careful/src/../../../src/quant/rabitq.rs:810:9: replace PreparedEstimator::bits_per_dim -> u8 with 0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace PreparedEstimator::bits_per_dim -> u8 with 0
@@ -802,17 +802,17 @@
 impl PreparedEstimator {
     pub fn dimensions(&self) -> usize {
         self.dimensions
     }
     pub fn query_norm(&self) -> f32 {
         self.query_norm
     }
     pub fn bits_per_dim(&self) -> u8 {
-        self.bits_per_dim
+        0 /* ~ changed by cargo-mutants ~ */
     }
     pub fn estimate_ip(&self, code: &[u8]) -> DistanceEstimate {
         estimate_ip_impl(
             &self.query_rotated,
             self.query_norm,
             self.dimensions,
             self.bits_per_dim,
             code,

---- quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable stdout ----

thread 'quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable' (17506790) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1246:9:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
