*** hardening/careful/src/../../../src/quant/rabitq.rs:835:9: replace <impl crate::quant::QueryScorer for RaBitQScorer>::score -> f32 with 0.0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace <impl crate::quant::QueryScorer for RaBitQScorer>::score -> f32 with 0.0
@@ -827,24 +827,17 @@
     query_rotated: Vec<f32>,
     query_norm: f32,
     dimensions: usize,
     bits_per_dim: u8,
 }
 
 impl crate::quant::QueryScorer for RaBitQScorer {
     fn score(&self, code: &[u8]) -> f32 {
-        estimate_ip_impl(
-            &self.query_rotated,
-            self.query_norm,
-            self.dimensions,
-            self.bits_per_dim,
-            code,
-        )
-        .estimate
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Unbiased distance estimate with a symmetric error bound
 /// (`estimate ± bound`). `estimate` is the inner product ⟨q, c⟩
 /// recovered from the asymmetric RaBitQ estimator; `bound` is the
 /// Cauchy-Schwarz envelope `||q|| * ||c - α_c·sign(c)||`. Stage 3
 /// (task 27) sizes its candidate pool from the empirical

---- quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair stdout ----

thread 'quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair' (17509069) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1255:9:
assertion failed: (score - expected).abs() < 1e-6

failures:
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.25s

*** result: Failure(101)
