*** hardening/careful/src/../../../src/quant/rabitq.rs:866:5: replace sign_words_from_rotated -> Vec<u64> with vec![0]

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace sign_words_from_rotated -> Vec<u64> with vec![0]
@@ -858,23 +858,17 @@
 // ---------------------------------------------------------------------------
 // Primitives — moved from `src/quant/prod.rs` in slice 2.
 // ---------------------------------------------------------------------------
 
 /// Pack sign bits of a rotated f32 vector into 64-bit words.
 /// Word layout: bit `index % 64` of word `index / 64` carries the
 /// sign of coordinate `index`.
 pub(crate) fn sign_words_from_rotated(rotated: &[f32]) -> Vec<u64> {
-    let mut words = vec![0_u64; rotated.len().div_ceil(64)];
-    for (index, value) in rotated.iter().copied().enumerate() {
-        if value >= 0.0 {
-            words[index / 64] |= 1_u64 << (index % 64);
-        }
-    }
-    words
+    vec![0] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Derive sign words from a 4-bit packed MSE code by looking up the
 /// sign of each codebook entry. `sign_lookup[i] != 0` means codebook
 /// entry `i` is non-negative (bit set). Word layout matches
 /// [`sign_words_from_rotated`].
 pub(crate) fn sign_words_from_packed_4bit(
     code_bytes: &[u8],

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17512941) panicked at hardening/careful/src/../../../src/quant/prod.rs:2121:9:
assertion `left == right` failed: binary sign scorer should rank the identical vector first
  left: 14
 right: 0

---- quant::prod::tests::quantizer_1536_4bit_supports_binary_sign_query_prep stdout ----

thread 'quant::prod::tests::quantizer_1536_4bit_supports_binary_sign_query_prep' (17512989) panicked at hardening/careful/src/../../../src/quant/prod.rs:1979:9:
assertion `left == right` failed
  left: 1
 right: 24

---- quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack stdout ----

thread 'quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack' (17513051) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2089:9:
assertion `left == right` failed
  left: [0]
 right: [90]

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::prod::tests::quantizer_1536_4bit_supports_binary_sign_query_prep
    quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.24s

*** result: Failure(101)
