*** hardening/careful/src/../../../src/quant/rabitq.rs:868:18: replace >= with < in sign_words_from_rotated

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace >= with < in sign_words_from_rotated
@@ -860,17 +860,17 @@
 // ---------------------------------------------------------------------------
 
 /// Pack sign bits of a rotated f32 vector into 64-bit words.
 /// Word layout: bit `index % 64` of word `index / 64` carries the
 /// sign of coordinate `index`.
 pub(crate) fn sign_words_from_rotated(rotated: &[f32]) -> Vec<u64> {
     let mut words = vec![0_u64; rotated.len().div_ceil(64)];
     for (index, value) in rotated.iter().copied().enumerate() {
-        if value >= 0.0 {
+        if value < /* ~ changed by cargo-mutants ~ */ 0.0 {
             words[index / 64] |= 1_u64 << (index % 64);
         }
     }
     words
 }
 
 /// Derive sign words from a 4-bit packed MSE code by looking up the
 /// sign of each codebook entry. `sign_lookup[i] != 0` means codebook

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17514717) panicked at hardening/careful/src/../../../src/quant/prod.rs:2121:9:
assertion `left == right` failed: binary sign scorer should rank the identical vector first
  left: 1
 right: 0

---- quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack stdout ----

thread 'quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack' (17514785) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2095:9:
assertion `left == right` failed
  left: [165]
 right: [90]

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.86s

*** result: Failure(101)
