*** hardening/careful/src/../../../src/quant/rabitq.rs:869:50: replace % with + in sign_words_from_rotated

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace % with + in sign_words_from_rotated
@@ -861,17 +861,17 @@
 
 /// Pack sign bits of a rotated f32 vector into 64-bit words.
 /// Word layout: bit `index % 64` of word `index / 64` carries the
 /// sign of coordinate `index`.
 pub(crate) fn sign_words_from_rotated(rotated: &[f32]) -> Vec<u64> {
     let mut words = vec![0_u64; rotated.len().div_ceil(64)];
     for (index, value) in rotated.iter().copied().enumerate() {
         if value >= 0.0 {
-            words[index / 64] |= 1_u64 << (index % 64);
+            words[index / 64] |= 1_u64 << (index + /* ~ changed by cargo-mutants ~ */ 64);
         }
     }
     words
 }
 
 /// Derive sign words from a 4-bit packed MSE code by looking up the
 /// sign of each codebook entry. `sign_lookup[i] != 0` means codebook
 /// entry `i` is non-negative (bit set). Word layout matches

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17520911) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:869:34:
attempt to shift left with overflow

---- quant::prod::tests::quantizer_1536_4bit_supports_binary_sign_query_prep stdout ----

thread 'quant::prod::tests::quantizer_1536_4bit_supports_binary_sign_query_prep' (17520940) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:869:34:
attempt to shift left with overflow

---- quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack stdout ----

thread 'quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack' (17520995) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:869:34:
attempt to shift left with overflow

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::prod::tests::quantizer_1536_4bit_supports_binary_sign_query_prep
    quant::rabitq::tests::sign_words_from_rotated_matches_manual_pack

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.20s

*** result: Failure(101)
