*** hardening/careful/src/../../../src/quant/rabitq.rs:892:34: replace & with | in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace & with | in sign_words_from_packed_4bit
@@ -884,17 +884,17 @@
     let mut words = vec![0_u64; dim.div_ceil(64)];
     let mut dim_index = 0usize;
 
     for &packed in code_bytes {
         if dim_index >= dim {
             break;
         }
 
-        let low_nibble = (packed & 0x0F) as usize;
+        let low_nibble = (packed | /* ~ changed by cargo-mutants ~ */ 0x0F) as usize;
         if sign_lookup[low_nibble] != 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);
         }
         dim_index += 1;
 
         if dim_index >= dim {
             break;
         }

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17525937) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:893:12:
index out of bounds: the len is 16 but the index is 143

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17526023) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:893:12:
index out of bounds: the len is 16 but the index is 143

---- quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes stdout ----

thread 'quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes' (17526015) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:893:12:
index out of bounds: the len is 16 but the index is 255

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.04s

*** result: Failure(101)
