*** hardening/careful/src/../../../src/quant/rabitq.rs:893:36: replace != with == in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace != with == in sign_words_from_packed_4bit
@@ -885,17 +885,17 @@
     let mut dim_index = 0usize;
 
     for &packed in code_bytes {
         if dim_index >= dim {
             break;
         }
 
         let low_nibble = (packed & 0x0F) as usize;
-        if sign_lookup[low_nibble] != 0 {
+        if sign_lookup[low_nibble] == /* ~ changed by cargo-mutants ~ */ 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);
         }
         dim_index += 1;
 
         if dim_index >= dim {
             break;
         }

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17527175) panicked at hardening/careful/src/../../../src/quant/prod.rs:2121:9:
assertion `left == right` failed: binary sign scorer should rank the identical vector first
  left: 11
 right: 0

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17527242) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1471:9:
assertion `left == right` failed
  left: [10120587215537146995, 51]
 right: [15647432716220553510, 38]

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.85s

*** result: Failure(101)
