*** hardening/careful/src/../../../src/quant/rabitq.rs:896:19: replace += with *= in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with *= in sign_words_from_packed_4bit
@@ -888,17 +888,17 @@
         if dim_index >= dim {
             break;
         }
 
         let low_nibble = (packed & 0x0F) as usize;
         if sign_lookup[low_nibble] != 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);
         }
-        dim_index += 1;
+        dim_index *= /* ~ changed by cargo-mutants ~ */ 1;
 
         if dim_index >= dim {
             break;
         }
 
         let high_nibble = (packed >> 4) as usize;
         if sign_lookup[high_nibble] != 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17535100) panicked at hardening/careful/src/../../../src/quant/prod.rs:2121:9:
assertion `left == right` failed: binary sign scorer should rank the identical vector first
  left: 4
 right: 0

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17535167) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1471:9:
assertion `left == right` failed
  left: [34224994295, 0]
 right: [15647432716220553510, 38]

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.79s

*** result: Failure(101)
