*** hardening/careful/src/../../../src/quant/rabitq.rs:898:22: replace >= with < in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace >= with < in sign_words_from_packed_4bit
@@ -890,17 +890,17 @@
         }
 
         let low_nibble = (packed & 0x0F) as usize;
         if sign_lookup[low_nibble] != 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);
         }
         dim_index += 1;
 
-        if dim_index >= dim {
+        if dim_index < /* ~ changed by cargo-mutants ~ */ dim {
             break;
         }
 
         let high_nibble = (packed >> 4) as usize;
         if sign_lookup[high_nibble] != 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);
         }
         dim_index += 1;

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17536581) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1471:9:
assertion `left == right` failed
  left: [0, 0]
 right: [15647432716220553510, 38]

failures:
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.23s

*** result: Failure(101)
