*** hardening/careful/src/../../../src/quant/rabitq.rs:904:29: replace / with * in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace / with * in sign_words_from_packed_4bit
@@ -896,17 +896,17 @@
         dim_index += 1;
 
         if dim_index >= dim {
             break;
         }
 
         let high_nibble = (packed >> 4) as usize;
         if sign_lookup[high_nibble] != 0 {
-            words[dim_index / 64] |= 1_u64 << (dim_index % 64);
+            words[dim_index * /* ~ changed by cargo-mutants ~ */ 64] |= 1_u64 << (dim_index % 64);
         }
         dim_index += 1;
     }
 
     words
 }
 
 /// Hamming-based similarity used by the ADR-031 prefilter:

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17542095) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:904:18:
index out of bounds: the len is 24 but the index is 64

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17542182) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:904:18:
index out of bounds: the len is 2 but the index is 64

---- quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes stdout ----

thread 'quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes' (17542174) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:904:18:
index out of bounds: the len is 24 but the index is 192

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 448 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.95s

*** result: Failure(101)
