*** hardening/careful/src/../../../src/quant/rabitq.rs:904:35: replace |= with &= in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace |= with &= in sign_words_from_packed_4bit
@@ -896,17 +896,17 @@
         dim_index += 1;
 
         if dim_index >= dim {
             break;
         }
 
         let high_nibble = (packed >> 4) as usize;
         if sign_lookup[high_nibble] != 0 {
-            words[dim_index / 64] |= 1_u64 << (dim_index % 64);
+            words[dim_index / 64] &= /* ~ changed by cargo-mutants ~ */ 1_u64 << (dim_index % 64);
         }
         dim_index += 1;
     }
 
     words
 }
 
 /// Hamming-based similarity used by the ADR-031 prefilter:

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17539138) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1471:9:
assertion `left == right` failed
  left: [0, 0]
 right: [15647432716220553510, 38]

failures:
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
