*** hardening/careful/src/../../../src/quant/rabitq.rs:906:19: replace += with -= in sign_words_from_packed_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with -= in sign_words_from_packed_4bit
@@ -898,17 +898,17 @@
         if dim_index >= dim {
             break;
         }
 
         let high_nibble = (packed >> 4) as usize;
         if sign_lookup[high_nibble] != 0 {
             words[dim_index / 64] |= 1_u64 << (dim_index % 64);
         }
-        dim_index += 1;
+        dim_index -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     words
 }
 
 /// Hamming-based similarity used by the ADR-031 prefilter:
 /// `dim - 2 * hamming(q, c)` so higher = closer.
 pub(crate) fn hamming_similarity(query_words: &[u64], candidate_words: &[u64], dim: usize) -> f32 {

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17545946) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1471:9:
assertion `left == right` failed
  left: [3, 0]
 right: [15647432716220553510, 38]

failures:
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.43s

*** result: Failure(101)
