*** hardening/careful/src/../../../src/quant/rabitq.rs:918:42: replace ^ with | in hamming_similarity

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace ^ with | in hamming_similarity
@@ -910,17 +910,17 @@
 }
 
 /// Hamming-based similarity used by the ADR-031 prefilter:
 /// `dim - 2 * hamming(q, c)` so higher = closer.
 pub(crate) fn hamming_similarity(query_words: &[u64], candidate_words: &[u64], dim: usize) -> f32 {
     let hamming_distance = query_words
         .iter()
         .zip(candidate_words.iter())
-        .map(|(query, candidate)| (query ^ candidate).count_ones())
+        .map(|(query, candidate)| (query | /* ~ changed by cargo-mutants ~ */ candidate).count_ones())
         .sum::<u32>();
     let dim_i32 = i32::try_from(dim).expect("dimensions should fit in i32");
     let distance_i32 = i32::try_from(hamming_distance).expect("hamming distance should fit in i32");
     (dim_i32 - (2 * distance_i32)) as f32
 }
 
 /// Sign lookup for a 4-bit, 16-entry MSE codebook. Used by
 /// [`sign_words_from_packed_4bit`] to translate a packed code index

---- quant::rabitq::tests::hamming_similarity_identity_equals_dim stdout ----

thread 'quant::rabitq::tests::hamming_similarity_identity_equals_dim' (17549899) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2128:9:
assertion `left == right` failed
  left: 0.0
 right: 128.0

failures:
    quant::rabitq::tests::hamming_similarity_identity_equals_dim

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.50s

*** result: Failure(101)
