*** hardening/careful/src/../../../src/quant/rabitq.rs:922:14: replace - with + in hamming_similarity

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace - with + in hamming_similarity
@@ -914,17 +914,17 @@
 pub(crate) fn hamming_similarity(query_words: &[u64], candidate_words: &[u64], dim: usize) -> f32 {
     let hamming_distance = query_words
         .iter()
         .zip(candidate_words.iter())
         .map(|(query, candidate)| (query ^ candidate).count_ones())
         .sum::<u32>();
     let dim_i32 = i32::try_from(dim).expect("dimensions should fit in i32");
     let distance_i32 = i32::try_from(hamming_distance).expect("hamming distance should fit in i32");
-    (dim_i32 - (2 * distance_i32)) as f32
+    (dim_i32 + /* ~ changed by cargo-mutants ~ */ (2 * distance_i32)) as f32
 }
 
 /// Sign lookup for a 4-bit, 16-entry MSE codebook. Used by
 /// [`sign_words_from_packed_4bit`] to translate a packed code index
 /// into a sign bit.
 pub(crate) fn binary_sign_lookup_4bit(codebook: &[f32]) -> [u8; 16] {
     assert_eq!(
         codebook.len(),

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17553502) panicked at hardening/careful/src/../../../src/quant/prod.rs:2121:9:
assertion `left == right` failed: binary sign scorer should rank the identical vector first
  left: 1
 right: 0

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.32s

*** result: Failure(101)
