*** hardening/careful/src/../../../src/quant/rabitq.rs:936:39: replace >= with < in binary_sign_lookup_4bit

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace >= with < in binary_sign_lookup_4bit
@@ -928,17 +928,17 @@
 pub(crate) fn binary_sign_lookup_4bit(codebook: &[f32]) -> [u8; 16] {
     assert_eq!(
         codebook.len(),
         16,
         "binary sign lookup requires a 16-entry 4-bit codebook"
     );
     let mut signs = [0_u8; 16];
     for (index, value) in codebook.iter().copied().enumerate() {
-        signs[index] = u8::from(value >= 0.0);
+        signs[index] = u8::from(value < /* ~ changed by cargo-mutants ~ */ 0.0);
     }
     signs
 }
 
 // ---------------------------------------------------------------------------
 // Persisted-sidecar helpers — moved from `src/am/common/training.rs`
 // in slice 2. AM callers now reach into this module directly.
 // ---------------------------------------------------------------------------

---- quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first stdout ----

thread 'quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first' (17558689) panicked at hardening/careful/src/../../../src/quant/prod.rs:2121:9:
assertion `left == right` failed: binary sign scorer should rank the identical vector first
  left: 1
 right: 0

---- quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words stdout ----

thread 'quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words' (17558760) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1454:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1]

failures:
    quant::prod::tests::binary_sign_no_qjl_4bit_keeps_identical_vector_ranked_first
    quant::rabitq::tests::sign_sidecar_helpers_pack_exact_words

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.81s

*** result: Failure(101)
