*** hardening/careful/src/../../../src/quant/rabitq.rs:964:5: replace derive_persisted_sidecar_words -> Vec<u64> with vec![]

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace derive_persisted_sidecar_words -> Vec<u64> with vec![]
@@ -956,21 +956,17 @@
 }
 
 /// Derive the sidecar sign words for a single vector from its
 /// already-PQ-packed code. Returns an empty vector when RaBitQ is
 /// not supported for the quantizer's lane. This is the ADR-031
 /// optimization path that reuses the PQ code rather than re-rotating
 /// the raw vector.
 pub fn derive_persisted_sidecar_words(quantizer: &ProdQuantizer, code: &[u8]) -> Vec<u64> {
-    if quantizer.binary_sign_no_qjl_4bit_supported() {
-        quantizer.binary_sign_words_from_packed_no_qjl_4bit(code)
-    } else {
-        Vec::new()
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Internal helpers used only by the Quantizer trait impl above.
 // ---------------------------------------------------------------------------
 
 fn l2_norm(rotated: &[f32]) -> f32 {
     rotated.iter().map(|x| x * x).sum::<f32>().sqrt()

---- quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes stdout ----

thread 'quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes' (17562278) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1486:9:
assertion `left == right` failed
  left: []

failures:
    quant::rabitq::tests::persisted_sidecar_helpers_preserve_supported_and_unsupported_lanes

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.96s

*** result: Failure(101)
