*** hardening/careful/src/../../../src/quant/rabitq.rs:976:30: replace * with + in l2_norm

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with + in l2_norm
@@ -968,17 +968,17 @@
     }
 }
 
 // ---------------------------------------------------------------------------
 // Internal helpers used only by the Quantizer trait impl above.
 // ---------------------------------------------------------------------------
 
 fn l2_norm(rotated: &[f32]) -> f32 {
-    rotated.iter().map(|x| x * x).sum::<f32>().sqrt()
+    rotated.iter().map(|x| x + /* ~ changed by cargo-mutants ~ */ x).sum::<f32>().sqrt()
 }
 
 /// Quantize one unit-vector coordinate `o_hat_i = o_i / ||o||` to
 /// a `bits`-bit signed level. Returns `(level_index, dequant_value)`:
 /// the level index is what gets packed into the code; the dequant
 /// value is the reconstruction used by the encoder to compute
 /// `⟨o, x_dec⟩` and `||x_dec||` in-line.
 ///

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17567273) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1752:9:
assertion failed: (read_tail_f32(&code, packed_bytes, 0) - 2.304886).abs() < 1e-5

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17567274) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.39966822 bound=0

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17567275) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0.7905694

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::quantizer_and_prepared_estimator_ac

test result: FAILED. 439 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.80s

*** result: Failure(101)
