*** hardening/careful/src/../../../src/quant/rabitq.rs:976:5: replace l2_norm -> f32 with 1.0

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace l2_norm -> f32 with 1.0
@@ -968,17 +968,17 @@
     }
 }
 
 // ---------------------------------------------------------------------------
 // Internal helpers used only by the Quantizer trait impl above.
 // ---------------------------------------------------------------------------
 
 fn l2_norm(rotated: &[f32]) -> f32 {
-    rotated.iter().map(|x| x * x).sum::<f32>().sqrt()
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Quantize one unit-vector coordinate `o_hat_i = o_i / ||o||` to
 /// a `bits`-bit signed level. Returns `(level_index, dequant_value)`:
 /// the level index is what gets packed into the code; the dequant
 /// value is the reconstruction used by the encoder to compute
 /// `⟨o, x_dec⟩` and `||x_dec||` in-line.
 ///

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17566000) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1752:9:
assertion failed: (read_tail_f32(&code, packed_bytes, 0) - 2.304886).abs() < 1e-5

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17566001) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1943:13:
centered bound violated for seed=1: err=0.52792823 bound=0

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17566002) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1675:9:
self-centered unit IP should be 1.0, got 0.125

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::quantizer_and_prepared_estimator_accessors_are_stable

test result: FAILED. 440 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.43s

*** result: Failure(101)
