*** hardening/careful/src/../../../src/quant/rabitq.rs:996:13: replace == with != in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace == with != in quantize_level
@@ -988,17 +988,17 @@
 ///
 /// At `bits ≥ 2`: multiply by `sqrt_d` to put the coordinate
 /// distribution on `N(0, 1)` (coord std of a unit vector is
 /// `1/√D`), clip to `[-C, +C]` with `C = RABITQ_QUANT_CLIP`, then
 /// bin uniformly into `2^bits` cells. The level stored is the
 /// unsigned bin index `0..2^bits - 1`; the dequantized value is
 /// the bin center mapped back to the unit-vector scale.
 fn quantize_level(o_hat_i: f32, bits: usize, sqrt_d: f32) -> (u32, f32) {
-    if bits == 1 {
+    if bits != /* ~ changed by cargo-mutants ~ */ 1 {
         if o_hat_i >= 0.0 {
             (1, 1.0)
         } else {
             (0, -1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17575340) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1273:9:
assertion `left == right` failed
  left: [84, 0]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17575341) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1303:9:
assertion `left == right` failed
  left: [85, 1]
 right: [170, 2]

---- quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors' (17575345) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2031:13:
bound violated for seed=1: err=117.77755 bound=31.73119 (estimate=-118.822044, truth=-1.0444978)

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints
    quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.80s

*** result: Failure(101)
