*** hardening/careful/src/../../../src/quant/rabitq.rs:996:5: replace quantize_level -> (u32, f32) with (1, 0.0)

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace quantize_level -> (u32, f32) with (1, 0.0)
@@ -988,33 +988,17 @@
 ///
 /// At `bits ≥ 2`: multiply by `sqrt_d` to put the coordinate
 /// distribution on `N(0, 1)` (coord std of a unit vector is
 /// `1/√D`), clip to `[-C, +C]` with `C = RABITQ_QUANT_CLIP`, then
 /// bin uniformly into `2^bits` cells. The level stored is the
 /// unsigned bin index `0..2^bits - 1`; the dequantized value is
 /// the bin center mapped back to the unit-vector scale.
 fn quantize_level(o_hat_i: f32, bits: usize, sqrt_d: f32) -> (u32, f32) {
-    if bits == 1 {
-        if o_hat_i >= 0.0 {
-            (1, 1.0)
-        } else {
-            (0, -1.0)
-        }
-    } else {
-        let levels = 1_u32 << bits;
-        let c = RABITQ_QUANT_CLIP;
-        let scaled = o_hat_i * sqrt_d;
-        let t = ((scaled + c) / RABITQ_QUANT_RANGE).clamp(0.0, 1.0);
-        let level = ((t * levels as f32) as u32).min(levels - 1);
-        // Bin center, mapped back to unit-vector scale.
-        let center_scaled = (level as f32 + 0.5) / levels as f32 * RABITQ_QUANT_RANGE - c;
-        let dequant = center_scaled / sqrt_d;
-        (level, dequant)
-    }
+    (1, 0.0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Inverse of [`quantize_level`]: given a stored level index and
 /// `bits`, return the dequantized coordinate value.
 fn dequant_level(level: u32, bits: usize, sqrt_d: f32) -> f32 {
     if bits == 1 {
         if level == 1 {
             1.0

---- quant::rabitq::tests::custom_rotation_plugs_into_seam stdout ----

thread 'quant::rabitq::tests::custom_rotation_plugs_into_seam' (17574392) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2106:9:
assertion `left == right` failed
  left: 255
 right: 85

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17574393) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1257:9:
assertion `left == right` failed
  left: [85, 1]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17574394) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1287:9:
assertion `left == right` failed
  left: [85, 1]
 right: [170, 2]

failures:
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints
    quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 441 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.94s

*** result: Failure(101)
