*** hardening/careful/src/../../../src/quant/rabitq.rs:997:20: replace >= with < in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace >= with < in quantize_level
@@ -989,17 +989,17 @@
 /// At `bits ≥ 2`: multiply by `sqrt_d` to put the coordinate
 /// distribution on `N(0, 1)` (coord std of a unit vector is
 /// `1/√D`), clip to `[-C, +C]` with `C = RABITQ_QUANT_CLIP`, then
 /// bin uniformly into `2^bits` cells. The level stored is the
 /// unsigned bin index `0..2^bits - 1`; the dequantized value is
 /// the bin center mapped back to the unit-vector scale.
 fn quantize_level(o_hat_i: f32, bits: usize, sqrt_d: f32) -> (u32, f32) {
     if bits == 1 {
-        if o_hat_i >= 0.0 {
+        if o_hat_i < /* ~ changed by cargo-mutants ~ */ 0.0 {
             (1, 1.0)
         } else {
             (0, -1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let scaled = o_hat_i * sqrt_d;

---- quant::rabitq::tests::custom_rotation_plugs_into_seam stdout ----

thread 'quant::rabitq::tests::custom_rotation_plugs_into_seam' (17577741) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2122:9:
assertion `left == right` failed
  left: 170
 right: 85

---- quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints stdout ----

thread 'quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints' (17577753) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1432:9:
assertion `left == right` failed
  left: (0, -1.0)
 right: (1, 1.0)

failures:
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints

test result: FAILED. 449 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.22s

*** result: Failure(101)
