*** hardening/careful/src/../../../src/quant/rabitq.rs:1140:30: replace < with > in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace < with > in estimate_ip_impl
@@ -1132,17 +1132,17 @@
     for (i, &query_i) in query_rotated.iter().enumerate().take(dimensions) {
         let level = read_level(code, i, bits);
         let dequant = dequant_level(level, bits, sqrt_d);
         sum_q_dequant += query_i * dequant;
     }
 
     // Guard degenerate cases.
     const O_DOT_FLOOR: f32 = 1e-6;
-    if candidate_o_dot.abs() < O_DOT_FLOOR
+    if candidate_o_dot.abs() > /* ~ changed by cargo-mutants ~ */ O_DOT_FLOOR
         || !candidate_o_dot.is_finite()
         || candidate_x_norm <= 0.0
         || !candidate_x_norm.is_finite()
     {
         return DistanceEstimate {
             estimate: 0.0,
             bound: f32::INFINITY,
         };

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17311251) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1336:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17311252) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1375:9:
assertion `left == right` failed
  left: -1983938.6
 right: 0.0

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17311254) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1530:9:
sign-aligned self-IP exact, got estimate=0 truth=32 err=32

failures:
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.54s

*** result: Failure(101)
