*** hardening/careful/src/../../../src/quant/rabitq.rs:1132:30: replace < with == in estimate_ip_impl

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace < with == in estimate_ip_impl
@@ -1124,17 +1124,17 @@
     for (i, &query_i) in query_rotated.iter().enumerate().take(dimensions) {
         let level = read_level(code, i, bits);
         let dequant = dequant_level(level, bits, sqrt_d);
         sum_q_dequant += query_i * dequant;
     }
 
     // Guard degenerate cases.
     const O_DOT_FLOOR: f32 = 1e-6;
-    if candidate_o_dot.abs() < O_DOT_FLOOR
+    if candidate_o_dot.abs() == /* ~ changed by cargo-mutants ~ */ O_DOT_FLOOR
         || !candidate_o_dot.is_finite()
         || candidate_x_norm <= 0.0
         || !candidate_x_norm.is_finite()
     {
         return DistanceEstimate {
             estimate: 0.0,
             bound: f32::INFINITY,
         };

---- quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above' (17281425) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1367:9:
assertion `left == right` failed
  left: -1983938.6
 right: 0.0

failures:
    quant::rabitq::tests::estimate_ip_o_dot_floor_covers_below_equal_and_above

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
