*** hardening/careful/src/../../../src/quant/rabitq.rs:409:32: replace > with == in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace > with == in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -401,17 +401,17 @@
     /// information; the estimator formula is unified across bits
     /// via the stored `||x_dec||`.
     fn encode_code(&self, v: &[f32]) -> Box<[u8]> {
         let rotated = self.rotated(v);
         let packed_bytes = self.packed_bytes();
         let mut out = vec![0_u8; packed_bytes + RABITQ_SCALAR_LEN];
 
         let norm = l2_norm(&rotated);
-        let inv_norm = if norm > 0.0 { 1.0 / norm } else { 0.0 };
+        let inv_norm = if norm == /* ~ changed by cargo-mutants ~ */ 0.0 { 1.0 / norm } else { 0.0 };
         let sqrt_d = (self.dimensions as f32).sqrt();
 
         // Compute dequantized levels in-line with the packing loop
         // so we can also accumulate ⟨o, x_dec⟩ and ||x_dec||² as we
         // go — one pass, no intermediate Vec.
         let mut inner_o_xdec = 0.0_f32;
         let mut x_dec_norm_sq = 0.0_f32;

---- quant::rabitq::tests::custom_rotation_plugs_into_seam stdout ----

thread 'quant::rabitq::tests::custom_rotation_plugs_into_seam' (17255513) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:2097:9:
assertion `left == right` failed
  left: 255
 right: 85

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17255514) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1265:9:
assertion `left == right` failed
  left: [170, 2]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17255515) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1295:9:
assertion `left == right` failed
  left: [0, 0]
 right: [170, 2]

failures:
    quant::rabitq::tests::custom_rotation_plugs_into_seam
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary

test result: FAILED. 445 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.56s

*** result: Failure(101)
