*** hardening/careful/src/../../../src/quant/rabitq.rs:429:30: replace > with < in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace > with < in <impl crate::quant::Quantizer for RaBitQQuantizer>::encode_code
@@ -421,17 +421,17 @@
             let (level_idx, dequant_i) = quantize_level(o_i * inv_norm, bits, sqrt_d);
             write_level(&mut out, i, bits, level_idx);
             inner_o_xdec += o_i * dequant_i;
             x_dec_norm_sq += dequant_i * dequant_i;
         }
 
         let x_dec_norm = x_dec_norm_sq.sqrt();
         let denom = norm * x_dec_norm;
-        let o_dot = if denom > 0.0 {
+        let o_dot = if denom < /* ~ changed by cargo-mutants ~ */ 0.0 {
             inner_o_xdec / denom
         } else {
             0.0
         };
 
         let s = packed_bytes;
         out[s..s + RABITQ_NORM_LEN].copy_from_slice(&norm.to_le_bytes());
         out[s + RABITQ_NORM_LEN..s + RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN]

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17260273) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1286:9:
assertion failed: (o_dot - expected_o_dot).abs() < 1e-6

---- quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned stdout ----

thread 'quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned' (17260276) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1328:9:
assertion failed: (estimate.estimate - expected_estimate).abs() < 1e-6

---- quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector stdout ----

thread 'quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector' (17260279) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1516:9:
sign-aligned self-IP exact, got estimate=0 truth=32 err=32

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::estimate_ip_guards_and_bound_are_pinned
    quant::rabitq::tests::estimator_recovers_self_ip_on_sign_aligned_vector
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::query_scorer_matches_estimator_for_nontrivial_pair

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
