*** hardening/careful/src/../../../src/quant/rabitq.rs:584:33: replace += with -= in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace += with -= in RaBitQQuantizer::encode_code_centered
@@ -576,17 +576,17 @@
 
         let mut sum_abs = 0.0_f32;
         let mut sum_center_sign = 0.0_f32;
         for (i, &r_i) in residual_rotated.iter().enumerate() {
             let level = if r_i >= 0.0 { 1_u32 } else { 0_u32 };
             write_level(&mut out, i, 1, level);
             sum_abs += r_i.abs();
             if level == 1 {
-                sum_center_sign += center.rotated[i];
+                sum_center_sign -= /* ~ changed by cargo-mutants ~ */ center.rotated[i];
             } else {
                 sum_center_sign -= center.rotated[i];
             }
         }
 
         let inv_denom = if residual_mag > 0.0 {
             1.0 / (residual_mag * sqrt_d)
         } else {

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17263087) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1740:9:
assertion failed: (read_tail_f32(&code, packed_bytes, RABITQ_NORM_LEN + RABITQ_UNIT_DOT_LEN) -
                3.375).abs() < 1e-6

---- quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors stdout ----

thread 'quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors' (17263088) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1918:13:
centered bound violated for seed=1: err=0.6193158 bound=0.12674442

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17263089) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1661:9:
self-centered unit IP should be 1.0, got 1.65625

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual
    quant::rabitq::tests::centered_estimator_bound_dominates_error_on_random_vectors
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.59s

*** result: Failure(101)
