*** hardening/careful/src/../../../src/quant/rabitq.rs:590:41: replace > with >= in RaBitQQuantizer::encode_code_centered

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace > with >= in RaBitQQuantizer::encode_code_centered
@@ -582,17 +582,17 @@
             sum_abs += r_i.abs();
             if level == 1 {
                 sum_center_sign += center.rotated[i];
             } else {
                 sum_center_sign -= center.rotated[i];
             }
         }
 
-        let inv_denom = if residual_mag > 0.0 {
+        let inv_denom = if residual_mag >= /* ~ changed by cargo-mutants ~ */ 0.0 {
             1.0 / (residual_mag * sqrt_d)
         } else {
             0.0
         };
         let o_dot = sum_abs * inv_denom;
         // ⟨x̄, c_tilde⟩ = (1/√D) · Σ c_tilde_i · sign(r_i), since
         // x̄ has elements ±1/√D and we accumulated with ±1 weights.
         let center_dot = sum_center_sign / sqrt_d;

---- quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual stdout ----

thread 'quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual' (17270146) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1748:9:
assertion `left == right` failed
  left: NaN
 right: 0.0

failures:
    quant::rabitq::tests::centered_encode_pins_asymmetric_center_tail_and_zero_residual

test result: FAILED. 450 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.59s

*** result: Failure(101)
