*** hardening/careful/src/../../../src/quant/rabitq.rs:757:35: replace < with > in CenteredScorer::score_at

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace < with > in CenteredScorer::score_at
@@ -749,17 +749,17 @@
         //   ⟨x̄, q_tilde_unit⟩ = (query_dot_code − center_dot) / ||q_r − c||
         //
         // RaBitQ estimator (residual unit vectors):
         //   ⟨q_unit_res, o_unit_res⟩ ≈ ⟨x̄, q_tilde_unit⟩ / o_dot
         const O_DOT_FLOOR: f32 = 1e-6;
         const QR_FLOOR: f32 = 1e-6;
         if o_dot.abs() < O_DOT_FLOOR
             || !o_dot.is_finite()
-            || query_residual_mag < QR_FLOOR
+            || query_residual_mag > /* ~ changed by cargo-mutants ~ */ QR_FLOOR
             || residual_mag <= 0.0
         {
             return DistanceEstimate {
                 estimate: 0.0,
                 bound: f32::INFINITY,
             };
         }
         let x_dot_q_unit = (query_dot_code - center_dot) / query_residual_mag;

---- quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual stdout ----

thread 'quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual' (17276193) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1661:9:
self-centered unit IP should be 1.0, got 0

---- quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above stdout ----

thread 'quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above' (17276194) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1783:9:
assertion `left == right` failed
  left: 250000.0
 right: 0.0

---- quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip stdout ----

thread 'quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip' (17276195) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1825:9:
assertion failed: (est.estimate - truth).abs() < 1e-5

failures:
    quant::rabitq::tests::centered_estimator_is_exact_on_sign_aligned_residual
    quant::rabitq::tests::centered_scorer_floor_boundaries_cover_below_equal_and_above
    quant::rabitq::tests::centered_scorer_matches_manual_unit_residual_ip
    quant::rabitq::tests::centered_scorer_pins_nontrivial_bound_formula

test result: FAILED. 447 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
