*** hardening/careful/src/../../../src/quant/rabitq.rs:998:38: replace * with / in quantize_level

*** mutation diff:
--- hardening/careful/src/../../../src/quant/rabitq.rs
+++ replace * with / in quantize_level
@@ -990,17 +990,17 @@
             (1, 1.0)
         } else {
             (0, -1.0)
         }
     } else {
         let levels = 1_u32 << bits;
         let c = RABITQ_QUANT_CLIP;
         let scaled = o_hat_i * sqrt_d;
-        let t = ((scaled + c) / (2.0 * c)).clamp(0.0, 1.0);
+        let t = ((scaled + c) / (2.0 / /* ~ changed by cargo-mutants ~ */ c)).clamp(0.0, 1.0);
         let level = ((t * levels as f32) as u32).min(levels - 1);
         // Bin center, mapped back to unit-vector scale.
         let center_scaled = (level as f32 + 0.5) / levels as f32 * 2.0 * c - c;
         let dequant = center_scaled / sqrt_d;
         (level, dequant)
     }
 }

---- quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars stdout ----

thread 'quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars' (17280233) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1265:9:
assertion `left == right` failed
  left: [255, 2]
 right: [233, 0]

---- quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels stdout ----

thread 'quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels' (17280234) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1295:9:
assertion `left == right` failed
  left: [255, 3]
 right: [170, 2]

---- quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary stdout ----

thread 'quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary' (17280243) panicked at hardening/careful/src/../../../src/quant/rabitq.rs:1569:9:
q=4 should reduce error vs q=1, got err_bin=52.911736 err_q4=110.06521

failures:
    quant::rabitq::tests::encode_code_pins_qbit_payload_and_scalars
    quant::rabitq::tests::encode_code_pins_zero_vector_tail_and_levels
    quant::rabitq::tests::qbit_encoder_reduces_error_vs_binary
    quant::rabitq::tests::qbit_quantize_and_dequantize_pin_level_midpoints
    quant::rabitq::tests::qbit_quantize_pins_non_roundtrip_scale_term

test result: FAILED. 446 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.56s

*** result: Failure(101)
